{
  "backend/main.mo": "Main Motoko actor for the chat backend, defining types and state for messages, chatrooms, user profiles, reactions, and active users, with functions for access control, CRUD operations on chatrooms/messages, reactions, flagging/reporting, and presence tracking.",
  "feature_evidence.json": "A feature evidence report mapping implemented feature IDs and titles to the specific frontend files and components they affect, along with test IDs and confidence levels.",
  "frontend-file-summaries.txt": "A JSON document containing short natural-language summaries of each frontend source file, serving as a reference for what each component, page, hook, and config file does.",
  "frontend/index.html": "Root HTML entry point for the React app with cache-busting meta tags, a versioned script tag pointing to main.tsx, and mobile viewport settings disabling user scaling.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with lobby, chatroom (with messageId search param validation), and admin routes, conditionally hiding the Header and Footer on admin and chatroom pages.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component allowing users to pick or upload a profile avatar, supporting file upload, GIF search via Giphy (with debounced search and trending fallback), and avatar removal.",
  "frontend/src/components/ChatArea.tsx": "Main chat area component that displays messages, handles auto-scrolling, reply context, and message sending for a given chatroom. Filters out Creator messages without media and supports scrolling to a target message with highlight.",
  "frontend/src/components/ChatroomCard.tsx": "Card component for displaying a chatroom in a list, rendering thumbnails for YouTube, Twitch, and Twitter media types along with metadata like message count and live status badges.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog form for creating a new chatroom with fields for topic, description, category, and media (file upload, YouTube/Twitch video URL, or Twitter post). Includes validation, upload progress, and Twitter embed preview.",
  "frontend/src/components/ExternalLinkDisclaimerModal.tsx": "Modal dialog that warns users before navigating to an external URL, displaying the target URL and offering Cancel or Continue actions.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/Header.tsx": "App header with the Chattr logo, an inline username editor with alphanumeric validation, an avatar picker trigger, and a back-to-lobby button when inside a chatroom.",
  "frontend/src/components/LoginPrompt.tsx": "Intentional no-op placeholder component that renders nothing, explicitly documenting that authentication is not used in this app.",
  "frontend/src/components/MessageBubble.tsx": "Renders an individual chat message bubble with support for reactions, replies, media embeds (YouTube, Twitch, Twitter, images, voice), context menus, reporting, link detection, and an external link disclaimer modal.",
  "frontend/src/components/MessageInput.tsx": "A rich message input component supporting text, image upload, voice recording, GIF search via Giphy, and auto-detection of YouTube/Twitch/Twitter URLs in message text. Handles debounced GIF search, upload progress, and media preview before sending.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned video (YouTube or Twitch) in an aspect-ratio iframe within a chatroom, with an unpin button that calls the unpinVideo mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "An audio player component for voice messages featuring a randomized waveform visualization, play/pause toggle, scrubbing slider, and time display, with synchronization to pause other playing audio elements.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor using the current Internet Identity, returning an anonymous actor when unauthenticated and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "A generic hook that returns a debounced version of a given value, delaying updates by a configurable delay (default 300ms).",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "A hook that ensures a fresh chatroom list is fetched when the actor becomes ready by purging stale or empty cached entries and explicitly refetching the canonical chatrooms query, exposing a recovery-in-progress flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login flow, identity persistence across page reloads, and exposing login status states.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks and mutations for chatroom, message, and reaction operations, along with utilities for localStorage-based user identity, image upload with compression, and normalized query keys.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, CSS custom properties for light/dark themes, mobile input zoom prevention, and custom styles for voice message range inputs.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants including the Giphy API key and result limit.",
  "frontend/src/lib/formatters.ts": "Exports a single utility function that formats numbers into compact human-readable strings with k, M, or B suffixes.",
  "frontend/src/lib/giphy.ts": "Provides functions to search Giphy and fetch trending GIFs via the Giphy REST API, returning normalized GIF objects.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file with no content.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses image files using an HTML canvas, with progress callbacks and fallback to the original file.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file with no content.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON to extract a safe preview (author, text, image) with in-flight deduplication and localStorage caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching of Twitter oEmbed preview objects with versioning, expiration (7 days), and cache-clearing utilities.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file with no content.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file with no content.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video/channel IDs from YouTube, Twitch, and Twitter/X URLs, and generating thumbnail and embed URLs for each platform.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Password-protected admin moderation page that lists chatrooms and flagged messages, allowing admins to delete chatrooms after session-based authentication.",
  "frontend/src/pages/ChatroomPage.tsx": "Page component that loads a specific chatroom by ID, increments its view count on load, and renders the ChatArea component with optional deep-link target message support.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying a searchable, filterable, and algorithmically sorted list of chatrooms with options to create new ones and navigate into existing ones.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, border radii, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Project state tracking file recording the current build goals, existing features, known issues (avatar/username regressions), and pending action requests for the chat application."
}