{
  "backend/main.mo": "Main Motoko actor for the chat backend, defining data types (Message, Chatroom, UserProfile, etc.) and implementing chatroom/message management, access control, blob storage, active user tracking, and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report mapping three UI requirements (vertical alignment, reduced padding in MessageInput, and hidden message ID in MessageBubble) to their implementing files and test IDs.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, describing component responsibilities, hooks, and notable implementation details.",
  "frontend/index.html": "Root HTML entry point for the React app with cache-busting meta tags, a versioned module script tag, and a single root div.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with lobby, chatroom (with messageId search param), and admin routes, hiding the header and footer on admin pages.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component allowing users to upload an image, remove their avatar, or select a GIF from Giphy (with debounced search and trending fallback) as their profile avatar.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface component that renders messages, handles auto-scroll and scroll-to-target-message with highlight, manages reply context, filters Creator messages without media, and displays pinned video and category tags.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a card for a chatroom with thumbnail previews for YouTube, Twitch, and Twitter media, displaying topic, stats, and live status badges.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog form for creating a new chatroom with fields for topic, description, category, and media (image upload, video URL, or Twitter post).",
  "frontend/src/components/ExternalLinkDisclaimerModal.tsx": "Modal dialog that warns users before navigating to an external URL, showing the target link and offering Cancel/Continue actions.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with the Chattr logo, back-to-lobby navigation for chatroom routes, and an editable username with avatar picker.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that renders nothing; authentication is intentionally not used in this app.",
  "frontend/src/components/MessageBubble.tsx": "Renders an individual chat message with support for reactions, pinning, replies, inline media embeds (YouTube, Twitch, Twitter, GIFs), and external link disclaimers.",
  "frontend/src/components/MessageInput.tsx": "Chat input component supporting text messages, image/GIF uploads, voice recording, and auto-detection of YouTube/Twitch/Twitter URLs in typed text.",
  "frontend/src/components/PinnedVideo.tsx": "Renders a pinned YouTube or Twitch video embed within a chatroom, with an unpin button that calls the useUnpinVideo mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component for voice messages featuring a waveform visualization, play/pause toggle, seek slider, and playback time display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic hook that returns a debounced version of a value, updating only after the specified delay has elapsed since the last change.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that purges stale or empty cached chatroom data and forces a fresh refetch of the chatrooms query once the actor becomes ready, exposing a recovery-in-progress flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context (login, logout, identity, status) via a React context provider and hook, backed by the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks for all backend interactions including fetching/searching chatrooms, sending messages, managing reactions, user profiles, and pinned videos.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines light/dark theme CSS custom properties (OKLCH color tokens), and includes mobile-specific input styles and custom voice message range input styling.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants including the Giphy API key and result limit.",
  "frontend/src/lib/formatters.ts": "Exports a single utility function `formatCompactNumber` that formats numbers into compact human-readable strings (k, M, B suffixes).",
  "frontend/src/lib/giphy.ts": "Provides functions to search Giphy by term and fetch trending GIFs, returning normalized GIF objects with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for a lazy-loading utility for the html2canvas library.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses image files using a canvas, with configurable max dimensions, quality, and progress callback.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for a Twitter embed rendering utility.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON to extract safe preview fields (author, text, image) with in-flight deduplication and localStorage caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "localStorage cache layer for Twitter oEmbed preview data, supporting versioned entries with a 7-day expiration and cache key derivation from tweet IDs.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for a Twitter thumbnail fetching utility.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for a Twitter thumbnail caching utility.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video/post IDs and generating thumbnail or embed URLs for YouTube, Twitch, and Twitter/X links.",
  "frontend/src/main.tsx": "React application entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Password-protected admin page that lists all chatrooms in a filterable table and allows deletion of individual chatrooms via a confirmation dialog.",
  "frontend/src/pages/ChatroomPage.tsx": "Page component that loads a specific chatroom by ID, handles loading/error states, increments the view count on mount, and renders the ChatArea with optional deep-link target message support.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying all chatrooms with client-side search, category filtering, and algorithmic sorting (live rooms first, then by view count and creation date), plus a dialog to create new chatrooms.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with OKLCH-based semantic color tokens, custom border radii, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for the Chattr app tracking schema version, existing implemented features (input alignment, compact padding, hidden message IDs), and architectural notes about message ID DOM requirements."
}