{
  "backend/main.mo": "Main Motoko actor for the chat backend, defining data types (Message, Chatroom, UserProfile, etc.) and managing chatrooms, messages, reactions, active users, and access control with admin-gated operations.",
  "feature_evidence.json": "Feature evidence report mapping three UI features (share link zero-padding, font-mono message IDs, Twitter embed max-width change) to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, describing the purpose and key behaviors of components, hooks, pages, and config files.",
  "frontend/index.html": "Root HTML entry point for the React app with viewport meta tags, cache-busting HTTP headers, and a versioned script tag loading main.tsx.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with lobby, chatroom (with messageId search param), and admin routes, hiding the header and footer on admin pages.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component allowing users to upload a custom avatar image or select a GIF from Giphy (with debounced search and trending fallback), and remove their current avatar.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface component that renders filtered messages, handles auto-scroll and scroll-to-target-message with highlight, manages reply context, and integrates pinned video and message input.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a card for a chatroom listing, displaying thumbnail previews for YouTube, Twitch, and Twitter media URLs, along with metadata like topic, category, viewer count, and last activity timestamp.",
  "frontend/src/components/CreateChatroomDialog.tsx": "A dialog form for creating a new chatroom, supporting topic, description, category selection, and media attachment via file upload, video URL (YouTube/Twitch), or Twitter post with live preview.",
  "frontend/src/components/ExternalLinkDisclaimerModal.tsx": "A confirmation modal that warns users they are leaving the app before navigating to an external URL, showing the target URL and Cancel/Continue buttons.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "The app header with the Chattr logo, an inline username editor with alphanumeric validation, an avatar picker trigger, and a back-to-lobby button when inside a chatroom.",
  "frontend/src/components/LoginPrompt.tsx": "A no-op placeholder component that renders nothing, explicitly documenting that authentication is not used in this app.",
  "frontend/src/components/MessageBubble.tsx": "Renders an individual chat message bubble with support for reactions, pinning, replies, inline media embeds (YouTube, Twitch, Twitter, Giphy, images, voice), URL link detection, and an external link disclaimer modal.",
  "frontend/src/components/MessageInput.tsx": "A chat message input component supporting text messages, image/GIF uploads, voice recording, auto-detection of YouTube/Twitch/Twitter URLs in typed text, and a Giphy search panel.",
  "frontend/src/components/PinnedVideo.tsx": "Renders a pinned YouTube or Twitch video embed within a chatroom, with an unpin button that calls the useUnpinVideo mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component for voice messages featuring a waveform visualization, play/pause toggle, seek slider, and playback time display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic hook that debounces a value by a configurable delay, returning the latest stable value after the delay elapses.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that purges stale or empty cached chatroom data and forces a fresh refetch of the chatrooms query once the actor becomes ready, exposing a recovery-in-progress flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context (login, logout, identity state) via a React context provider and hook, backed by the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks for all backend interactions including fetching, searching, and mutating chatrooms, messages, reactions, user profiles, and pinned videos.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines light/dark theme CSS custom properties (OKLCH color tokens), and includes mobile-specific input styles and custom voice message range input styling.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants including the Giphy API key and result limit.",
  "frontend/src/lib/formatters.ts": "Exports a single utility function `formatCompactNumber` that formats numbers into compact human-readable strings (k, M, B suffixes).",
  "frontend/src/lib/giphy.ts": "Provides functions to search Giphy and fetch trending GIFs via the Giphy API, returning normalized GIF objects with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder or stub for a lazy-loaded html2canvas module.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses image files using an HTML canvas, with configurable max dimensions, quality, and progress callback.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder or stub for a Twitter embed rendering module.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON to extract safe preview fields (author, text, image) with in-flight deduplication and localStorage caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "localStorage cache layer for Twitter oEmbed preview data, supporting versioned entries with a 7-day expiration and cache key derivation from tweet IDs.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder or stub for a Twitter thumbnail fetching module.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder or stub for a Twitter thumbnail cache module.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video/post IDs from YouTube, Twitch, and Twitter/X URLs, and generating corresponding thumbnail and embed URLs.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and an Internet Identity authentication provider wrapping the root `App` component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Password-protected admin page that lists all chatrooms in a filterable table and allows deletion of individual chatrooms. Uses session storage to persist authentication state.",
  "frontend/src/pages/ChatroomPage.tsx": "Page component that loads a specific chatroom by ID, increments its view count on load, and renders the ChatArea component. Handles loading and error states for both actor initialization and chatroom fetching.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying a searchable, category-filterable list of chatrooms sorted algorithmically (live first, then by view count, then by creation date). Includes a dialog for creating new chatrooms.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, extended border radius, box shadow, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking three pending fix requests: zero-padding message IDs in share links to 9 digits, applying font-mono to in-bubble message IDs, and increasing X post iframe max-width from 250px to 300px."
}