{
  "backend/main.mo": "Main Motoko actor for the chat backend, defining data types (Message, Chatroom, UserProfile, etc.) and implementing CRUD operations for chatrooms, messages, reactions, user profiles, active users, and access control with admin/role-based permissions.",
  "feature_evidence.json": "Feature evidence report documenting that the current-user message header reordering feature (Message ID → Timestamp → Username → Avatar) is implemented in MessageBubble.tsx with high confidence.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, serving as a reference document for the project's frontend architecture and component responsibilities.",
  "frontend/index.html": "Root HTML entry point for the React app with cache-busting meta tags, a versioned script import, and a single root div for mounting the application.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with lobby, chatroom, and admin routes, conditionally renders Header/Footer (hidden on admin pages), and wraps everything in ThemeProvider and Toaster.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component allowing users to set their avatar via file upload or by selecting a GIF from Giphy (with debounced search and trending fallback), and to remove their current avatar.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface component that renders filtered messages, handles auto-scroll and scroll-to-target-message with highlight, manages reply context, and composes PinnedVideo, MessageBubble, and MessageInput sub-components.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a card for a chatroom with thumbnail previews for YouTube, Twitch, and Twitter media, displaying topic, stats, and live status badges.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Modal dialog for creating a new chatroom with fields for topic, description, category, and media (image upload, video URL, or Twitter post).",
  "frontend/src/components/ExternalLinkDisclaimerModal.tsx": "Dialog that warns users before navigating to an external URL, showing the target link and offering Cancel or Continue actions.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with the Chattr logo, back-to-lobby navigation, inline username editing with alphanumeric validation, and an avatar picker.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that renders nothing, explicitly noting that authentication is not used in this app.",
  "frontend/src/components/MessageBubble.tsx": "Renders an individual chat message with support for reactions, pinning, replies, media embeds (YouTube, Twitch, Twitter, GIFs), inline link detection, and an external link disclaimer.",
  "frontend/src/components/MessageInput.tsx": "Chat input component supporting text messages, image uploads, GIF search via Giphy, voice recording, and automatic detection of YouTube/Twitch/Twitter URLs in typed text.",
  "frontend/src/components/PinnedVideo.tsx": "Renders a pinned YouTube or Twitch video embed within a chatroom, with an unpin button that calls the useUnpinVideo mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component for voice messages featuring a waveform visualization, play/pause toggle, seek slider, and playback time display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic hook that returns a debounced version of a value, updating only after a configurable delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that purges stale or empty cached chatroom data and forces a fresh refetch of the chatrooms query once the actor becomes ready, exposing a recovery-in-progress flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context (login, logout, identity, status) via a React context provider backed by the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for chatroom and message operations, including fetching, searching, creating chatrooms, sending messages, reactions, pinning videos, and user profile management.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines light/dark theme CSS custom properties (OKLCH color tokens), and includes mobile-specific input styles and custom voice message range input styling.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants including the Giphy API key and result limit.",
  "frontend/src/lib/formatters.ts": "Exports a single utility function `formatCompactNumber` that formats numbers into compact human-readable strings (k, M, B suffixes).",
  "frontend/src/lib/giphy.ts": "Provides functions to search Giphy and fetch trending GIFs via the Giphy API, returning normalized GIF objects with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for a lazy-loader for the html2canvas library.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses image files using an HTML canvas, with configurable max dimensions, quality, and progress callbacks.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for a Twitter embed rendering utility.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON to extract safe preview fields (author, text, image) with in-flight deduplication and localStorage caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching of Twitter oEmbed preview objects with versioning, expiration (7 days), and cache key generation based on tweet ID.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for a Twitter thumbnail fetching utility.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for a Twitter thumbnail caching utility.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video/post IDs and generating thumbnail or embed URLs for YouTube, Twitch, and Twitter/X URLs.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Password-protected admin page that lists all chatrooms in a filterable table and allows deletion of individual chatrooms via a confirmation dialog.",
  "frontend/src/pages/ChatroomPage.tsx": "Page component that loads a specific chatroom by ID, increments its view count on mount, and renders the ChatArea component; handles loading and error states.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying a searchable, category-filterable, algorithmically sorted list of chatrooms with a button to create new ones.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radii, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata for the Chattr app, tracking existing features, a pending layout reorder request for current-user message headers, and architectural notes."
}