{
  "backend/main.mo": "Main Motoko actor for the chat backend, defining types and state for messages, chatrooms, user profiles, reactions, and active users, with functions for access control, CRUD operations, flagging/reporting, and blob storage via mixins.",
  "feature_evidence.json": "Feature evidence report listing four UI improvement features for MessageBubble.tsx: top-aligning the avatar, increasing username font size, moving the timestamp inside the bubble, and suppressing native mobile long-press/context menu behavior.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, serving as a reference document for the project's frontend architecture and component responsibilities.",
  "frontend/index.html": "Root HTML entry point for the React app with viewport meta tags disabling user scaling, cache-busting HTTP headers, and a versioned module script tag loading main.tsx.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with lobby, chatroom (with messageId search param), and admin routes, conditionally hiding the header and footer on admin and chatroom pages.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component for selecting or uploading a user avatar, supporting file upload, GIF search via Giphy (with debounced input and trending fallback), and avatar removal.",
  "frontend/src/components/ChatArea.tsx": "Main chat area component that displays messages for a chatroom, handles auto-scrolling, reply context, and message sending, while filtering out Creator messages without media.",
  "frontend/src/components/ChatroomCard.tsx": "Card component for displaying a chatroom preview with thumbnail support for YouTube, Twitch, and Twitter media types, along with metadata like message count and timestamps.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog component for creating a new chatroom with fields for topic, description, category, and media (file upload, YouTube/Twitch video URL, or Twitter post).",
  "frontend/src/components/ExternalLinkDisclaimerModal.tsx": "Modal dialog that warns users they are leaving the app when clicking an external link, showing the target URL and requiring confirmation before proceeding.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with the Chattr logo, back-to-lobby navigation for chatroom routes, and an inline username editor with avatar picker.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that renders nothing, explicitly documenting that authentication is not used in this app.",
  "frontend/src/components/MessageBubble.tsx": "Renders an individual chat message bubble with support for reactions, replies, media embeds (YouTube, Twitch, Twitter, images, voice), link detection, pinning, reporting, and an external link disclaimer modal.",
  "frontend/src/components/MessageInput.tsx": "A rich message input component supporting text, image upload, voice recording, GIF search via Giphy, and auto-detection of YouTube/Twitch/Twitter URLs in messages. Handles debounced GIF search, upload progress, and media preview before sending.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned video (YouTube or Twitch) in a chatroom with an unpin button that calls the unpinVideo mutation. Renders the appropriate iframe embed based on media type.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "An audio player component for voice messages featuring a waveform visualization, play/pause toggle, seek slider, and time display. Pauses other playing audio elements when activated.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using an authenticated identity if available or falling back to anonymous. Invalidates and refetches all non-actor queries when the actor instance changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "A generic hook that returns a debounced version of the provided value, delaying updates by a configurable delay (default 300ms).",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "A hook that forces a fresh refetch of the chatroom list when the actor becomes ready by purging stale or empty cached entries and explicitly refetching the canonical chatrooms query. Exposes an isRecovering flag for loading state display.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks and mutations for chatroom, message, reaction, and user operations, along with localStorage-based username/avatar management and a client-side image upload utility.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind base/components/utilities, defines light and dark CSS custom properties (OKLCH color tokens), and adds mobile-specific input and voice-message range-input styles.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants for the Giphy API key and result limit.",
  "frontend/src/lib/formatters.ts": "Exports a single utility function that formats numbers or bigints into compact human-readable strings (k, M, B suffixes).",
  "frontend/src/lib/giphy.ts": "Provides async functions to search Giphy and fetch trending GIFs via the Giphy REST API, returning normalized GIF objects or error messages.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file with no content.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and re-encodes image files using an HTML canvas, with progress callbacks and a fallback to the original file if compression increases size.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file with no content.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON to extract a safe preview (author name, text snippet, optional image URL), with in-flight deduplication and localStorage caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "localStorage cache layer for Twitter oEmbed preview objects, supporting versioned entries with a 7-day expiration and helpers to get, set, and clear cached previews.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file with no content.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file with no content.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video/channel IDs from YouTube, Twitch, and Twitter/X URLs, and generating thumbnail and embed URLs for each platform.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Password-protected admin moderation page that lists chatrooms and flagged messages, allowing admins to delete chatrooms after session-based authentication.",
  "frontend/src/pages/ChatroomPage.tsx": "Page component that loads a specific chatroom by ID, increments its view count on load, and renders the ChatArea component with optional deep-link target message support.",
  "frontend/src/pages/LobbyPage.tsx": "Lobby page displaying all chatrooms with client-side search, category filtering, and algorithmic sorting (live rooms first, then by view count and creation date).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radii, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata for the Chattr app tracking existing features and pending feature requests related to MessageBubble UI improvements such as avatar alignment, font sizing, timestamp placement, and mobile long-press suppression."
}