{
  "backend/main.mo": "Main Motoko actor for the chat backend, defining data types (Message, Chatroom, UserProfile, etc.), state management with OrderedMaps, and shared functions for chatrooms, messages, reactions, user profiles, active users, and access control.",
  "feature_evidence.json": "Feature evidence report mapping three UI feature IDs (MessageInput vertical centering, reduced padding, and MessageBubble hidden message IDs) to their relevant source files and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's frontend components, hooks, pages, and configuration.",
  "frontend/index.html": "Root HTML entry point for the React app with cache-busting meta tags, a viewport meta tag disabling user scaling, and a versioned module script tag loading main.tsx.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with lobby, chatroom (with messageId search param), and admin routes, and conditionally renders the Header and Footer based on the current route.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component allowing users to pick or upload a profile avatar, supporting file upload, avatar removal, and Giphy GIF search/trending with debounced queries.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface component that renders messages, handles auto-scroll and scroll-to-target-message with highlight, manages reply context, filters Creator messages without media, and displays pinned video and category tags.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a card for a chatroom with thumbnail previews for YouTube, Twitch, and Twitter media, displaying metadata like topic, category, viewer count, and last activity timestamp.",
  "frontend/src/components/CreateChatroomDialog.tsx": "A dialog form for creating a new chatroom, supporting topic, description, category, and media attachment via file upload, video URL (YouTube/Twitch), or Twitter post with live preview.",
  "frontend/src/components/ExternalLinkDisclaimerModal.tsx": "A confirmation modal that warns users they are leaving the app before navigating to an external URL, with Cancel and Continue actions.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "The app header with the Chattr logo, a back button when inside a chatroom, and an inline username editor with avatar picker for the current user.",
  "frontend/src/components/LoginPrompt.tsx": "A no-op placeholder component that renders nothing, explicitly noting that authentication is not used in this app.",
  "frontend/src/components/MessageBubble.tsx": "Renders an individual chat message bubble with support for reactions, pinning, replies, media embeds (YouTube, Twitch, Twitter, GIFs), clickable links with an external-link disclaimer, and voice message playback.",
  "frontend/src/components/MessageInput.tsx": "A chat message input component supporting text messages, image/GIF uploads, voice recording, and auto-detection of YouTube/Twitch/Twitter URLs embedded in message text.",
  "frontend/src/components/PinnedVideo.tsx": "Renders a pinned YouTube or Twitch video embed inside a chatroom with an unpin button that calls the useUnpinVideo mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component for voice messages featuring a waveform visualization, play/pause toggle, seek slider, and time display, with multi-instance playback synchronization.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates all dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic hook that debounces a value by a configurable delay, returning the latest settled value after the delay elapses.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that purges stale or empty cached chatroom data and forces a fresh refetch of the chatrooms query once the actor becomes ready, exposing an isRecovering flag for loading UI.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context (login, logout, identity, status) via a React context provider backed by the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks and mutations for all backend interactions including chatrooms, messages, reactions, user profiles, and media operations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines light/dark theme CSS custom properties (OKLCH color tokens), and includes mobile-specific input styles and custom voice message range input styling.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants including the Giphy API key and result limit.",
  "frontend/src/lib/formatters.ts": "Exports a single utility function `formatCompactNumber` that formats numbers into compact human-readable strings (k, M, B suffixes).",
  "frontend/src/lib/giphy.ts": "Provides functions to search Giphy by term and fetch trending GIFs, returning normalized GIF objects with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder or stub for a lazy html2canvas loader module.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses image files using a canvas, skipping GIFs/SVGs and falling back to the original if compression increases file size.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder or stub for a Twitter embed rendering module.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON to extract safe preview fields (author, text, image) with in-flight deduplication and localStorage caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "localStorage cache layer for Twitter oEmbed preview data, supporting versioned entries with a 7-day expiration and cache key derivation from tweet IDs.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder or stub for a Twitter thumbnail fetching module.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder or stub for a Twitter thumbnail cache module.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video/channel IDs from YouTube, Twitch, and Twitter/X URLs and generating corresponding thumbnail and embed URLs.",
  "frontend/src/main.tsx": "React application entry point that mounts the app with React Query, Internet Identity authentication, and global CSS providers.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Password-protected admin page that lists all chatrooms in a filterable table and allows deletion of individual chatrooms. Uses session storage for auth persistence and hardcoded admin password.",
  "frontend/src/pages/ChatroomPage.tsx": "Page component that loads a specific chatroom by ID, increments its view count on load, and renders the ChatArea component. Handles loading and error states for both actor initialization and chatroom fetching.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying a searchable, filterable, and algorithmically sorted list of chatrooms with options to create new ones. Sorts by live status, view count, and creation date.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH color tokens, extended border radii, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for the Chattr app at version 3, documenting three completed UI refinement features: vertically aligned chat input elements, reduced input area padding, and visually hidden message ID labels."
}