{
  "backend/main.mo": "Main Motoko actor for the chat backend, defining data types and state for chatrooms, messages, user profiles, reactions, and active users, with access control, blob storage, and HTTP outcall integrations.",
  "feature_evidence.json": "Feature evidence report confirming that the visible message ID display was removed from MessageBubble.tsx while preserving DOM anchor/share-link functionality, with high confidence and a single test ID.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of each frontend source file, describing the purpose and key implementation details of components, hooks, pages, and config files.",
  "frontend/index.html": "Root HTML entry point for the React app with cache-busting meta tags, a versioned module script tag, and a single #root mount div.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with lobby, chatroom (with messageId search param), and admin routes, conditionally hiding the header and footer on admin and chatroom pages.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component for selecting or uploading a user avatar, supporting file upload, GIF search via Giphy (with debouncing and trending fallback), and avatar removal.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface component that renders filtered messages, handles auto-scroll and scroll-to-target-message with highlight, manages reply context, and integrates pinned video and message input.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a card for a chatroom with thumbnail previews for YouTube, Twitch, and Twitter media, displaying topic, category, live status, and participant counts.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog form for creating a new chatroom with fields for topic, description, category, and media (image upload, video URL, or Twitter post).",
  "frontend/src/components/ExternalLinkDisclaimerModal.tsx": "Modal dialog that warns users they are leaving the app before navigating to an external URL, with Cancel and Continue actions.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with the Chattr logo, back-to-lobby navigation, inline username editing with alphanumeric validation, and an avatar picker.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that renders nothing; authentication is intentionally not used in this app.",
  "frontend/src/components/MessageBubble.tsx": "Renders a single chat message bubble with support for reactions, pinning, replies, inline media embeds (YouTube, Twitch, Twitter, GIFs), and external link disclaimers.",
  "frontend/src/components/MessageInput.tsx": "Chat message input component supporting text, image uploads, GIF search via Giphy, voice recording, and auto-detection of YouTube/Twitch/Twitter URLs in typed text.",
  "frontend/src/components/PinnedVideo.tsx": "Renders a pinned YouTube or Twitch video embed within a chatroom, with an unpin button that calls the useUnpinVideo mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component for voice messages featuring a waveform visualization, play/pause toggle, seek slider, and playback time display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic hook that debounces a value by a configurable delay, returning the latest settled value after the delay period.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that purges stale or empty cached chatroom data and forces a fresh refetch of the chatrooms list once the actor becomes ready, exposing a recovery-in-progress flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context (login, logout, identity, status) via a React context provider and hook, backed by the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for chatroom and message operations (fetch, search, create, send, react, pin, etc.) along with local-storage helpers for anonymous user identity.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines light/dark theme CSS custom properties (OKLCH color tokens), and includes mobile-specific input styles and custom voice message range input styling.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants including the Giphy API key and result limit.",
  "frontend/src/lib/formatters.ts": "Exports a single utility function `formatCompactNumber` that formats numbers into compact human-readable strings (k, M, B suffixes).",
  "frontend/src/lib/giphy.ts": "Provides functions to search Giphy and fetch trending GIFs via the Giphy API, returning typed `GiphyGif` result arrays.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for lazy-loading the html2canvas library.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses image files using a canvas, with configurable max dimensions, quality, and optional progress callback.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON to extract safe preview fields (author, text, image) with in-flight deduplication and localStorage caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "localStorage cache layer for Twitter oEmbed preview data, supporting versioned entries with a 7-day expiration and cache key derivation from tweet IDs.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail fetching logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for a Twitter thumbnail caching layer.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video/post IDs and generating thumbnail or embed URLs for YouTube, Twitch, and Twitter/X links.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and an Internet Identity authentication provider wrapping the root `App` component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Password-protected admin page that lists all chatrooms in a filterable table and allows deletion via a confirmation dialog. Uses a hardcoded password with sessionStorage for auth persistence.",
  "frontend/src/pages/ChatroomPage.tsx": "Page component that loads a specific chatroom by ID, increments its view count on first load, and renders the ChatArea component; handles loading and not-found error states.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying all chatrooms with client-side search, category filtering, and algorithmic sorting (live rooms first, then by view count and creation date); includes a dialog to create new chatrooms.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based design tokens for colors, custom border radii, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current state of the Chattr project (v335), recording deployed features, known issues, and a pending task to hide visible message IDs from chat bubbles while preserving DOM anchors for share links."
}