{
  "backend/main.mo": "Main Motoko actor for the chat backend, defining types and state for messages, chatrooms, user profiles, reactions, and active users, with functions for access control, messaging, chatroom management, flagging, and blob storage.",
  "feature_evidence.json": "Feature evidence report confirming that MessageBubble.tsx was updated to replace inline action buttons (Reply, React, Share) with a right-click/long-press context menu, with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference for the current state and responsibilities of all frontend components, pages, hooks, and config files.",
  "frontend/index.html": "Root HTML entry point for the React app with cache-busting meta tags, a root div, and a versioned module script tag pointing to main.tsx.",
  "frontend/src/App.tsx": "Main React application component that sets up TanStack Router with lobby, chatroom (with messageId search param validation), and admin routes, conditionally hiding the header and footer on admin and chatroom pages.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component for selecting or uploading a user avatar, supporting file upload, GIF search via Giphy (with debounced search and trending fallback), and avatar removal.",
  "frontend/src/components/ChatArea.tsx": "Chat interface component that renders filtered messages, handles auto-scroll and deep-link scroll-to-target with highlight, manages reply context, and integrates pinned video, message input, and collapsible header.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a card for a chatroom with thumbnail previews for YouTube, Twitch, and Twitter media, displaying topic, stats, and live status badges.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Modal dialog for creating a new chatroom with fields for topic, description, category, and media (image upload, video URL, or Twitter post).",
  "frontend/src/components/ExternalLinkDisclaimerModal.tsx": "Confirmation dialog that warns users before navigating to an external URL, showing the target link and Cancel/Continue buttons.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with the Chattr logo, back-to-lobby navigation, inline username editing with alphanumeric validation, and an avatar picker.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that renders nothing; authentication is intentionally not used in this app.",
  "frontend/src/components/MessageBubble.tsx": "Renders an individual chat message with support for reactions, pinning, replies, URL link detection, media embeds (YouTube, Twitch, Twitter, GIFs), voice playback, and a context menu for actions.",
  "frontend/src/components/MessageInput.tsx": "Chat input component supporting text messages, image uploads, GIF search via Giphy, voice recording, and auto-detection of YouTube/Twitch/Twitter URLs in typed text.",
  "frontend/src/components/PinnedVideo.tsx": "Renders a pinned YouTube or Twitch video embed within a chatroom, with an unpin button that calls the useUnpinVideo mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component for voice messages featuring a waveform visualization, play/pause toggle, seek slider, and playback time display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic hook that returns a debounced version of the provided value, updating only after the specified delay has elapsed.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that purges stale or empty cached chatroom data and forces a fresh refetch of the chatrooms list once the actor becomes ready, exposing a recovery-in-progress flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks and mutations for chatrooms, messages, reactions, and user data, plus utilities for image upload, username/avatar management, and query key normalization.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines light/dark theme CSS variables using OKLCH color space, and includes custom styles for mobile inputs, voice message range sliders, and layout.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants including the Giphy API key and result limit.",
  "frontend/src/lib/formatters.ts": "Exports a single utility function `formatCompactNumber` that formats numbers into compact notation (k, M, B).",
  "frontend/src/lib/giphy.ts": "Provides functions to search Giphy and fetch trending GIFs via the Giphy API, returning normalized GIF objects with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for a lazy-loader for the html2canvas library.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses image files using a canvas, skipping GIFs and SVGs, and returning the smaller of the original or compressed file.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for a Twitter embed rendering utility.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON to extract safe preview fields (author, text, image) with in-flight deduplication and localStorage caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements a versioned localStorage cache for Twitter oEmbed preview data with 7-day expiration and cache key derivation from tweet IDs.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for a Twitter thumbnail fetching utility.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for a Twitter thumbnail caching utility.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video/channel IDs from YouTube, Twitch, and Twitter/X URLs and generating their corresponding thumbnail and embed URLs.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Password-protected admin moderation page that lists chatrooms with filtering/flagging options and allows deletion of individual chatrooms via a confirmation dialog.",
  "frontend/src/pages/ChatroomPage.tsx": "Page component that loads a specific chatroom by ID, increments its view count on mount, and renders the ChatArea component; handles loading and error states.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying a searchable, filterable, algorithmically sorted list of chatrooms with a dialog to create new ones.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radii, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata for the Chattr app at version 344, tracking the pending feature to replace inline message action buttons with a right-click/long-press context menu without style changes."
}