{
  "kind": "build_request",
  "title": "Vertically align input elements, reduce input padding, hide message IDs visually",
  "projectName": "Chattr",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the chat input area (MessageInput component), vertically center-align all elements — the text input field and all action buttons — so they share the same horizontal axis.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Vertically align the input area elements (buttons + text input) so they're centered on the same axis"
        ]
      },
      "acceptanceCriteria": [
        "The text input and all buttons in the chat input bar are vertically centered on the same axis",
        "No other layout or styling changes are introduced"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Reduce vertical padding in the chat input area (MessageInput component) to give more vertical space to the chat messages area above it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Reduce vertical padding in the chat input area to give more room to the chat messages"
        ]
      },
      "acceptanceCriteria": [
        "The chat input area has less vertical padding than before",
        "More vertical space is available for the messages list",
        "No other style changes are introduced"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Visually hide message ID labels in the chat message bubbles (MessageBubble component) so they are not visible to users, while preserving their DOM presence with the correct anchor IDs so that share links and URL-based anchoring remain fully functional.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Hide message IDs visually while keeping share links and URL anchoring fully functional"
        ]
      },
      "acceptanceCriteria": [
        "Message ID text is not visible in the chat UI",
        "Each message still has its anchor element in the DOM with the correct ID attribute",
        "Navigating to a share link scrolls to and highlights the correct message",
        "No other style or functionality changes are introduced"
      ]
    }
  ],
  "constraints": [
    "No other style or functionality changes beyond the three listed requirements",
    "Share link and URL anchor functionality must remain fully intact after hiding message IDs"
  ],
  "nonGoals": [
    "Backend changes",
    "Changes to any component other than MessageInput and MessageBubble",
    "Modifying message ID generation or storage logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}