{
  "kind": "build_request",
  "title": "Replace message action buttons with context menu (right-click / long-press)",
  "projectName": "Chattr",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In MessageBubble.tsx, replace the always-visible Reply, React, and Share action buttons with a context menu: on desktop, the menu opens on right-click of the message bubble; on mobile, the menu opens on long-press (touch hold ~500ms). The menu must contain exactly the same three actions — Reply, React, and Share — with identical functionality to the current buttons. No other changes to MessageBubble.tsx or any other file.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Replace the message action buttons (Reply, React, Share) with a context menu",
          "Right-click on desktop to open the menu",
          "Long-press on mobile to open the menu",
          "Menu contains the same actions: Reply, React, Share",
          "No other changes — no style changes, no layout changes, nothing else modified"
        ]
      },
      "acceptanceCriteria": [
        "The Reply, React, and Share buttons are no longer visible by default on message bubbles",
        "Right-clicking a message bubble on desktop opens a context menu with Reply, React, and Share options",
        "Long-pressing (~500ms) a message bubble on mobile opens the same context menu",
        "Each menu action (Reply, React, Share) performs the same operation as the original buttons",
        "The context menu closes when clicking/tapping outside of it",
        "No other UI elements, styles, layouts, or behaviors are changed"
      ]
    }
  ],
  "constraints": [
    "Only modify MessageBubble.tsx — no changes to any other file",
    "Do not alter any styles, layouts, colors, or typography",
    "Do not add, remove, or modify any features outside of the message action button → context menu replacement"
  ],
  "nonGoals": [
    "Changing any backend logic",
    "Modifying MessageInput.tsx or any other component",
    "Altering chatroom, lobby, or header/footer components",
    "Adding new message actions beyond Reply, React, and Share"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}