{
  "kind": "build_request",
  "title": "Replace message action buttons with a context menu",
  "projectName": "Chattr",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In MessageBubble.tsx, replace the inline message action buttons (Reply, React, Share) with a context menu that appears on right-click (desktop) and long-press (mobile). The context menu must contain the same actions currently available as buttons. Do not change any existing styles, colors, typography, layout, or any other visual properties anywhere in the codebase.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last",
          "msg-user-second-last"
        ],
        "quotes": [
          "Let's make the message buttons a context menu instead.",
          "Yes but don't change anything else. Don't change any styles"
        ]
      },
      "acceptanceCriteria": [
        "Inline message action buttons (Reply, React, Share) are no longer visible by default on each message bubble.",
        "Right-clicking a message bubble on desktop opens a context menu with the same actions (Reply, React, Share).",
        "Long-pressing a message bubble on mobile opens the same context menu.",
        "Selecting an action from the context menu triggers the same behavior as the original buttons.",
        "Clicking or tapping outside the context menu dismisses it.",
        "The context menu is positioned near the cursor/tap point and stays within the viewport.",
        "No existing styles, colors, typography, layout, spacing, or visual properties are changed anywhere in the app."
      ]
    }
  ],
  "constraints": [
    "Do not change any CSS classes, Tailwind utilities, color tokens, typography, spacing, or any other visual styles anywhere in the codebase.",
    "Do not modify any files other than MessageBubble.tsx (and any helper/utility files strictly required for the context menu logic).",
    "Do not alter backend logic or any other frontend components."
  ],
  "nonGoals": [
    "Redesigning or restyling any part of the UI.",
    "Adding new actions to the context menu beyond what currently exists as buttons.",
    "Changing message layout, bubble appearance, or any other component.",
    "Modifying backend logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}