{
  "kind": "build_request",
  "title": "Mirror current user message header layout to match other users' messages",
  "projectName": "Chattr",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "For messages sent by the current user, reorder the header elements left-to-right as: Message ID → Timestamp → Username → Avatar. This must mirror the exact same left-to-right order used for other users' messages. No styles, colors, spacing, font sizes, or any other visual properties may be changed — only the structural DOM order/positioning of these four elements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-9",
          "msg-recent-11",
          "msg-recent-13"
        ],
        "quotes": [
          "the username should be to the left of the avatar, the timestamp to the left of that, then the message id to the left of that",
          "Don't change any styles in the process keep the overall layout identical just for the change I mentioned",
          "Message ID → Timestamp → Username → Avatar (left to right)"
        ]
      },
      "acceptanceCriteria": [
        "Current user message headers display elements in this left-to-right order: Message ID, Timestamp, Username, Avatar.",
        "Other users' message header layout remains completely unchanged.",
        "No CSS classes, inline styles, colors, font sizes, spacing, or visual properties are modified anywhere in the component.",
        "The avatar remains on the far right for current user messages.",
        "The message ID appears on the far left for current user messages."
      ]
    }
  ],
  "constraints": [
    "Do not change any CSS classes, Tailwind utility classes, colors, spacing, font sizes, or any other style properties.",
    "Only reorder the structural DOM elements for current user message headers.",
    "Other users' message layout must remain completely untouched."
  ],
  "nonGoals": [
    "Restyling or redesigning any part of the message bubble.",
    "Changing layouts for anything other than current user message headers.",
    "Modifying the backend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}