{
  "kind": "build_request",
  "title": "Update action button colors and remove redundant character counter",
  "projectName": "Chattr",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In MessageBubble.tsx, update the font and icon color for the Reply, React, Share, and Report action buttons to match the same gray color used by the message timestamp.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Change the font and icon color for the reply react share and report buttons to the same gray as the timestamp"
        ]
      },
      "acceptanceCriteria": [
        "The Reply, React, Share, and Report button labels and icons render in the same gray color as the message timestamp text.",
        "No other button styles or colors are affected."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In MessageInput.tsx, remove the redundant text-based line character counter displayed below the chat text input field. The circular character counter rendered inside the input field must remain visible and functional.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "remove the redundant line character counter from underneath the chat text input and keep the circular character counter inside the chat input"
        ]
      },
      "acceptanceCriteria": [
        "No character count text or line counter appears below the chat input field.",
        "The circular character counter inside the chat input remains present and updates correctly as the user types.",
        "The input area layout is clean with no empty space left by the removed counter."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed in frontend.immutablePaths.",
    "Do not alter the circular character counter inside the chat input field.",
    "Only change the color of the Reply, React, Share, and Report buttons — do not change their size, shape, or layout."
  ],
  "nonGoals": [
    "Redesigning or repositioning any message action buttons.",
    "Changing the timestamp color or style.",
    "Modifying any backend logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}