{
  "kind": "build_request",
  "title": "Disable mobile default long-press behavior in context menu",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In MessageBubble.tsx, when attaching the long-press handler to trigger the context menu, call preventDefault() on the touchstart and contextmenu events to suppress the browser's native mobile long-press popup (text selection, OS context menu, image save dialog). Use touch-action: none and -webkit-touch-callout: none CSS properties on the message bubble element, and add onContextMenu={(e) => e.preventDefault()} alongside the touch event handlers to ensure all native long-press actions are blocked across iOS and Android.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remember to disable the mobile default long press"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, long-pressing a message bubble does not trigger the browser's native context menu or text selection popup.",
        "On iOS, the native image/link save dialog does not appear on long press.",
        "On Android, the browser's native context menu does not appear on long press.",
        "The custom context menu still appears correctly on long press.",
        "The touchstart and contextmenu events have preventDefault() called.",
        "The message bubble element has -webkit-touch-callout: none and touch-action: none applied."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Do not break the existing long-press context menu functionality."
  ],
  "nonGoals": [
    "Changing the context menu items or layout.",
    "Any backend changes.",
    "Modifying long-press behavior on desktop/mouse devices."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}