{
  "kind": "build_request",
  "title": "Message bubble avatar position, username size, timestamp placement, and mobile long-press fixes",
  "projectName": "Chattr",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In MessageBubble.tsx, align the avatar to the top of the message bubble (use items-start or align-self: flex-start) instead of the current bottom alignment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-14"
        ],
        "quotes": [
          "Move the avatar to the top of the message bubble (aligned to the top)"
        ]
      },
      "acceptanceCriteria": [
        "The avatar image is vertically aligned to the top of the message bubble container, not the bottom.",
        "Alignment is consistent for both sent and received messages."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In MessageBubble.tsx, slightly increase the font size of the avatar username label (e.g., from text-xs to text-sm, or apply a modest size bump). Do NOT change the font size of the timestamp.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11",
          "msg-12",
          "msg-13"
        ],
        "quotes": [
          "Slightly increase the size of the avatar username",
          "don't increase the size of the timestamp"
        ]
      },
      "acceptanceCriteria": [
        "The username displayed near the avatar is visibly slightly larger than before.",
        "The timestamp font size remains unchanged."
      ]
    },
    {
      "id": "REQ-3",
      "text": "In MessageBubble.tsx, move the timestamp so it appears inside the message bubble (e.g., at the bottom-right or bottom-left of the bubble content area) rather than outside or below it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13",
          "msg-14"
        ],
        "quotes": [
          "put the timestamp inside of the message bubble"
        ]
      },
      "acceptanceCriteria": [
        "The timestamp is rendered within the visual boundary of the message bubble.",
        "The timestamp does not overlap the message text in a way that makes it unreadable.",
        "The timestamp is no longer displayed outside the bubble container."
      ]
    },
    {
      "id": "REQ-4",
      "text": "In MessageBubble.tsx (and any wrapper elements involved in long-press detection), suppress the default mobile long-press browser behavior by applying CSS properties such as `user-select: none`, `-webkit-user-select: none`, and `-webkit-touch-callout: none` on the message bubble container, and call `event.preventDefault()` on the `onContextMenu` handler to prevent the native context menu from appearing on mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-15",
          "msg-16"
        ],
        "quotes": [
          "remove the default mobile long press so it doesn't get in the way of the content menu"
        ]
      },
      "acceptanceCriteria": [
        "Long-pressing a message on mobile does not trigger the native browser text-selection or context menu.",
        "The custom context menu still appears on long press without interference from the browser default behavior.",
        "Right-click on desktop still triggers the custom context menu without the browser's native context menu appearing."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Do not change backend logic — all changes are frontend-only.",
    "Do not alter the timestamp font size."
  ],
  "nonGoals": [
    "Redesigning the overall message bubble layout beyond the specified changes.",
    "Changing the custom context menu trigger logic or menu items.",
    "Modifying any backend data models or API calls."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}