{
  "kind": "build_request",
  "title": "Add link detection with ExternalLink icon and disclaimer modal in chat messages",
  "projectName": "Chattr",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the MessageBubble component, detect URLs in message text and render them as clickable links. Each detected link must display a Lucide `ExternalLink` icon immediately before the link text. Do not change any existing layout styles, spacing, colors, or other UI elements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "can we make it so links are detected in chats",
          "maybe add a lucide icon in front of the link too",
          "dont make any additional changes. dont change any layout styles either. keep everything exactly as is"
        ]
      },
      "acceptanceCriteria": [
        "URLs in chat message text are auto-detected and rendered as clickable anchor elements",
        "A Lucide `ExternalLink` icon appears immediately before each detected link",
        "Non-link text in messages remains visually unchanged",
        "No existing layout styles, colors, spacing, or other UI elements are altered"
      ]
    },
    {
      "id": "REQ-2",
      "text": "When a user clicks a detected link in a chat message, intercept the navigation and display a modal disclaimer with the text: 'You are about to leave Chattr. External links may be unsafe — proceed with caution.' The modal must have a Confirm button (opens the link in a new tab) and a Cancel button (closes the modal without navigating). Do not change any existing layout styles or other UI elements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "add a disclaimer when clicking the link",
          "You are about to leave Chattr... (somethin else after)",
          "dont make any additional changes. dont change any layout styles either. keep everything exactly as is"
        ]
      },
      "acceptanceCriteria": [
        "Clicking a detected link opens a disclaimer modal instead of immediately navigating",
        "Modal displays the text: 'You are about to leave Chattr. External links may be unsafe — proceed with caution.'",
        "Confirm button opens the link in a new tab and closes the modal",
        "Cancel button closes the modal without navigating",
        "No existing layout styles, colors, spacing, or other UI elements are altered"
      ]
    }
  ],
  "constraints": [
    "Do not change any existing layout styles, spacing, colors, typography, or visual design",
    "Do not modify any backend files",
    "Do not alter any components other than MessageBubble (and a new disclaimer modal component if needed)",
    "Immutable frontend paths must not be edited"
  ],
  "nonGoals": [
    "Adding any new features beyond link detection, the ExternalLink icon, and the disclaimer modal",
    "Changing the app's visual theme or design system",
    "Backend changes of any kind"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}