{
  "kind": "build_request",
  "title": "Add labels to action buttons and remove character count text from message input",
  "projectName": "Chattr",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add visible text labels to the four message action buttons in MessageBubble.tsx: 'Reply', 'React', 'Share', and 'Flag'. Each label should appear alongside its existing icon.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "add labels to the action buttons. Reply, React, Share, Flag"
        ]
      },
      "acceptanceCriteria": [
        "The Reply action button displays the text label 'Reply'",
        "The React action button displays the text label 'React'",
        "The Share action button displays the text label 'Share'",
        "The Flag action button displays the text label 'Flag'",
        "Each label is visible alongside the button's icon",
        "No other changes are made to the buttons (size, color, behavior, layout remain the same)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the character count text display from the character counter in the message input area in MessageInput.tsx. The counter element itself (e.g., progress ring or indicator) may remain, but the numeric character count text must not be shown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "remove the character count text from the character counter in the message input area"
        ]
      },
      "acceptanceCriteria": [
        "No numeric character count text is rendered in the message input area",
        "Any non-text counter indicator (e.g., ring, bar) may remain if present",
        "No other changes are made to the message input component"
      ]
    }
  ],
  "constraints": [
    "Do not make any changes other than those specified in REQ-1 and REQ-2",
    "Do not modify any backend files",
    "Do not alter button behavior, sizing, colors, or layout beyond adding the text labels"
  ],
  "nonGoals": [
    "Redesigning or restyling the action buttons beyond adding labels",
    "Changing the character counter behavior or limits",
    "Modifying any other components not mentioned in this request"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}