{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace message action buttons with a context menu",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace inline message action buttons (Reply, React, Share) in MessageBubble.tsx with a context menu triggered by right-click (desktop) and long-press (mobile), preserving all existing styles and behavior.",
      "acceptanceCriteria": [
        "Inline message action buttons (Reply, React, Share) are no longer visible by default on each message bubble.",
        "Right-clicking a message bubble on desktop opens a context menu with the same actions (Reply, React, Share).",
        "Long-pressing a message bubble on mobile opens the same context menu.",
        "Selecting an action from the context menu triggers the same behavior as the original buttons.",
        "Clicking or tapping outside the context menu dismisses it.",
        "The context menu is positioned near the cursor/tap point and stays within the viewport.",
        "No existing styles, colors, typography, layout, spacing, or visual properties are changed anywhere in the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Replace the inline action buttons (Reply, React, Share) with a context menu implementation. Add onContextMenu handler for right-click on desktop and onTouchStart/onTouchEnd handlers for long-press detection on mobile (e.g., 500ms threshold). Create a context menu component or inline element that renders the same three actions when triggered. Position the menu near the cursor/tap point using fixed positioning with viewport boundary checks. Add click-outside and escape-key handlers to dismiss the menu. Ensure all existing onClick handlers for Reply, React, and Share are preserved and called from the context menu items. Do not modify any existing className attributes, Tailwind utilities, inline styles, or any other visual properties. Do not change any other logic, props, or component structure."
        }
      ]
    }
  ]
}