{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Message bubble avatar position, username size, timestamp placement, and mobile long-press fixes",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Align message bubble avatar to the top instead of bottom",
      "acceptanceCriteria": [
        "The avatar image is vertically aligned to the top of the message bubble container, not the bottom.",
        "Alignment is consistent for both sent and received messages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Change the avatar container flex alignment from items-end to items-start (or apply align-self: flex-start to the avatar wrapper) so the avatar aligns to the top of the message bubble. Ensure this change applies to both sent and received message layouts."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Increase avatar username label font size without changing timestamp size",
      "acceptanceCriteria": [
        "The username displayed near the avatar is visibly slightly larger than before.",
        "The timestamp font size remains unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Locate the username text element (the sender name near the avatar) and increase its font size from text-xs to text-sm or apply a similar modest size increase. Do not modify the timestamp's font size class or styles."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Move timestamp inside the message bubble",
      "acceptanceCriteria": [
        "The timestamp is rendered within the visual boundary of the message bubble.",
        "The timestamp does not overlap the message text in a way that makes it unreadable.",
        "The timestamp is no longer displayed outside the bubble container."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Relocate the timestamp element so it renders inside the message bubble container (e.g., at the bottom-right or bottom-left corner of the bubble content area) rather than outside or below the bubble. Adjust positioning and padding to ensure the timestamp is visible and does not obstruct the message text."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Suppress default mobile long-press behavior to prevent interference with custom context menu",
      "acceptanceCriteria": [
        "Long-pressing a message on mobile does not trigger the native browser text-selection or context menu.",
        "The custom context menu still appears on long press without interference from the browser default behavior.",
        "Right-click on desktop still triggers the custom context menu without the browser's native context menu appearing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Apply CSS properties to the message bubble container (user-select: none, -webkit-user-select: none, -webkit-touch-callout: none) to prevent native text selection on long press. Add an onContextMenu event handler to the message bubble container that calls event.preventDefault() to suppress the native browser context menu on both mobile long press and desktop right-click, ensuring the custom context menu appears without interference."
        }
      ]
    }
  ]
}