{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update action button colors and remove redundant character counter",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update action button colors in MessageBubble to match timestamp gray",
      "acceptanceCriteria": [
        "The Reply, React, Share, and Report button labels and icons render in the same gray color as the message timestamp text.",
        "No other button styles or colors are affected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Update the color classes for the Reply, React, Share, and Report action buttons (both icon and text) to use the same gray color token currently applied to the message timestamp. Locate the timestamp element to identify its exact color class (likely text-muted-foreground or similar), then apply that same class to the four action buttons. Ensure only the color changes—preserve all other styles including size, layout, hover states, and spacing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove redundant text-based character counter below chat input",
      "acceptanceCriteria": [
        "No character count text or line counter appears below the chat input field.",
        "The circular character counter inside the chat input remains present and updates correctly as the user types.",
        "The input area layout is clean with no empty space left by the removed counter."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageInput.tsx",
          "operation": "modify",
          "description": "Remove the text-based character counter line that appears below the chat text input field. Do not modify or remove the circular character counter rendered inside the input field. After removal, verify that no empty space or layout gaps remain in the input area."
        }
      ]
    }
  ]
}