{
  "backend/main.mo": "Motoko canister implementing chatrooms, messages, reactions, user profiles, and access control with storage mixins and ordered maps.",
  "feature_evidence.json": "Feature evidence report listing two Giphy‑related frontend fixes tied to AvatarPickerDialog with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing routing, UI components, hooks, and chat features.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React root app configuring TanStack Router routes, layout, 404 handling, and theme provider.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker dialog with image upload, Giphy search using debounced input, request‑ID tracking, and avatar update actions.",
  "frontend/src/components/ChatArea.tsx": "Main chat area handling message fetching, auto‑scroll, replies, pinned video, and expandable header UI.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom preview card with dynamic media thumbnails for YouTube, Twitch, and Twitter, including live-status and preview fetching.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a modal dialog for creating chatrooms with topic, description, category, and optional media via uploads, video URLs, or Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with attribution and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation, username editing, avatar selection, and back-to-lobby behavior.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that intentionally renders nothing.",
  "frontend/src/components/MessageBubble.tsx": "Displays individual chat messages with reactions, media embeds, timestamps, replies, and pin/unpin actions.",
  "frontend/src/components/MessageInput.tsx": "Handles composing and sending messages with optional image upload, video URLs, Twitter links, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video for a chatroom with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component with waveform visualization, play/pause controls, progress tracking, and synchronized playback behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for handling Internet Identity authentication, login flow, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for chatrooms, search, filtering, and message-related operations using the backend actor.",
  "frontend/src/index.css": "Tailwind base/theme definitions including CSS variables for light/dark modes and global layout rules.",
  "frontend/src/lib/config.ts": "Defines frontend constants for Giphy API key and result limits.",
  "frontend/src/lib/formatters.ts": "Utility to format numbers into compact notation like k, M, or B.",
  "frontend/src/lib/giphy.ts": "Wrapper for Giphy search API returning parsed GIF metadata and error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder module for html2canvas loading.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder module for rendering Twitter embeds.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and caches Twitter oEmbed data, extracting safe preview fields like author, text, and images.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements localStorage caching for Twitter oEmbed previews with validation, versioning, and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for Twitter thumbnail logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for caching Twitter thumbnails.",
  "frontend/src/lib/videoUtils.ts": "Provides utilities for extracting video IDs and generating thumbnail or embed URLs for YouTube, Twitch, and Twitter/X.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity context providers.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, handles loading/error states, increments view count, and renders ChatArea.",
  "frontend/src/pages/LobbyPage.tsx": "Displays chatroom listings with search and category filters and supports creating new chatrooms.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, containers, animations, and enabling plugins.",
  "project_state.json": "Project metadata tracking issues, features, and state related to fixing Giphy search behavior."
}