{
  "backend/main.mo": "Main Motoko actor implementing a chat application backend with chatrooms, messages, user profiles, reactions, image storage via blob-storage, HTTP outcalls, and access control with role-based permissions.",
  "feature_evidence.json": "Feature evidence report documenting that image upload and GIF picker are displayed inline in the message input area, with high confidence based on MessageInput.tsx implementation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, query hooks, UI components (Header, ChatArea, MessageBubble, MessageInput), pages, and styling configurations.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration for mobile support, and versioned script tag (v=203) to force production refresh.",
  "frontend/src/App.tsx": "Root application component using TanStack Router with routes for lobby, chatroom, and admin pages, conditionally rendering Header/Footer based on route, with theme provider and toast notifications.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component for selecting user avatars via file upload or Giphy search, with debounced search, trending GIFs fallback, and avatar removal functionality.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface with collapsible header, pinned video area, scrollable message list filtering out Creator messages without media, reply functionality, and auto-scroll on new messages.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, message count, and category badges. Fetches platform-specific thumbnails and Twitter oEmbed previews on mount.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog component for creating new chatrooms with topic, description, category selection, and media options (image upload, YouTube/Twitch video URLs, or Twitter post embeds). Validates video URLs, handles image uploads with progress tracking, and renders Twitter post previews.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with logo, username editing functionality, avatar picker button, and back-to-lobby navigation for chatroom views. Includes character limit progress indicator for username editing.",
  "frontend/src/components/LoginPrompt.tsx": "Intentional no-op placeholder component that renders nothing, documenting that the app is designed to work anonymously without authentication.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with avatar, timestamp, reactions, and media embeds (YouTube, Twitch, Twitter, images, voice messages). Supports pinning, replying, emoji reactions, and highlighting with scroll-to functionality.",
  "frontend/src/components/MessageInput.tsx": "Chat message input component with text entry, voice recording, image upload, GIF picker (Giphy integration), and link preview detection. Handles message length limits, upload progress, and media attachment management.",
  "frontend/src/components/MessageInputLinkPreview.tsx": "Displays preview cards for YouTube, Twitch, and Twitter links detected in message input, fetching Twitter oEmbed data and showing thumbnails/metadata for each platform.",
  "frontend/src/components/PinnedVideo.tsx": "Renders a pinned video player (YouTube or Twitch) with an unpin button, displaying the video in an iframe with appropriate embed URLs.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component for voice messages with play/pause controls, waveform visualization, progress slider, and automatic playback synchronization across multiple players.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that debounces a value by delaying updates until a specified delay period has passed without changes.",
  "frontend/src/hooks/useDetectLinksInText.ts": "Hook that extracts and identifies the first YouTube, Twitch, or Twitter URL from text input using regex pattern matching.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Ensures chatroom list loads fresh on first page load by purging legacy cache entries, detecting persisted empty arrays, and forcing a refetch when the actor becomes ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chatroom and message operations, including fetching chatrooms, messages, user profiles, and mutations for sending messages, reactions, and replies. Also includes image upload helper with compression and localStorage-based blob storage.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration, CSS custom properties for light/dark themes, mobile-specific input styles to prevent zoom, and custom styling for voice message range inputs.",
  "frontend/src/lib/config.ts": "Configuration constants for Giphy API key and result limit.",
  "frontend/src/lib/formatters.ts": "Utility function to format numbers with compact notation (k, M, B) for display.",
  "frontend/src/lib/giphy.ts": "Giphy API integration for searching and fetching trending GIFs, returning structured GIF data with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for html2canvas dynamic loading.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and compresses images while preserving orientation, with progress callbacks and fallback to original if compression fails or increases size.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON data and extracts safe preview fields (author, text, image) with caching and request deduplication to avoid CORS issues.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "localStorage-based cache for Twitter oEmbed preview data with validation, expiration (7 days), and cache management utilities.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching logic.",
  "frontend/src/lib/urlExtractor.ts": "Extracts the first supported URL (YouTube, Twitch, or Twitter) from text strings and returns the URL with its type.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs from YouTube, Twitch, and Twitter/X URLs, and generating thumbnail and embed URLs for these platforms.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page with password authentication for viewing and deleting chatrooms, with filtering by category and a table view of all chatrooms.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a single chatroom using ChatArea component, handles loading states, increments view count on mount, and provides navigation back to lobby.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying all chatrooms with client-side search and category filtering, create chatroom dialog, and navigation to individual chatrooms.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar colors, animations, and typography/container plugins.",
  "project_state.json": "Project metadata tracking anonymous chat application state with pending feature requests to remove Internet Identity authentication and caller verification from backend."
}