{
  "backend/main.mo": "Actor implementing chatrooms, messages, user profiles, reactions, and access control with storage, plus data types and ID counters.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their functionality and recent updates.",
  "frontend/index.html": "Base HTML file mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "App entry with TanStack Router defining lobby and chatroom routes, shared layout, and 404 handling.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog allowing users to upload, preview, or remove custom avatars with validation and mutations.",
  "frontend/src/components/ChatArea.tsx": "Chat UI showing messages, pinned video, live user count, replies, auto-scroll, and message sending logic.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media thumbnails from YouTube, Twitch, or Twitter and fetches thumbnails dynamically.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with topic, description, category, and media upload or video/Twitter URL input.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with navigation, username editing, and avatar selection.",
  "frontend/src/components/LoginPrompt.tsx": "No-op component intentionally rendering nothing to avoid authentication flows.",
  "frontend/src/components/MessageBubble.tsx": "Renders chat messages with reactions, timestamps, media previews, Twitter embeds, and reply/pin actions.",
  "frontend/src/components/MessageInput.tsx": "Provides a message composer supporting text, images, YouTube/Twitch links, Twitter URLs, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin it from the chatroom.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implementation.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that plays audio messages with waveform visualization, playback controls, and synchronized pausing of other audio elements.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating chat-related data, including chatrooms, search, filtering, and user metadata helpers.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining theme variables, dark mode styles, layout resets, and mobile input adjustments.",
  "frontend/src/lib/formatters.ts": "Contains a number formatter that converts large numbers into compact notation like k, M, and B.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for parsing YouTube, Twitch, and Twitter URLs and generating corresponding IDs, thumbnails, and embed links.",
  "frontend/src/main.tsx": "Application entry that sets up React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/ChatroomPage.tsx": "Fetches a chatroom, increments view count once, handles loading/error states, and renders ChatArea when data is ready.",
  "frontend/src/pages/LobbyPage.tsx": "Displays and filters chatrooms with search and category options, handles loading/error states, and allows navigation and room creation.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and loads typography, container-query, and animate plugins.",
  "project_state.json": "Defines project state, requirements, and constraints for replacing view counts with live user counts while maintaining full anonymity."
}