{
  "backend/main.mo": "Motoko backend defining chatrooms, messages, reactions, user profiles, access control, and blob storage with CRUD operations and state maps.",
  "feature_evidence.json": "Feature evidence report linking a UI layout change to the ChatArea component with related components and test IDs.",
  "frontend-file-summaries.txt": "Collected summaries of all frontend files describing components, hooks, UI behavior, and layout logic.",
  "frontend/index.html": "Root HTML page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router, global layout, 404 handling, and conditional footer rendering.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting, uploading, removing, and searching Giphy avatars with debounced search and async state handling.",
  "frontend/src/components/ChatArea.tsx": "Chat area component with collapsible header, message list, auto‑scroll, reply handling, pinned video, and send message logic.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom card with media thumbnail handling for YouTube, Twitch, and Twitter, including fetching previews and live status info.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with topic, description, category, and media input including uploads, video URLs, and Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with a copyright note and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with navigation, username editing, and avatar selection, adjusting layout when inside a chatroom.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component to ensure the app stays anonymous without authentication.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with reactions, media previews, Twitter embeds, and pin/reply functionality.",
  "frontend/src/components/MessageInput.tsx": "Handles composing messages with optional media uploads, video/Twitter links, and voice recording support.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video in a chatroom with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that loads, plays, and visualizes audio messages with waveform, progress, and play/pause controls.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook that returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Dfinity Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating chatrooms, messages, user data, and reactions via the backend actor.",
  "frontend/src/index.css": "Tailwind setup with CSS variables for themes, dark mode, and mobile input adjustments.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Provides compact number formatting utility (k, M, B).",
  "frontend/src/lib/giphy.ts": "Utilities to search and fetch trending GIFs from Giphy’s API and map results into a unified format.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder module for html2canvas loading logic.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder module for rendering Twitter embeds.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data with caching and deduped in‑flight requests to build lightweight tweet previews.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Provides localStorage-based caching for Twitter oEmbed previews with versioning and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file placeholder for future Twitter thumbnail logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file placeholder for future Twitter thumbnail caching logic.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting IDs and building thumbnails for YouTube, Twitch, and Twitter URLs.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider, then renders the root component.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom, increments view count, handles loading/error states, and renders the chat area.",
  "frontend/src/pages/LobbyPage.tsx": "Displays chatroom list with search, category filtering, and creation dialog, handling loading and backend connection states.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and plugins.",
  "project_state.json": "Tracks project metadata, known issues, and feature requirements for centering collapsed chatroom header content on desktop."
}