{
  "backend/main.mo": "Motoko actor defining chatrooms, messages, reactions, user profiles, and access control with storage mixins and admin-protected chatroom deletion.",
  "feature_evidence.json": "Feature evidence report listing image‑compression and upload‑pipeline refactor requirements with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including routing, UI components, hooks, and styles.",
  "frontend/index.html": "Base HTML document mounting the React app and loading the main TypeScript entry file.",
  "frontend/src/App.tsx": "Main React app defining TanStack Router routes, layouts, 404 handling, and theme/provider setup.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting, uploading, compressing, or removing user avatars, including Giphy search and update logic.",
  "frontend/src/components/ChatArea.tsx": "Chat UI handling message fetching, auto‑scrolling, replies, pinned video display, and message sending with media support.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnails for YouTube, Twitch, and Twitter media, fetching previews and handling thumbnail fallbacks.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Modal for creating chatrooms with fields for topic, description, category, and media uploads or video/Twitter URLs.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header showing branding, back navigation, and username/avatar editing UI.",
  "frontend/src/components/LoginPrompt.tsx": "No‑op component intentionally rendering nothing to preserve anonymous usage.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with timestamps, reactions, media embeds, replies, and pinning controls.",
  "frontend/src/components/MessageInput.tsx": "Message composer supporting text, image upload, YouTube/Twitch/Twitter links, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implemented UI.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with play/pause, waveform visualization, time tracking, and synced playback control.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a value that updates only after a delay for debouncing input or state changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for chatrooms, messages, and user data with localStorage helpers and transient result guards.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables plus custom styles for layout, dark mode, and voice message sliders.",
  "frontend/src/lib/config.ts": "Defines Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Utility to format numbers using compact notation like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Functions for searching and fetching trending GIFs from Giphy using the API key.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder file for html2canvas loading logic.",
  "frontend/src/lib/imageCompression.ts": "Provides client-side image compression with resizing, quality control, and progress reporting, falling back to the original file if compression fails or is larger.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file for future Twitter embed rendering utilities.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and reconstructs lightweight Twitter oEmbed previews with caching, deduped requests, and basic HTML text/image extraction.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements localStorage-based caching for Twitter oEmbed previews with validation, versioning, and expiration handling.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for future Twitter thumbnail utilities.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for future Twitter thumbnail caching utilities.",
  "frontend/src/lib/videoUtils.ts": "Provides URL parsers and thumbnail generators for YouTube, Twitch, and Twitter, including ID extraction and embed URL helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider before rendering the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page with password-gated access allowing chatroom listing and deletion using backend query hooks.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, increments view count, handles loading/error states, and displays the chat interface.",
  "frontend/src/pages/LobbyPage.tsx": "Implements the lobby UI with chatroom list fetching, search, category filtering, and navigation to chatrooms using multiple query hooks.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Describes the project state and feature requests, mainly focused on implementing shared client‑side image compression for all upload paths."
}