{
  "backend/main.mo": "Motoko backend actor managing chatrooms, messages, reactions, user profiles, and access control with admin-gated operations and in-memory ordered maps.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend source files.",
  "frontend/index.html": "Base HTML file bootstrapping the frontend app and loading the main React entrypoint.",
  "frontend/src/App.tsx": "App-level router and layout setup with lobby, chatroom, and admin routes plus error boundaries and theming.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting, uploading, searching, and removing user avatars with Giphy integration and debounced search.",
  "frontend/src/components/ChatArea.tsx": "Main chat UI handling message display, sending, replies, auto-scroll, pinned video, and collapsible header behavior.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media thumbnails, live status, and fetched previews for YouTube, Twitch, and Twitter content.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Modal dialog for creating chatrooms with topic, media upload, YouTube/Twitch URL validation, and Twitter embed preview.",
  "frontend/src/components/Footer.tsx": "Simple footer showing attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header bar with navigation, username editing, and avatar selection.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component rendering nothing as authentication is not used.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with reactions, media embeds, replies, pins, and Twitter widgets.",
  "frontend/src/components/MessageInput.tsx": "Input box for sending messages with optional image upload, YouTube/Twitch/Twitter URLs, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with waveform visualization, playback controls, and synchronized state resets tied to audioUrl changes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a delay using a timeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for chatrooms, messages, and reactions, with actor integration and transient-result guards.",
  "frontend/src/index.css": "Tailwind setup with theme variables, dark mode, mobile input fixes, and custom voice message slider styles.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Formats numbers into compact notation like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Functions for searching and fetching trending GIFs from Giphy with error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder file.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data with caching, deduped requests, and lightweight HTML extraction for text and images.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements localStorage caching for Twitter previews with versioning, validation, expiration, and key generation.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for Twitter thumbnail logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for Twitter thumbnail caching.",
  "frontend/src/lib/videoUtils.ts": "Provides utilities for extracting IDs from YouTube, Twitch, and Twitter URLs and generating associated thumbnail or embed URLs.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, rendering the root App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page requiring a password to list and delete chatrooms, using session-based auth and query hooks.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, increments view count, handles errors, and renders ChatArea once data is ready.",
  "frontend/src/pages/LobbyPage.tsx": "Displays chatroom listings with search, category filters, creation dialog, and navigation to chatrooms.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, OKLCH-based color system, animations, and plugin setup.",
  "project_state.json": "Project state describing a chatroom app and a bug where chatroom lists vanish after creation due to transient empty fetch responses."
}