{
  "backend/main.mo": "Motoko canister defining chatrooms, messages, reactions, user profiles, access control, and deletion logic with admin password gating.",
  "feature_evidence.json": "Feature evidence report linking admin delete‑chatrooms gating to specific frontend files and components.",
  "frontend-file-summaries.txt": "Collection of prewritten short summaries of all frontend files for reference.",
  "frontend/index.html": "HTML entry point with cache‑busting meta tags and script versioning.",
  "frontend/src/App.tsx": "App router defining lobby, chatroom, and admin delete‑chatrooms routes with conditional header/footer layout.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker dialog supporting uploads, removal, and Giphy search with debounced fetching and request cancellation.",
  "frontend/src/components/ChatArea.tsx": "Main chat area handling message loading, auto‑scroll, replies, pinned video, and sending messages with media.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media previews, timestamps, and fetched thumbnails for YouTube, Twitch, and Twitter.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with topic, description, media upload, video URLs, and Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with navigation, username editing, and avatar selection.",
  "frontend/src/components/LoginPrompt.tsx": "Placeholder component that renders nothing and disables authentication flows.",
  "frontend/src/components/MessageBubble.tsx": "Renders chat messages with reactions, timestamps, media embeds, and reply/pin interactions.",
  "frontend/src/components/MessageInput.tsx": "Handles composing messages with media attachments, video URLs, Twitter links, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder component.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component for playing audio messages with waveform visualization, time tracking, and synchronized playback controls.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook that returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that forces a fresh chatroom list refetch by purging stale cache entries once the backend actor becomes ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, state tracking, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating chatrooms, messages, and user-related data through the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, theme modes, layout rules, and custom UI element styling including voice player ranges.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Provides a helper to format numbers using compact notation (k, M, B).",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy and map API responses into a simplified GIF model.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder file.",
  "frontend/src/lib/imageCompression.ts": "Implements client-side image compression with resizing, quality control, and progress reporting.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data into a safe preview object with caching and deduped requests.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching of Twitter preview objects with validation and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file.",
  "frontend/src/lib/videoUtils.ts": "Extracts IDs and generates thumbnails for YouTube, Twitch, and Twitter URLs with various helper checks.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin interface for authenticating and managing chatrooms, including deletion and refetching logic.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, increments its view count once, handles loading and error states, and renders the ChatArea when data is available.",
  "frontend/src/pages/LobbyPage.tsx": "Displays the lobby with chatroom search, category filters, and creation dialog, fetching chatrooms and applying client-side filtering.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Stores project state, feature requests, issues, and architectural notes related to backend authorization changes and media URL handling."
}