{
  "backend/main.mo": "Motoko backend actor managing chatrooms, messages, users, reactions, and access control with admin‑gated operations and storage mixins.",
  "feature_evidence.json": "Feature evidence report describing required UI and data‑flow changes for admin reset functionality and associated components.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including pages, components, hooks, and styling configuration.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, global layout, and admin‑hidden header/footer behavior.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting, uploading, searching, or removing user avatars with Giphy integration and upload validation.",
  "frontend/src/components/ChatArea.tsx": "Main chat UI handling message display, auto‑scroll, replies, header collapse, and sending messages with media support.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media thumbnails, live status, and optional Twitter/Twitch previews.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog to create chatrooms with topic, description, category, and media upload or URL support including Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with navigation, avatar picker, and editable username.",
  "frontend/src/components/LoginPrompt.tsx": "No-op component returning nothing to avoid authentication flows.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with reactions, media embeds, pinning, replies, and optional Twitter rendering.",
  "frontend/src/components/MessageInput.tsx": "Input box for sending messages with image upload, YouTube/Twitch/Twitter media support, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video with an option to unpin.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implemented component.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component for playing voice messages with waveform visualization, time tracking, and synchronized playback control.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on the current Internet Identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook that returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for chatrooms, messages, users, and reactions, including local user metadata utilities.",
  "frontend/src/index.css": "Global Tailwind CSS setup with theming variables, dark mode, layout rules, and custom styles such as voice message range inputs.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants for Giphy API key and result limits.",
  "frontend/src/lib/formatters.ts": "Utility to format large numbers into compact notation such as k, M, or B.",
  "frontend/src/lib/giphy.ts": "Helpers for searching and fetching trending GIFs from the Giphy API with error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file placeholder for html2canvas loader functionality.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression that resizes images, maintains quality, and returns a smaller File when beneficial.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file for future Twitter embed rendering logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed JSON to produce a safe preview with text, author info, and optional image, including caching and deduping.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Provides localStorage-based caching for Twitter oEmbed previews with validation, expiration, and versioning.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for future Twitter thumbnail utilities.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for future Twitter thumbnail caching logic.",
  "frontend/src/lib/videoUtils.ts": "Utility functions to extract IDs from YouTube, Twitch, and Twitter URLs and generate corresponding thumbnails or embed URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page providing password-protected access to list, delete, and reset chatrooms.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, increments view count, handles loading and error states, and renders the chat interface.",
  "frontend/src/pages/LobbyPage.tsx": "Renders the chat lobby with search, category filters, loading/error states, and chatroom list navigation.",
  "frontend/src/types/message.ts": "Defines a frontend message type converting reaction data into a simplified structure.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, animations, and plugins.",
  "project_state.json": "Describes project state and feature requests focused on implementing a full data reset action with frontend admin gating."
}