{
  "backend/main.mo": "Motoko canister implementing chatrooms, messages, reactions, user profiles, active users, and access control with admin-only deletion of all chatrooms.",
  "feature_evidence.json": "Feature evidence listing two frontend requirements tied to adding a delete-all-chatrooms admin button and corresponding React Query mutation.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all major frontend components, hooks, pages, and styles.",
  "frontend/index.html": "Basic HTML entry point containing root div and script loader for the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout with conditional header/footer, theme provider, and 404 handling.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting, uploading, or removing user avatars with Giphy search and image upload support.",
  "frontend/src/components/ChatArea.tsx": "Main chat area handling message display, auto-scroll, sending messages, replies, pinned video, and expandable header.",
  "frontend/src/components/ChatroomCard.tsx": "No summary available.",
  "frontend/src/components/CreateChatroomDialog.tsx": "No summary available.",
  "frontend/src/components/Footer.tsx": "No summary available.",
  "frontend/src/components/Header.tsx": "No summary available.",
  "frontend/src/components/LoginPrompt.tsx": "No summary available.",
  "frontend/src/components/MessageBubble.tsx": "No summary available.",
  "frontend/src/components/MessageInput.tsx": "No summary available.",
  "frontend/src/components/PinnedVideo.tsx": "No summary available.",
  "frontend/src/components/ProfileSetupModal.tsx": "No summary available.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with waveform visualization, playback controls, and syncing between multiple audio elements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value with a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider handling login, stored identity restoration, and auth-client initialization.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for chatrooms, messages, reactions, and user metadata with actor integration and local storage helpers.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables, dark mode styles, mobile input tweaks, and custom styles for the voice message player.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Provides compact number formatting for values in the thousands, millions, or billions.",
  "frontend/src/lib/giphy.ts": "Wrapper for Giphy API search and trending endpoints, returning normalized GIF data and handling errors.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder module.",
  "frontend/src/lib/imageCompression.ts": "Provides client-side image compression with resizing, quality control, and progress callbacks, returning the compressed file only if smaller.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file for future Twitter embed rendering logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data into a safe preview object with caching and request deduplication.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements localStorage-based caching for Twitter oEmbed previews with validation and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for generating or handling Twitter thumbnail URLs.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for caching Twitter thumbnails.",
  "frontend/src/lib/videoUtils.ts": "Extracts IDs from YouTube, Twitch, and Twitter URLs and generates related thumbnail and embed URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page that authenticates via a hardcoded password and provides UI to delete chatrooms.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom, increments view count, handles loading/error states, and renders the chat interface.",
  "frontend/src/pages/LobbyPage.tsx": "Implements the chatroom lobby with search, category filters, loading states, and navigation to individual chatrooms.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend build.",
  "project_state.json": "Stores project metadata, existing features, pending feature requests, and guidance for planned delete-all-chatrooms functionality."
}