{
  "backend/main.mo": "Motoko backend actor defining chatrooms, messages, users, reactions, access control, and a resetData admin function with extensive state maps and type definitions.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend features, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all major frontend files.",
  "frontend/index.html": "Base HTML file bootstrapping the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining lobby, chatroom, and admin routes with conditional header and footer rendering.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker dialog supporting uploads, Giphy search, GIF selection, and avatar removal with debounced search and upload handling.",
  "frontend/src/components/ChatArea.tsx": "Chat UI handling message display, auto-scroll, replies, pinned video, and message sending with header collapse logic.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media thumbnails, live status, and optional Twitter or Twitch previews, fetching thumbnails and oEmbed data when needed.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog to create a new chatroom with topic, description, category, and optional media (image upload, video URL, or Twitter post) including validation and previews.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with navigation, username editing, and avatar selection, adapting layout when inside a chatroom.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that renders nothing and maintains anonymous usage.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with timestamps, reactions, media previews, replies, and optional Twitter embeds, supporting pinning and user interactions.",
  "frontend/src/components/MessageInput.tsx": "Provides a message composer with text, image upload, video URL, Twitter URL, and optional voice recording, handling validation and uploads.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video for a chatroom with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio message player with waveform visualization, duration loading, playback sync, and slider control.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Ensures chatrooms are freshly fetched once when the actor becomes ready, removing bad cache and recovering from empty results.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for chatrooms, messages, profiles, and reactions with local helpers and retry/guard logic.",
  "frontend/src/index.css": "Tailwind base styles, theme variables, dark mode, mobile input tweaks, and voice message slider styling.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Formats numbers into compact human‑readable units like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy and map API responses to a simple GIF format with error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file with no implementation.",
  "frontend/src/lib/imageCompression.ts": "Implements client‑side image compression with resizing, quality control, progress reporting, and fallbacks for unsupported or uncompressible files.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file with no implementation.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and reconstructs lightweight Twitter oEmbed previews with caching, deduped requests, and HTML parsing for text and images.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed previews with versioning, validation, expiration, and clear helpers.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file with no implementation.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file with no implementation.",
  "frontend/src/lib/videoUtils.ts": "Extracts IDs from YouTube, Twitch, and Twitter URLs and generates thumbnail or embed URLs with helper type checks.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page requiring a password to view and delete chatrooms, using React Query for data fetching and sessionStorage for auth state.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a chatroom by ID, handling actor and chatroom loading states, view-count increment, and error fallback before rendering ChatArea.",
  "frontend/src/pages/LobbyPage.tsx": "Shows the chatroom lobby with search, category filters, loading states, and navigation, plus a create-chatroom dialog.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theming, colors, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing requirements and constraints for adding a site‑wide data reset feature with security concerns and pending requests."
}