{
  "backend/main.mo": "Motoko canister implementing chatrooms, messages, reactions, user profiles, active users, and access‑controlled admin operations with ordered-map storage.",
  "feature_evidence.json": "Feature evidence report listing implemented caching normalization and invalidation features with linked files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing routing, hooks, components, styling, and behavior.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, root layout with conditional header/footer, 404 handling, and theme provider.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker dialog supporting file uploads, Giphy search/trending GIF selection, and avatar update/removal.",
  "frontend/src/components/ChatArea.tsx": "Main chat area handling message loading, auto‑scrolling, sending, replies, pinned video, and expandable header layout.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom preview card with dynamic thumbnails for YouTube, Twitch, and Twitter and fetches related preview data.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating new chatrooms with inputs for text, categories, media uploads, and YouTube/Twitch/Twitter links.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with navigation, username editing, and avatar selection features.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component since authentication is intentionally unused.",
  "frontend/src/components/MessageBubble.tsx": "Renders chat messages with reactions, media previews, timestamps, and optional reply or pin interactions.",
  "frontend/src/components/MessageInput.tsx": "Provides the text input, media upload, and recording interface for sending messages.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video in a chatroom with an option to unpin.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component with play/pause, waveform visualization, progress tracking, and metadata loading/reset logic.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Triggers a one-time fresh chatroom fetch when the actor becomes ready, updating cache with sorted results.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login state, and persisted identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for chatrooms, messages, user metadata, and actions, with local storage helpers and edge-case guards.",
  "frontend/src/index.css": "Tailwind base styles, theme variables, mobile input fixes, and custom styling for the voice message range slider.",
  "frontend/src/lib/config.ts": "Exports Giphy API key and result limit constants.",
  "frontend/src/lib/formatters.ts": "Utility to format numbers into compact notation like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Functions for searching and fetching trending GIFs from Giphy, returning normalized results with error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file.",
  "frontend/src/lib/imageCompression.ts": "Provides client-side image compression with resizing, quality control, and progress callbacks, returning the smaller of original or compressed file.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file for future Twitter embed rendering logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to create a lightweight preview with caching and deduplicated requests.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements localStorage-based caching for Twitter preview objects with validation, versioning, and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for future Twitter thumbnail logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for future Twitter thumbnail caching.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting IDs from YouTube, Twitch, and Twitter URLs and generating corresponding thumbnail or embed URLs.",
  "frontend/src/main.tsx": "React entry point initializing QueryClient, InternetIdentityProvider, and rendering the App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page requiring a password to view and delete chatrooms, using React state, hooks, and confirmation dialogs.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, increments view count once, handles loading and error states, and renders ChatArea when ready.",
  "frontend/src/pages/LobbyPage.tsx": "React lobby page that fetches and displays chatrooms with search, category filters, debouncing, and navigation, handling loading and error states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing React Query cache normalization requirements, known issues with empty-filter cache keys, and pending feature requests."
}