{
  "backend/main.mo": "Main backend actor implementing chatroom functionality with message storage, user profiles, reactions, access control, blob storage integration, and HTTP outcalls. Includes data migration support and enforces a 154-room limit.",
  "backend/migration.mo": "Data migration module that transforms old chatroom and active user data structures to new versions with added lastActivity field for bump-based sorting.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: frontend chatroom list ordering by backend's bump-based sorting and room limit error display in CreateChatroomDialog.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App.tsx with routing, useQueries hooks with backend operations, Header with avatar/username editing, ChatArea with message display, MessageBubble with reactions, MessageInput with media support, and various dialog components.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags and versioned script import (v=203) to force fresh fetches in production.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup for lobby, chatroom, and admin routes, conditional header/footer rendering, theme provider, and 404 handling.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component for selecting user avatars via file upload, Giphy search with trending fallback, or removal, with debounced search and request tracking to prevent race conditions.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface with collapsible header, pinned video area, scrollable message list filtering out Creator messages without media, reply functionality, auto-scroll on new messages, and message highlighting on scroll-to-reply.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, message count, and last activity timestamp.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog for creating new chatrooms with topic, description, category selection, and media upload/URL options (image, YouTube, Twitch, Twitter) with validation and preview.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with logo, editable username (alphanumeric, max 15 chars), avatar picker, and back-to-lobby button when in chatroom view.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that renders nothing; authentication is intentionally not used in this anonymous app.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with avatar, timestamp, media embeds (YouTube, Twitch, Twitter, Giphy, images, voice), reactions, pin/reply actions, and reply thread display.",
  "frontend/src/components/MessageInput.tsx": "Message input component with text entry, image upload, Giphy search, voice recording, auto-detection of YouTube/Twitch/Twitter URLs, and character limit enforcement.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video at the top of the chatroom with an unpin button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that renders an audio player with waveform visualization, play/pause controls, and a progress slider for voice messages. Handles audio playback state, metadata loading, and ensures only one audio plays at a time across the app.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom React hook that returns a debounced version of a value, delaying updates until the specified delay period has passed without changes.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Custom hook that ensures chatrooms are freshly fetched when the actor becomes ready by purging stale cache entries (especially empty arrays) and forcing a refetch. Exposes a recovery-in-progress signal and resets on actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and auth client lifecycle. Provides identity state, login status, and authentication methods to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations (chatrooms, messages, reactions, profiles, media uploads) with type conversions from backend linked lists to frontend arrays. Manages local username/avatar storage and provides normalized query keys for caching.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for light/dark themes, mobile-optimized viewport handling, and custom styling for voice message player range inputs.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants for Giphy API integration including API key and result limit.",
  "frontend/src/lib/formatters.ts": "Utility function to format numbers in compact notation (k, M, B) for displaying large counts in a human-readable format.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API, returning structured GIF data with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for dynamic html2canvas library loading.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses images using canvas, with configurable quality and dimensions, while preserving orientation and skipping GIFs/SVGs.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering functionality.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON data and extracts safe preview fields (author, text, image) without DOM manipulation, with in-flight request deduplication and caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed preview data with validation, expiration (7 days), and versioning.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation functionality.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching functionality.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail URLs for YouTube, Twitch (clips/VODs/streams), and Twitter/X posts, plus URL type detection.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for managing and deleting chatrooms, protected by password authentication stored in sessionStorage, with filtering and bulk deletion capabilities.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a single chatroom with loading states, error handling, and automatic view count incrementing. Renders ChatArea component once chatroom data is loaded.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page showing list of chatrooms with client-side search and category filtering. Includes create chatroom dialog and handles actor connection recovery.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking for anonymous board application with 154-room limit, bump-based sorting, position-based archiving system, and pending feature requests for implementation."
}