{
  "backend/main.mo": "Motoko actor implementing chatrooms, messages, reactions, user profiles, and access control with storage mixins and cleanup logic for expired rooms.",
  "feature_evidence.json": "Feature evidence report linking a frontend change for handling expired chatrooms to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality and behavior of various frontend files and components.",
  "frontend/index.html": "Base HTML entry point loading the main TypeScript bundle into the root element.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, root layout, routes, and global providers including theming and toast notifications.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar selection dialog supporting uploads, Giphy search, trending GIFs, and updating or clearing the user's avatar.",
  "frontend/src/components/ChatArea.tsx": "Main chat area handling message loading, auto‑scrolling, sending, replies, header collapsing, and pinned video display.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media thumbnails, live status, and fetched previews for Twitch and Twitter content.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a modal for creating chatrooms with fields for text, media uploads, video URLs, and Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and an external link.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation, username editing, and avatar selection.",
  "frontend/src/components/LoginPrompt.tsx": "Placeholder component that renders nothing to maintain anonymous usage.",
  "frontend/src/components/MessageBubble.tsx": "Displays chat messages with reactions, media embeds, tweet rendering, and pin/reply interactions.",
  "frontend/src/components/MessageInput.tsx": "Provides text input, media upload, video URL, Twitter URL, and voice recording options for sending messages.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useDebouncedValue.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/useQueries.ts": "No summary available.",
  "frontend/src/index.css": "No summary available.",
  "frontend/src/lib/config.ts": "No summary available.",
  "frontend/src/lib/formatters.ts": "No summary available.",
  "frontend/src/lib/giphy.ts": "No summary available.",
  "frontend/src/lib/html2canvasLoader.ts": "No summary available.",
  "frontend/src/lib/imageCompression.ts": "Client-side utility to resize and recompress images with progress reporting, skipping GIF/SVG and returning original on failure or larger output.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Placeholder file with no implemented logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed data, extracts safe fields, caches results, and deduplicates concurrent requests to produce lightweight tweet previews.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter preview data with versioning, expiration, and validation utilities.",
  "frontend/src/lib/twitterThumbnail.ts": "Placeholder file with no implemented logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Placeholder file with no implemented logic.",
  "frontend/src/lib/videoUtils.ts": "Parses YouTube, Twitch, and Twitter URLs for IDs and generates related thumbnail or embed URLs, along with helper type checks.",
  "frontend/src/main.tsx": "Initializes React app root, sets up react-query and Internet Identity provider, and renders the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page requiring a password to view and delete chatrooms, with session persistence and a chatroom management table.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads and displays a chatroom, increments view count, handles missing or expired rooms, and renders ChatArea once data is ready.",
  "frontend/src/pages/LobbyPage.tsx": "React lobby page that lists chatrooms with search, category filtering, loading/error states, and navigation to individual rooms.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, container settings, and registering plugins.",
  "project_state.json": "Project state describing requirements for automatic deletion of chatrooms older than five minutes and related feature requests."
}