{
  "backend/main.mo": "Motoko canister implementing chatrooms, messages, reactions, user profiles, activity tracking, and access control with storage mixins.",
  "feature_evidence.json": "Feature evidence report linking a specific lobby load bug fix to modified files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose and behavior of each frontend file.",
  "frontend/index.html": "Base HTML document loading the frontend with cache-busting directives and versioned script import.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, layout, 404 handling, and theming.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker dialog supporting uploads, GIF search via Giphy, and avatar updates with debounced search.",
  "frontend/src/components/ChatArea.tsx": "Chat area component handling message lists, auto-scroll, replies, pinned video display, and message sending.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom card with media thumbnails, live status, and async fetching for Twitch and Twitter previews.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog to create chatrooms with topic, description, category, and media upload or URL input including YouTube, Twitch, and Twitter.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with attribution and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with navigation, avatar editing, and inline username editing.",
  "frontend/src/components/LoginPrompt.tsx": "Placeholder component that renders nothing since authentication is not used.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual messages with reactions, timestamps, media embedding, and reply/pin functionality.",
  "frontend/src/components/MessageInput.tsx": "Input box for sending messages with support for images, video URLs, Twitter links, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component with waveform visualization, play/pause controls, timers, and synchronized playback handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a value that updates only after a delay, debouncing rapid input changes.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Ensures chatrooms are freshly refetched once when the actor becomes ready, removing bad cache entries and performing recovery attempts if empty.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, identity loading, and state management with AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines chat-related React Query hooks for chatrooms, messages, profiles, and reactions, with caching rules and client-side helpers.",
  "frontend/src/index.css": "Tailwind CSS base styles, theme variables, dark mode, mobile input fixes, and custom styling for the voice message slider.",
  "frontend/src/lib/config.ts": "Exports frontend constants for Giphy API configuration.",
  "frontend/src/lib/formatters.ts": "Provides compact number formatting for displaying large numeric values.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy and map API responses into a simplified GIF format.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file.",
  "frontend/src/lib/imageCompression.ts": "Implements client‑side image compression with resizing, quality control, and progress callbacks, skipping GIF/SVG files.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data into a safe preview object with caching and deduplication.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Stores and retrieves Twitter oEmbed preview objects in localStorage with validation, expiration, and cache versioning.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file.",
  "frontend/src/lib/videoUtils.ts": "Provides utilities to extract IDs and build thumbnail or embed URLs for YouTube, Twitch, and Twitter links.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider and renders the root component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page requiring a password to view and delete chatrooms, using React Query for fetching and sessionStorage for auth.",
  "frontend/src/pages/ChatroomPage.tsx": "Renders a chatroom view, handles fetching the chatroom, error/loading states, and increments view count once loaded.",
  "frontend/src/pages/LobbyPage.tsx": "Displays the lobby with chatroom lists, handling search, category filters, refetching, and navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins including typography and container queries.",
  "project_state.json": "Stores project metadata, known issues, and feature requests related to fixing lobby category-filter behavior."
}