{
  "backend/main.mo": "Motoko canister implementing chatrooms, messages, reactions, user profiles, active user tracking, and access control with storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping two Giphy‑related features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of all major frontend components, hooks, pages, and configuration files.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, 404 handling, theming, and conditional footer visibility on chatroom pages.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker dialog supporting image upload, removal, and Giphy GIF search/selection with debounced queries and update mutations.",
  "frontend/src/components/ChatArea.tsx": "Chat area component handling message list rendering, auto‑scroll, replies, pinned video display, and collapsible header logic.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media thumbnails and live status, including YouTube, Twitch, and Twitter preview handling.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Modal for creating a chatroom with fields for topic, description, category, and media upload or URL validation.",
  "frontend/src/components/Footer.tsx": "Simple footer showing attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with navigation, username editing, and avatar picker access.",
  "frontend/src/components/LoginPrompt.tsx": "No-op component that renders nothing because authentication is disabled.",
  "frontend/src/components/MessageBubble.tsx": "Renders chat messages with reactions, media previews, pinning, reply handling, and optional Twitter embeds.",
  "frontend/src/components/MessageInput.tsx": "Input area for sending messages with support for media attachments, video URLs, Twitter links, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implementation.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio message player component with waveform visualization, playback controls, and time tracking.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook returning a debounced version of a value after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication state, login, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating chatrooms, messages, profiles, and reactions via the backend actor.",
  "frontend/src/index.css": "Tailwind setup with CSS variables for light/dark themes and global layout rules.",
  "frontend/src/lib/config.ts": "Exports GIPHY API configuration constants.",
  "frontend/src/lib/formatters.ts": "Utility for formatting numbers into compact notation like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Functions for searching the Giphy API and mapping results into GIF preview objects.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder file for html2canvas loader logic.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file for Twitter embed rendering logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and caches Twitter oEmbed previews, extracting text, author info, and images without full DOM parsing.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements a localStorage cache for Twitter oEmbed previews with versioning, validation, and expiration handling.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for Twitter thumbnail utilities.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for Twitter thumbnail caching logic.",
  "frontend/src/lib/videoUtils.ts": "Provides helpers to extract IDs from YouTube, Twitch, and Twitter URLs and generate corresponding thumbnail or embed URLs.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a single chatroom, handles view count incrementing, and displays loading or error states before rendering ChatArea.",
  "frontend/src/pages/LobbyPage.tsx": "Displays the chatroom lobby with search, category filtering, and chatroom creation dialog, managing related state and queries.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Describes project state and requirements for redoing Giphy avatar support without affecting existing UI layout."
}