{
  "backend/main.mo": "Main Motoko actor implementing access control, chatrooms, messages, reactions, user profiles, and a reset function clearing all stored data.",
  "backend/migration.mo": "Defines a basic migration module converting an OldActor with an adminPassword to an empty NewActor.",
  "feature_evidence.json": "Feature evidence report listing features, related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like text containing prewritten summaries of multiple frontend source files.",
  "frontend/index.html": "HTML entry point loading the root div and main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, layout, and theme provider with admin, lobby, and chatroom pages.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting or uploading avatars, including Giphy search, uploads, and avatar removal.",
  "frontend/src/components/ChatArea.tsx": "Chat interface handling message fetching, scrolling, replying, sending, and pinned video display.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom preview card with media thumbnails, Twitch and Twitter preview fetching, and live status info.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with topic, description, category, and media upload or URL input including Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation, username editing, and avatar selection.",
  "frontend/src/components/LoginPrompt.tsx": "Placeholder component that renders nothing and enforces no-auth behavior.",
  "frontend/src/components/MessageBubble.tsx": "Displays individual chat messages with reactions, video/Twitter embeds, pinning, and reply functionality.",
  "frontend/src/components/MessageInput.tsx": "Handles composing messages with text, images, video URLs, Twitter links, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implemented functionality.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component with waveform visualization, playback controls, and synchronized state resets on URL changes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook that returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Ensures chatroom list is freshly fetched when the actor becomes ready, clearing bad cache entries and performing a recovery refetch if needed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity login, stored identities, and login status.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for chatrooms, messages, profiles, and reactions, including utilities for usernames, IDs, and image compression.",
  "frontend/src/index.css": "Global Tailwind-based styles, color variables, mobile input fixes, and custom styling for the voice message slider.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Provides a helper to format numbers in compact notation like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy and maps API responses to a simplified GIF format.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file.",
  "frontend/src/lib/imageCompression.ts": "Implements client-side image compression with resizing, quality control, and progress reporting.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to produce a lightweight preview with caching and request deduping.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements localStorage-based caching for Twitter oEmbed previews with validation and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file.",
  "frontend/src/lib/videoUtils.ts": "Provides utilities for extracting IDs from YouTube, Twitch, and Twitter URLs and generating relevant thumbnail or embed URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with InternetIdentity and React Query providers.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for authenticating and managing chatrooms, including deletion and forced refetching of chatroom data.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, increments its view count once, handles loading and error states, and renders ChatArea when data is ready.",
  "frontend/src/pages/LobbyPage.tsx": "Displays and filters chatrooms by search or category, manages debounced search and filter state, and opens navigation or creation dialogs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, versions, features, and pending feature requests for an admin reset functionality."
}