{
  "backend/main.mo": "Defines the chat backend canister with storage mixins, access control, message/chatroom/user types, and state maps for chatrooms, messages, reactions, and profiles.",
  "feature_evidence.json": "Feature evidence report listing refetch fixes across React Query flows with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and key behaviors of major frontend files and components.",
  "frontend/index.html": "Basic HTML entry file mounting the root div and loading the Vite/React main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, layout, 404 handling, and wraps the app with theme and toaster providers.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker supporting image upload, Giphy search/trending results, and avatar updates with optimistic UI and error handling.",
  "frontend/src/components/ChatArea.tsx": "Main chat area handling messages, auto‑scrolling, replies, pinned video display, and sending messages with media support.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media previews, Twitch/YouTube/Twitter thumbnail fetching, and click handling.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with text, media uploads, video links, and Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with navigation, username editing, and avatar picker support.",
  "frontend/src/components/LoginPrompt.tsx": "Placeholder component that renders nothing and enforces no-login behavior.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual messages with reactions, media embeds, pinning, and Twitter widgets.",
  "frontend/src/components/MessageInput.tsx": "Handles sending messages with text, images, videos, Twitter links, and optional voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component that manages playback state, duration loading, waveform visualization, and synchronized pausing of other audio elements.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries when the actor updates.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "On actor readiness, removes legacy chatroom cache entries and forces a one-time fresh refetch of the main chatrooms query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identity loading, and auth client lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines chatroom and message-related React Query hooks, including username/user ID helpers and cache handling logic.",
  "frontend/src/index.css": "Global Tailwind-based styles, theme variables, mobile input fixes, layout rules, and custom styles for the voice message player.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Provides a compact number formatter for values in thousands, millions, or billions.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy and map API responses into simplified GIF objects.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file.",
  "frontend/src/lib/imageCompression.ts": "Implements client-side image compression with resizing, quality control, orientation handling, and progress callbacks.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data into a simplified preview with caching and duplicate-request handling.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed previews, including validation, key building, expiration, and clearing.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file.",
  "frontend/src/lib/videoUtils.ts": "Extracts IDs and metadata from YouTube, Twitch, and Twitter URLs and generates corresponding thumbnail or embed URLs.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin UI for authenticating and deleting chatrooms with password protection, refetching, and table-based management.",
  "frontend/src/pages/ChatroomPage.tsx": "Fetches and displays a specific chatroom, handling loading, errors, and auto-incrementing view count before rendering ChatArea.",
  "frontend/src/pages/LobbyPage.tsx": "Displays the lobby chatroom list with search, category filters, and create dialog, using multiple React Query sources and fallback/refetch logic.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and enabling typography, container-queries, and animation plugins.",
  "project_state.json": "Project metadata describing known issues with React Query inactive chatroom lists and enumerating required refetch-related fixes."
}