{
  "backend/main.mo": "Motoko canister with access control, storage mixin, and full chat backend including chatrooms, messages, reactions, profiles, and validation.",
  "feature_evidence.json": "Feature evidence report describing a thumbnail‑clipping update affecting ChatroomCard.tsx with metadata and components.",
  "frontend-file-summaries.txt": "Text file mapping frontend paths to brief functional summaries for build planning.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app with TanStack Router routes, 404 handling, header/footer layout, and theme/toast providers.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for viewing, uploading, and removing user avatars with validation and async updates.",
  "frontend/src/components/ChatArea.tsx": "Chat view rendering messages, replies, pinned video, auto-scroll behavior, and message sending logic.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom preview card with media thumbnail handling for YouTube, Twitch, and Twitter plus live status and metadata display.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with topic, description, category, and media upload or URL input including YouTube, Twitch, and Twitter preview logic.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation, username editing, and avatar selection features.",
  "frontend/src/components/LoginPrompt.tsx": "Empty placeholder file for a login prompt component.",
  "frontend/src/components/MessageBubble.tsx": "Displays individual chat messages with reactions, pinned video support, embedded media, and reply interactions.",
  "frontend/src/components/MessageInput.tsx": "Provides the message input box with support for images, YouTube/Twitch/Twitter links, uploads, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows the pinned YouTube or Twitch video for a chatroom with an option to unpin.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file for a profile setup modal component.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with waveform visualization, playback controls, and sync to pause other audio elements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identity loading, and status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chatroom, message, and user operations using the backend actor with local user metadata helpers.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, dark mode themes, and mobile input tweaks.",
  "frontend/src/lib/formatters.ts": "Utility to format numbers into compact notation like k, M, and B.",
  "frontend/src/lib/videoUtils.ts": "Parses video and social URLs to extract IDs or slugs and generate thumbnails or embed URLs for YouTube, Twitch, and Twitter.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/ChatroomPage.tsx": "Page that loads a chatroom, increments its view count, handles loading and error states, and renders ChatArea once data is available.",
  "frontend/src/pages/LobbyPage.tsx": "Lobby page that lists chatrooms with search and category filters, handles loading and connection errors, and opens chatrooms or the create dialog.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and container settings, and enabling typography, container query, and animation plugins.",
  "project_state.json": "Project state describing a fix request to ensure lobby thumbnails display rounded corners by clipping media inside a rounded wrapper."
}