{
  "backend/main.mo": "Motoko actor implementing chatrooms, messages, reactions, user profiles, active users, media storage, and role-based access control.",
  "feature_evidence.json": "Feature evidence report placeholder with no features listed.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend source files for reference.",
  "frontend/index.html": "HTML entry point setting up root div and loading main.tsx with cache-busting.",
  "frontend/src/App.tsx": "React app router defining lobby, chatroom, and admin routes with header/footer visibility logic and a 404 fallback.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker dialog supporting uploads, GIF search via Giphy, avatar removal, and local avatar updates.",
  "frontend/src/components/ChatArea.tsx": "Chat area handling message list, auto-scroll, replies, pinned video, and send-message interactions.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom card with media thumbnails, Twitch and Twitter preview fetching, and basic metadata display.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with topic, category, media upload, and YouTube/Twitch/Twitter URL validation.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright message and link.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation, username editing, and avatar picker integration.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that intentionally renders nothing.",
  "frontend/src/components/MessageBubble.tsx": "Displays individual messages with reactions, video embeds, Twitter embeds, and pin/reply interactions.",
  "frontend/src/components/MessageInput.tsx": "Handles composing messages with text, media uploads, YouTube/Twitch/Twitter URLs, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with waveform visualization, playback controls, and synchronization across multiple audio elements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced value that updates after a specified delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Ensures chatroom data is freshly refetched when the actor becomes ready by purging stale cache entries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating chatrooms, messages, and user data with actor integration.",
  "frontend/src/index.css": "Tailwind base styles plus theme variables and custom styling including voice message slider appearance.",
  "frontend/src/lib/config.ts": "Defines frontend configuration constants like the GIPHY API key and result limits.",
  "frontend/src/lib/formatters.ts": "Provides a compact number formatter converting large numbers into k/M/B notation.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy, mapping API responses into a simplified GIF structure.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file.",
  "frontend/src/lib/imageCompression.ts": "Implements client‑side image compression with resizing, quality control, and progress callbacks.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON, extracts safe preview fields, caches results, and deduplicates concurrent requests.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching of Twitter preview data with validation, versioning, and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file.",
  "frontend/src/lib/videoUtils.ts": "Contains URL parsers and thumbnail generators for YouTube, Twitch, and Twitter content.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page allowing password‑protected chatroom deletion with filtering and confirmation dialogs.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, increments its view count once, handles loading and error states, and renders the ChatArea component when data is available.",
  "frontend/src/pages/LobbyPage.tsx": "Displays the lobby with chatroom search, category filtering, creation dialog, and navigation to individual rooms using client-side filtered chatroom data.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, plugins, and content paths for styling the frontend.",
  "project_state.json": "Tracks project state, backend payload-limit issues, anonymization plans, and pending backend fix requests related to getChatrooms."
}