{
  "backend/main.mo": "Main Motoko actor implementing a chatroom application with message storage, user profiles, reactions, access control, blob storage for media uploads, and HTTP outcalls for external integrations.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, pages, and configuration files describing UI layout, query management, chat functionality, and styling.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration for mobile, and versioned script tag loading the React application.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with lobby, chatroom, and admin routes, conditional header/footer rendering, theme provider, and 404 handling.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Modal dialog component for selecting user avatars via file upload or Giphy search with debounced search, trending GIFs fallback, and avatar removal functionality.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface component with collapsible header, pinned video display, scrollable message list with auto-scroll, reply context handling, message highlighting, and filtered Creator messages without media.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, message count, and formatted timestamps. Fetches Twitch thumbnails and Twitter oEmbed previews on mount.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog component for creating new chatrooms with topic, description, category selection, and media upload/URL input (YouTube, Twitch, Twitter). Handles image uploads with progress tracking and Twitter widget embedding for post previews.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with logo, username editing functionality, avatar picker, and back-to-lobby navigation for chatroom views. Manages username state with character limit and validation.",
  "frontend/src/components/LoginPrompt.tsx": "Intentional no-op placeholder component that renders nothing, with comments explicitly stating authentication must not be introduced to keep the app anonymous.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with avatar, timestamp, reactions, media embeds (YouTube, Twitch, Twitter), voice playback, pin/unpin functionality, and reply threading. Handles emoji reactions and message highlighting.",
  "frontend/src/components/MessageInput.tsx": "Chat input component with text message composition, media attachment (image upload, video URL, Twitter URL), voice recording with timer, and validation for different media types. Includes progress tracking for uploads and recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned video player for YouTube or Twitch content with an unpin button. Renders appropriate iframe embed based on media type and URL.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that renders an audio player with waveform visualization, play/pause controls, and a progress slider. Handles audio playback state, metadata loading, and ensures only one audio plays at a time across the app.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that returns a debounced version of a value, delaying updates until the specified delay period has passed without changes.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "React hook that purges stale or empty chatroom cache entries and forces a fresh refetch when the actor becomes ready, ensuring the lobby always loads correctly on first page load. Exposes a recovery-in-progress signal for loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for chatroom and message operations including fetching, searching, filtering by category, creating/deleting chatrooms, sending messages with media support, and managing reactions. Includes localStorage-based username/avatar management and query key normalization.",
  "frontend/src/index.css": "Global Tailwind CSS styles with custom CSS variables for light/dark themes, mobile-optimized viewport handling, and custom styling for voice message player range inputs.",
  "frontend/src/lib/config.ts": "Frontend configuration constants for Giphy API integration, including API key and result limit.",
  "frontend/src/lib/formatters.ts": "Utility function to format numbers in compact notation (k, M, B) for display purposes.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API, returning structured GIF data with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for dynamic html2canvas library loading.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses images using canvas, preserving orientation and only returning compressed version if smaller than original.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering functionality.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON data and extracts safe preview fields (author, text, image) without DOM snapshotting, with in-flight request deduplication and caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed preview data with validation, expiration (7 days), and versioning.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation functionality.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching functionality.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail URLs for YouTube, Twitch (clips/VODs/live), and Twitter/X posts, plus URL type detection helpers.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for managing and deleting chatrooms, protected by password authentication stored in sessionStorage, with filtering and bulk operations support.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a single chatroom page with loading states, error handling, and view count tracking. Renders the ChatArea component when chatroom data is successfully loaded.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page that lists all chatrooms with search and category filtering capabilities. Includes a create chatroom dialog and handles client-side filtering of chatroom data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, and custom animations for accordion components.",
  "project_state.json": "Project metadata tracking feature requests to ensure category tags are displayed in lowercase across all views, particularly in the ChatroomPage component."
}