{
  "backend/main.mo": "Main actor implementing chatrooms, messages, reactions, user profiles, access control, and blob storage integration with numerous record types and state maps.",
  "backend/migration.mo": "Migration module converting old chatroom records to a new format by making media fields optional and returning an updated map.",
  "feature_evidence.json": "Feature evidence report linking a UI change about media-optional chatroom creation to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing structure, behavior, and recent UI or logic changes.",
  "frontend/index.html": "Base HTML document loading the React entrypoint with cache‑busting parameters and mobile viewport settings.",
  "frontend/src/App.tsx": "Top-level React app configuring TanStack Router routes, layout with header/footer rules, and global providers.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting, uploading, searching, or removing user avatars with Giphy integration and image upload support.",
  "frontend/src/components/ChatArea.tsx": "Chat interface handling message loading, auto‑scrolling, sending, replies, pinned video, and collapsible header behavior.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom preview card with media thumbnails, Twitch/Twitter previews, and click handling.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Modal for creating chatrooms with fields for topic, description, category, and media upload or URL validation.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with app branding, back navigation, and username/avatar editing.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component since authentication is disabled.",
  "frontend/src/components/MessageBubble.tsx": "Displays individual chat messages with reactions, media embeds, replies, and pin/unpin actions.",
  "frontend/src/components/MessageInput.tsx": "Input box for sending messages with image upload, video/Twitter URL validation, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows the currently pinned YouTube or Twitch video with an option to unpin.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with waveform visualization, playback controls, and synchronized state handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Ensures chatroom data is freshly refetched when the actor becomes ready by purging outdated cache entries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, persistence, and auth-client management via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines chatroom, message, and profile queries/mutations, including search and image compression helpers.",
  "frontend/src/index.css": "Tailwind base styles plus theme variables, layout rules, mobile input fixes, and voice message slider styling.",
  "frontend/src/lib/config.ts": "Exports GIPHY API configuration constants.",
  "frontend/src/lib/formatters.ts": "Provides compact number formatting (k, M, B) utility.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy, mapping API results to a simplified GIF object format with error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file placeholder.",
  "frontend/src/lib/imageCompression.ts": "Implements client‑side image compression with resizing, quality control, progress callbacks, and fallbacks when compression fails.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file placeholder.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to build lightweight preview objects with caching and duplicate‑request deduplication.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter previews with validation, versioning, expiration, and cache clearing.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file placeholder.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file placeholder.",
  "frontend/src/lib/videoUtils.ts": "Extracts IDs and generates thumbnail or embed URLs for YouTube, Twitch, and Twitter links with multiple format handlers.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin UI for authenticating with a hardcoded password and managing chatrooms, including fetching, filtering, and deletion workflows.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a chatroom by ID, handles loading and error states, increments view count, and renders ChatArea once data is loaded.",
  "frontend/src/pages/LobbyPage.tsx": "Shows searchable and filterable chatroom list, manages category/search filters, and navigates to selected chatrooms.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, plugins, and content scanning paths.",
  "project_state.json": "Describes current project state, architectural constraints, known issues, and pending backend fix requirements."
}