{
  "backend/main.mo": "Motoko actor managing chatrooms, messages, reactions, user profiles, activity tracking, and role-based access control with storage mixins.",
  "feature_evidence.json": "Feature evidence report listing two frontend ChatArea.tsx feature requirements with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing major frontend files including components, hooks, pages, and configuration.",
  "frontend/index.html": "Base HTML entry file loading the React app root and main script with mobile viewport settings.",
  "frontend/src/App.tsx": "Sets up TanStack Router with lobby and chatroom routes, shared layout, 404 handling, theme provider, and conditional footer.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog enabling avatar selection via upload or Giphy search with debounced queries, upload validation, and avatar update mutations.",
  "frontend/src/components/ChatArea.tsx": "Chat interface with collapsible header, message list with auto‑scrolling, reply handling, pinned video, and compact message/user count icons.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media previews (YouTube, Twitch, Twitter), live status, and thumbnail fetching logic.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Modal dialog for creating chatrooms with topic, description, category, and media upload or URL (YouTube, Twitch, Twitter) support.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing app branding, username editing, avatar selection, and back navigation for chatrooms.",
  "frontend/src/components/LoginPrompt.tsx": "Placeholder component that renders nothing because the app uses no authentication.",
  "frontend/src/components/MessageBubble.tsx": "Displays individual chat messages with reactions, timestamps, media embedding, replies, and Twitter widget loading.",
  "frontend/src/components/MessageInput.tsx": "Provides a message composer with text, media uploads, video/Twitter URL validation, and optional voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video for a chatroom with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "A React audio player component that manages playback, waveform visualization, timing updates, and UI styling for voice messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor via Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout through AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chatrooms, messages, profiles, and reactions using the backend actor and local user metadata.",
  "frontend/src/index.css": "Tailwind CSS setup with custom CSS variables, theming, and layout defaults for light and dark modes.",
  "frontend/src/lib/config.ts": "Exports API configuration constants for Giphy integration.",
  "frontend/src/lib/formatters.ts": "Utilities for formatting numbers using compact notation (k, M, B).",
  "frontend/src/lib/giphy.ts": "Functions for searching and fetching trending GIFs from the Giphy API and mapping results to app-friendly objects.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder file for future html2canvas logic.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file for future Twitter embed rendering code.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data with caching, deduped requests, and lightweight HTML extraction for text and images.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements localStorage-based caching for Twitter oEmbed previews with validation, versioning, and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for Twitter thumbnail utilities.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for Twitter thumbnail caching.",
  "frontend/src/lib/videoUtils.ts": "Provides helpers to extract IDs and build thumbnails for YouTube, Twitch, and Twitter URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom, handles loading/error states, increments view count, and renders the chat interface.",
  "frontend/src/pages/LobbyPage.tsx": "Displays and filters chatrooms with search, category filters, and creation dialog handling.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, and container settings for the frontend.",
  "project_state.json": "Contains the project’s current state, including schema/version info, existing feature specs, a new feature request about chatroom header updates, and project metadata."
}