{
  "backend/main.mo": "Motoko backend actor implementing chatrooms, messages, reactions, profiles, access control, and in‑canister storage with OrderedMap state tracking.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, impacted files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short functional summaries for each component or page.",
  "frontend/index.html": "Main HTML entrypoint configuring cache-busting and mounting the root React application.",
  "frontend/src/App.tsx": "Top-level React app with TanStack Router routes for lobby, chatroom, and admin pages plus layout and theming.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker dialog with file upload, GIF search via Giphy, and avatar update/remove actions using React Query.",
  "frontend/src/components/ChatArea.tsx": "Chat area component handling message fetching, auto-scroll, replies, pinned video, and message sending UI logic.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom card with media thumbnails, Twitch and Twitter preview loading, and formatted timestamps.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with topic, description, category, and media upload or URL options including Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with navigation, avatar selection, and editable username.",
  "frontend/src/components/LoginPrompt.tsx": "Placeholder component that renders nothing because authentication is not used.",
  "frontend/src/components/MessageBubble.tsx": "Displays chat messages with reactions, timestamps, media embeds, and reply/pin interactions.",
  "frontend/src/components/MessageInput.tsx": "Provides text input, media upload, video/Twitter URL entry, and audio recording for sending messages.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with waveform visualization, playback controls, and synced state resets on URL changes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Forces a fresh chatroom refetch when the actor becomes ready, purging stale or incorrect cache entries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for chatrooms, messages, and user utilities with search, categories, and local identity helpers.",
  "frontend/src/index.css": "Tailwind-based global styles including theme variables, layout rules, and voice message slider styling.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Formats numbers into compact notation like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy and maps API responses to a simple GIF model.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file.",
  "frontend/src/lib/imageCompression.ts": "Implements client-side image compression with resizing, quality control, and progress callbacks.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to build lightweight tweet previews with caching and deduped requests.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching of tweet previews with validation, expiration, and versioning.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file.",
  "frontend/src/lib/videoUtils.ts": "Extracts IDs and generates thumbnails for YouTube, Twitch, and Twitter URLs, with helpers to detect platform types.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers and mounts the root component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page with password protection to list and delete chatrooms, using React Query for fetching and mutations.",
  "frontend/src/pages/ChatroomPage.tsx": "Renders a chatroom page, fetching chatroom data, handling loading/error states, incrementing view count once, and displaying ChatArea when ready.",
  "frontend/src/pages/LobbyPage.tsx": "Displays the lobby with chatroom lists, applying search/category filters, handling debounced search, recovery refetching, and navigation to chatrooms.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, color variables, animations, container settings, and enabling typography, container-query, and animate plugins.",
  "project_state.json": "Describes project state, known lobby data-staleness issues, and feature requirements for fixing stale chatroom list behavior without altering recovery flow."
}