{
  "backend/main.mo": "Main Motoko actor implementing a chatroom application with message handling, user profiles, reactions, access control, blob storage integration, and HTTP outcalls. Includes CRUD operations for chatrooms and messages, active user tracking, and admin functions.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: adding visible 'Reply' and 'React' text labels to buttons in MessageBubble.tsx, both with high confidence and associated test IDs REQ-1 and REQ-2.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx (routing), hooks (React Query), components (Header, ChatArea, MessageBubble with reply/react labels, MessageInput), styling, and pages with their key features and recent changes.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration for mobile support, and versioned script tag (v=203) to force production refresh.",
  "frontend/src/App.tsx": "Root application component using TanStack Router with routes for lobby, chatroom, and admin pages, conditional header/footer rendering (hidden on admin pages), and 404 handling with theme provider wrapper.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component for selecting user avatars via file upload, Giphy search with debounced trending/search results, or removal, with request tracking to prevent race conditions and initials fallback generation.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface with collapsible header (centered on md+ screens), pinned video area, auto-scrolling message list that filters out Creator messages without media, reply preview with scroll-to-message functionality, and message input with category badge display.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, message count, and category badges. Fetches Twitch thumbnails and Twitter oEmbed previews on mount.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog for creating new chatrooms with topic, description, category selection, and media upload/URL options (image, YouTube, Twitch, Twitter). Handles file uploads with progress tracking and validates video URLs.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "App header with logo, username editing (alphanumeric validation, 15 char limit), avatar picker, and back-to-lobby button when in chatroom view.",
  "frontend/src/components/LoginPrompt.tsx": "Intentional no-op placeholder component that renders nothing, as the app is designed to work anonymously without authentication.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with avatar, timestamp, media embeds (YouTube, Twitch, Twitter, Giphy, voice), reactions, pin/unpin functionality, and reply support. Loads Twitter widgets dynamically and handles reaction management.",
  "frontend/src/components/MessageInput.tsx": "Message input component with text area, image upload, Giphy search, voice recording, and auto-detection of YouTube/Twitch/Twitter URLs in message text. Includes upload progress tracking and 2000 character limit.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video in an iframe with an unpin button at the top of the chatroom.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that renders an audio player with waveform visualization, play/pause controls, and a progress slider. Handles audio playback state, metadata loading, and ensures only one audio plays at a time across the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that returns a debounced version of a value, delaying updates until the specified delay period has passed without changes.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Custom hook that ensures chatrooms are freshly fetched when the actor becomes ready by purging legacy cache entries, detecting persisted empty arrays, and forcing a refetch. Exposes a recovery-in-progress signal for loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flows, identity persistence, and auth client lifecycle. Exports useInternetIdentity hook and InternetIdentityProvider component.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chatroom and message operations including fetching, searching, creating, updating, and deleting chatrooms and messages. Manages local username/userId generation and handles query key normalization for search and category filters.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for light/dark themes, mobile-specific input styles to prevent zoom on iOS, and custom styling for voice message player range inputs.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants for Giphy API integration including the API key and result limit.",
  "frontend/src/lib/formatters.ts": "Utility function that formats numbers into compact notation with k/M/B suffixes for thousands, millions, and billions.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API, returning structured GIF data with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for dynamic html2canvas library loading.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses images using canvas, preserving orientation and only returning compressed version if smaller than original.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering functionality.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON data and extracts safe preview fields (author, text, image) without DOM manipulation, with caching and request deduplication.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed preview data with validation, expiration (7 days), and versioning.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation functionality.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching functionality.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail URLs for YouTube, Twitch (clips/VODs/streams), and Twitter/X posts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for managing and deleting chatrooms, protected by password authentication stored in session storage with filtering and bulk operations.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a single chatroom page with loading states, error handling, and automatic view count incrementing. Renders the ChatArea component once chatroom data is loaded.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page that displays a list of chatrooms with search and category filtering, handles loading/error states, and provides a dialog to create new chatrooms. Implements client-side filtering on fetched chatroom data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking two completed features to add visible 'Reply' and 'React' text labels to buttons in the MessageBubble component."
}