{
  "backend/main.mo": "Main Motoko actor implementing a chatroom application with message management, user profiles, reactions, access control, blob storage integration, and HTTP outcalls. Includes CRUD operations for chatrooms and messages, active user tracking, and admin functions.",
  "feature_evidence.json": "Feature evidence report documenting two UI layout changes to MessageInput component: repositioning image/microphone buttons to the left of text input and ensuring vertical alignment with matching heights.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, query hooks, UI components, styling, and page layouts with detailed implementation notes about username validation, avatar management, message rendering, and responsive design.",
  "frontend/index.html": "HTML entry point with mobile viewport configuration, cache-busting meta tags, and versioned script import (v=203) to force production refresh.",
  "frontend/src/App.tsx": "Root application component using TanStack Router with lobby, chatroom, and admin routes, conditional header/footer rendering (hidden on admin pages), theme provider, and 404 handling.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Modal dialog for avatar selection supporting file upload, Giphy GIF search with debounced queries, trending GIFs, and avatar removal with request deduplication using ref-based request IDs.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface with collapsible header (centered on md+ screens), pinned video area, auto-scrolling message list that filters out Creator messages without media, reply functionality with scroll-to-message highlighting, and lowercase category badges.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, message count, and time since creation. Fetches Twitch thumbnails and Twitter oEmbed previews on mount.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog for creating a new chatroom with topic, description, category selection, and media upload/URL options (image, YouTube, Twitch, Twitter). Handles file uploads with progress tracking and validates video URLs.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "App header with logo, username editing (alphanumeric validation, 15 char limit), avatar picker, and back-to-lobby button when in a chatroom. Manages username state and navigation.",
  "frontend/src/components/LoginPrompt.tsx": "Intentional no-op placeholder component that renders nothing, as the app is designed to work anonymously without authentication.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with avatar, timestamp, media embeds (YouTube, Twitch, Twitter, Giphy, images, voice), reactions, pin/unpin functionality, and reply support. Handles Twitter widget loading and reaction management.",
  "frontend/src/components/MessageInput.tsx": "Message input component with text area (2000 char limit), image upload, Giphy search, voice recording, and auto-detection of YouTube/Twitch/Twitter URLs in message text. Manages media upload progress and recording state.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video in an iframe with an unpin button, rendered at the top of the chatroom.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that renders an audio player with play/pause controls, waveform visualization, and a progress slider for voice messages. Handles audio playback state, metadata loading, and ensures only one audio plays at a time across the app.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom React hook that returns a debounced version of a value, delaying updates until the specified delay period has passed without changes.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Custom hook that forces a one-time fresh refetch of chatrooms when the actor becomes ready, purging legacy empty-filter cache entries and persisted empty arrays to ensure the lobby always loads correctly on first page load.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for chatroom and message operations including fetching, searching, creating, updating, deleting chatrooms and messages, with username/avatar management stored in localStorage. Includes helper functions for query key normalization and data transformation.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives, CSS custom properties for light/dark theme colors using OKLCH color space, mobile-specific input styles to prevent zoom, and custom styling for voice message player range inputs.",
  "frontend/src/lib/config.ts": "Frontend configuration constants for Giphy API integration, defining the API key and result limit.",
  "frontend/src/lib/formatters.ts": "Utility function to format numbers with compact notation (k, M, B) for displaying large numbers in a human-readable format.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API, returning structured GIF data with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for dynamic html2canvas library loading.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses images using canvas, preserving orientation and only returning compressed version if smaller than original.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering functionality.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON to extract safe preview fields (author, text, image) without DOM snapshotting, with in-flight request deduplication and caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed preview data with validation, expiration (7 days), and versioning.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation functionality.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching functionality.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail URLs for YouTube, Twitch (clips/VODs/streams), and Twitter/X posts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for managing chatrooms with password authentication (stored in sessionStorage), displaying chatroom list with filtering and deletion capabilities.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a single chatroom page with loading states, error handling, and automatic view count incrementing. Renders the ChatArea component once chatroom data is loaded.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page that displays a searchable and filterable list of chatrooms with category badges. Includes create chatroom dialog and handles client-side filtering of chatroom data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata tracking feature requests to reposition image upload and microphone buttons to the left of the text input field with aligned heights in the MessageInput component."
}