{
  "backend/main.mo": "Main canister implementing storage, access control, chatrooms, messages, reactions, user profiles, and media validation.",
  "feature_evidence.json": "Feature evidence report linking a category-tag UI update to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App root setting up TanStack Router routes, layout, footer visibility, and 404 behavior.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting preset avatars, uploading custom images, or removing the current avatar.",
  "frontend/src/components/ChatArea.tsx": "Chat interface handling message retrieval, auto-scroll, replies, pinned video display, and message sending.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom preview card with media thumbnails for YouTube, Twitch, or Twitter and handles fallback thumbnail fetching.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating a chatroom with topic, description, media uploads, and YouTube/Twitch/Twitter URL validation and preview.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the site header with navigation, username editing, avatar selection, and back-to-lobby logic.",
  "frontend/src/components/LoginPrompt.tsx": "Empty component file.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with reactions, media embeds (YouTube/Twitch/Twitter), pinning, replies, and voice playback.",
  "frontend/src/components/MessageInput.tsx": "Handles composing messages with text, image uploads, YouTube/Twitch/Twitter links, and optional audio recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty component file.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that plays audio messages with a waveform visualization, playback controls, and syncing with other audio elements.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity, invalidating dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and AuthClient initialization.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating chat-related data, using the backend actor and local user metadata.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, dark mode, layout rules, and mobile input adjustments.",
  "frontend/src/lib/formatters.ts": "Utility for formatting numbers into compact notation like k, M, and B.",
  "frontend/src/lib/videoUtils.ts": "Utilities for extracting IDs from YouTube, Twitch, and Twitter URLs and generating thumbnails or embed URLs.",
  "frontend/src/main.tsx": "App entry point that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/ChatroomPage.tsx": "Fetches and displays a chatroom, handles loading and error states, and increments the room’s view count once loaded.",
  "frontend/src/pages/LobbyPage.tsx": "Displays the chatroom lobby with search, category filtering, and creation dialog, selecting data from multiple query sources based on active filters.",
  "frontend/tailwind.config.js": "Defines TailwindCSS configuration with custom colors, container settings, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes the project’s current state, architecture, and known issues for the Chattr chatroom application."
}