{
  "backend/main.mo": "Motoko canister defining chatrooms, messages, reactions, user profiles, and access control with storage, maps, and role‑based admin operations.",
  "feature_evidence.json": "Feature evidence report listing three lobby‑page refactor features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of short summaries for all major frontend files including pages, components, hooks, and config.",
  "frontend/index.html": "Base HTML file loading the React app with cache‑busting directives and versioned script import.",
  "frontend/src/App.tsx": "Main app router setup defining root, lobby, chatroom, and admin routes with conditional header/footer rendering and 404 fallback.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar selection dialog supporting uploads, GIF search via Giphy, avatar removal, and updating the stored avatar.",
  "frontend/src/components/ChatArea.tsx": "Chat interface handling message fetching, auto‑scroll, replies, pinned video, and sending messages with media support.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom preview card with video/Twitter thumbnails, live status, and metadata, fetching Twitch and Twitter previews as needed.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with fields for text, categories, and media via upload, video URLs, or Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with navigation, username editing, and avatar selection, adapting UI when inside a chatroom.",
  "frontend/src/components/LoginPrompt.tsx": "A no-op component that renders nothing, preserving anonymous app behavior.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with timestamps, reactions, replies, and embedded media including YouTube, Twitch, Twitter, and voice messages.",
  "frontend/src/components/MessageInput.tsx": "Provides a message input box with image upload, YouTube/Twitch/Twitter URL handling, and audio recording capabilities.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video in a chatroom with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "File is empty or missing content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with waveform visualization and synced playback state, handling metadata loading and play/pause control.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Ensures chatroom data is freshly refetched by purging stale cache entries when the backend actor becomes ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for chatrooms, messages, and user data, including search logic and localStorage-backed user identity helpers.",
  "frontend/src/index.css": "Tailwind-based global styles, theme variables, mobile input fixes, and custom styles for the voice message range slider.",
  "frontend/src/lib/config.ts": "Exports frontend config constants for Giphy API use.",
  "frontend/src/lib/formatters.ts": "Provides a helper to format numbers using compact notation like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy, mapping API responses into a simplified GIF format with error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder file.",
  "frontend/src/lib/imageCompression.ts": "Implements client-side image compression with resizing, quality settings, and progress reporting, skipping GIF/SVG and falling back safely.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to build lightweight tweet previews with caching and deduplication of requests.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching of Twitter preview objects with validation, expiration, and cache key generation based on tweet IDs.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file.",
  "frontend/src/lib/videoUtils.ts": "Extracts video IDs and metadata from YouTube, Twitch, and Twitter URLs and generates appropriate thumbnail or embed URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider before rendering the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page requiring authentication to view and delete chatrooms, handling session-based login, refetching, and UI for deletion.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, handles loading/error states, increments view count once, and renders ChatArea when data is ready.",
  "frontend/src/pages/LobbyPage.tsx": "Displays chatroom list using a single canonical query with debounced search, category filters, and recovery handling, plus navigation and create-room dialog.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins including typography and container queries.",
  "project_state.json": "Describes project state and feature requirements focused on fixing lobby chatroom loading by using a single canonical query with client-side filtering."
}