{
  "backend/main.mo": "Main backend actor implementing a chatroom system with message management, user profiles, reactions, access control, blob storage, and HTTP outcalls. Includes data migration support and defines core types like Message (with Text id), Chatroom, UserProfile, and various query/update functions.",
  "backend/migration.mo": "Migration module that converts old data structures (Nat-based message IDs) to new structures (Text-based message IDs with zero-padded formatting). Includes formatMessageId function that pads IDs to 9 digits.",
  "feature_evidence.json": "Feature evidence report documenting that message ID display in MessageBubble component (styled like 4chan post numbering) has been implemented with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx (router with messageId search param), MessageBubble.tsx (displays message ID as \"No. {id}\" in monospace), ChatArea.tsx (scroll-to-message with string messageId), and other UI components with detailed styling and functionality notes.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration for mobile, and versioned script tag (v=203) to force production refresh.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup defining lobby, chatroom (with messageId search param validation as string), and admin routes. Conditionally renders Header/Footer based on route.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component for selecting user avatars with file upload, Giphy search/trending integration, and avatar removal functionality. Includes debounced search and request tracking to prevent race conditions.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface component that displays messages, handles message sending with media/replies, manages scrolling behavior, and shows chatroom header with live status and participant count.",
  "frontend/src/components/ChatroomCard.tsx": "Card component displaying chatroom preview with thumbnail (YouTube/Twitch/Twitter), metadata (topic, category, participant count), and live status badge.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Modal dialog for creating new chatrooms with topic, description, category selection, and media upload/URL support for images, YouTube, Twitch, and Twitter content.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Application header with logo, back navigation for chatrooms, and inline username editing with avatar picker integration.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that renders nothing; authentication is intentionally not implemented as the app works anonymously.",
  "frontend/src/components/MessageBubble.tsx": "Individual message display component with support for text, images, YouTube/Twitch/Twitter embeds, voice messages, reactions, replies, pinning, and sharing functionality.",
  "frontend/src/components/MessageInput.tsx": "Message input component with support for text messages, image uploads, voice recording, Giphy GIF search, and auto-detection of YouTube/Twitch/Twitter URLs. Includes progress tracking, debounced search, and media preview functionality.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned video (YouTube or Twitch) with an unpin button. Renders embedded iframes for supported video platforms using utility functions to extract video IDs and generate embed URLs.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component for voice messages with play/pause controls, waveform visualization, progress slider, and time display. Handles audio metadata loading, playback synchronization, and automatic cleanup.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that debounces a value by delaying updates until after a specified delay period (default 300ms). Uses setTimeout to batch rapid changes.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that ensures chatroom list is freshly fetched when the actor becomes ready by purging legacy cache entries, detecting persisted empty arrays, and forcing a refetch. Exposes recovery state and resets on actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication using @dfinity/auth-client. Provides login, logout, identity state management, and login status tracking with configurable options for AuthClient creation and idle handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for chatroom operations (CRUD, messages, reactions, user profiles) with localStorage-based username/userId management, image upload/compression, and query key normalization for search and categories.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with CSS custom properties for light/dark themes, mobile viewport fixes, iOS input zoom prevention, and custom voice message range input styling.",
  "frontend/src/lib/config.ts": "Frontend configuration constants for Giphy API key and result limit.",
  "frontend/src/lib/formatters.ts": "Utility function to format numbers with compact notation (k, M, B) for display.",
  "frontend/src/lib/giphy.ts": "Giphy API integration for searching and fetching trending GIFs with error handling and result mapping.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for html2canvas dynamic import logic.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses images using canvas while preserving orientation, with configurable quality and dimensions.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON to extract safe preview fields (author, text, image) with caching and in-flight request deduplication, avoiding CORS issues.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "localStorage-based cache for Twitter oEmbed preview data with validation, expiration (7 days), and versioning support.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching logic.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail/embed URLs for YouTube, Twitch, and Twitter/X platforms.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for managing and deleting chatrooms with password authentication, category filtering, and a table view of all chatrooms.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a single chatroom with ChatArea component, handles view count incrementing, and supports navigation with optional messageId query parameter.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying all chatrooms with search, category filtering, and algorithmic sorting (live rooms first, then by view count and creation date).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme properties, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for re-adding sequential 9-digit message IDs with global counter across all chatrooms, including architectural notes and pending feature requests."
}