{
  "backend/main.mo": "Motoko actor implementing chatrooms, messages, user profiles, reactions, access control, and storage using ordered maps and blob storage.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend features, involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing routing, components, hooks, and UI behaviors.",
  "frontend/index.html": "HTML entry point defining root container and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, layout, error pages, and theme provider.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog allowing users to set avatars via uploads or Giphy search with debounced queries and update mutations.",
  "frontend/src/components/ChatArea.tsx": "Chat interface managing message list, auto-scroll, sending messages, replies, pinned video, and collapsible header.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with dynamic media previews for YouTube, Twitch, and Twitter, including thumbnail fetching and timestamp formatting.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Modal for creating a chatroom with topic, description, category, and media input supporting uploads, YouTube/Twitch URLs, and Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with navigation, username editing, avatar selection, and chatroom back navigation.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that intentionally renders nothing.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with reactions, replies, timestamps, video embeds, and optional Twitter widgets.",
  "frontend/src/components/MessageInput.tsx": "Provides text input, media upload, video/Twitter link validation, and voice recording for sending new messages.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin it from the chatroom.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty or placeholder file with no implementation.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component with play/pause controls, waveform visualization, timing, and synchronized playback handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the Internet Identity, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Ensures chatroom list refetches once when the actor becomes ready, removing legacy cache keys and invalidating the main query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and persistence through a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Defines chatroom, message, and profile queries and mutations using the backend actor with local user data helpers and cache logic.",
  "frontend/src/index.css": "Tailwind base styling with theme variables, dark mode, mobile-friendly input rules, and custom voice message slider styles.",
  "frontend/src/lib/config.ts": "Contains Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Provides a compact number formatter for values in thousands, millions, or billions.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy, mapping API responses into a simplified GIF object format with error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file.",
  "frontend/src/lib/imageCompression.ts": "Implements client-side image compression with resizing, quality control, progress tracking, and fallbacks when compression is unnecessary or fails.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and reconstructs safe Twitter oEmbed previews with caching, deduplication, and HTML parsing for text and images.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching of Twitter oEmbed previews with versioning, validation, expiration, and key generation based on tweet IDs.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file.",
  "frontend/src/lib/videoUtils.ts": "Extracts identifiers from YouTube, Twitch, and Twitter URLs and generates corresponding thumbnail or embed URLs with helper type checks.",
  "frontend/src/main.tsx": "Bootstraps the React app by creating the root and wrapping it with query and identity providers.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Implements an admin interface for authenticating via a hardcoded password and managing chatrooms, including fetching and deleting entries.",
  "frontend/src/pages/ChatroomPage.tsx": "Fetches a chatroom by ID, increments its view count once loaded, handles loading/error states, and renders ChatArea.",
  "frontend/src/pages/LobbyPage.tsx": "Displays chatroom lists with search and category filters, manages initial fetch logic, and handles loading/error states with navigation to chatrooms.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking known issues, feature requests, and architectural notes for fixing initial lobby chatroom loading behavior."
}