{
  "backend/main.mo": "Main Motoko actor implementing a chatroom application with access control, blob storage, message/reaction management, user profiles, and HTTP outcalls. Includes CRUD operations for chatrooms, messages, reactions, and admin functions for deletion with password protection.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of CSS overflow constraints for Twitter/X embeds in the MessageBubble component to prevent container overflow.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components including routing, query hooks, UI components (Header, ChatArea, MessageBubble, MessageInput), styling configuration, and page layouts with detailed feature descriptions.",
  "frontend/index.html": "HTML entry point with viewport meta tags for mobile support, cache-busting directives, and versioned script tag (v=203) to force production refresh.",
  "frontend/src/App.tsx": "Root application component using TanStack Router with routes for lobby, chatroom, and admin pages, conditionally rendering Header/Footer based on route, with 404 handling and theme provider integration.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Modal dialog for avatar selection supporting custom image uploads, Giphy GIF search with debounced queries, trending GIFs, and avatar removal with request deduplication using ref-based request tracking.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface with collapsible header (responsive centering on md+ screens), pinned video area, auto-scrolling message list that filters out Creator messages without media, reply functionality with scroll-to-message and highlighting, and category badge display.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, message count, and category badges. Fetches Twitch thumbnails and Twitter oEmbed previews on mount.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog for creating new chatrooms with topic, description, category selection, and media upload (image/video/Twitter). Validates YouTube and Twitch URLs, handles image uploads with progress tracking, and renders Twitter post previews using the Twitter widgets script.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Header component with app branding, back-to-lobby button for chatroom views, and inline username editing with alphanumeric validation and character limit. Includes avatar picker trigger and displays current user avatar.",
  "frontend/src/components/LoginPrompt.tsx": "Intentional no-op placeholder component that renders nothing, ensuring the app remains anonymous without any authentication requirements.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with avatar, timestamp, reactions, and media embeds (YouTube, Twitch, Twitter, Giphy, images, voice). Supports pinning/unpinning videos, adding/removing emoji reactions, and replying to messages with scroll-to-message functionality.",
  "frontend/src/components/MessageInput.tsx": "Message input component with text area, image upload, Giphy search, and voice recording. Auto-detects YouTube, Twitch, and Twitter URLs in text, displays upload progress, and enforces character limits.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video in an iframe with an unpin button, positioned at the top of the chatroom.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that renders an audio player with waveform visualization, play/pause controls, and a progress slider. Handles audio playback state, duration metadata loading, and ensures only one audio plays at a time across the app.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom React hook that returns a debounced version of a value, delaying updates until the specified delay period has passed without changes.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Custom hook that ensures chatrooms are freshly fetched when the actor becomes ready by purging legacy cache entries and empty arrays, then forcing a refetch. Exposes a recovery-in-progress signal and resets on actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state and identity persistence using @dfinity/auth-client. Provides authentication status, identity object, and login/clear functions to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chatroom and message operations including fetching, searching, creating, updating, and deleting chatrooms and messages. Manages local username/userId generation, query key normalization, and optimistic updates with cache invalidation.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives, CSS custom properties for light/dark theme colors using OKLCH color space, mobile-specific input styles to prevent zoom, and custom styling for voice message player range inputs.",
  "frontend/src/lib/config.ts": "Frontend configuration constants for Giphy API integration, defining the API key and result limit.",
  "frontend/src/lib/formatters.ts": "Utility function that formats numbers into compact notation with k/M/B suffixes (e.g., 1234 -> \"1.2k\").",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API, returning structured GIF data with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for dynamic html2canvas library loading.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses images while preserving quality and orientation, with progress callbacks and fallback to original on failure.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON data and extracts safe preview fields (author, text, image) without DOM snapshotting, with in-flight request deduplication and caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed preview data with validation, expiration (7 days), and versioning.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching logic.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail URLs for YouTube, Twitch (clips/VODs/live), and Twitter/X posts, plus URL type detection.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for managing and deleting chatrooms, protected by password authentication stored in sessionStorage, with filtering and bulk operations.",
  "frontend/src/pages/ChatroomPage.tsx": "Chatroom page component that fetches and displays a specific chatroom by ID, handles loading/error states, increments view count on mount, and renders the ChatArea component when data is available.",
  "frontend/src/pages/LobbyPage.tsx": "Lobby page component that displays a list of chatrooms with client-side search and category filtering, includes a create chatroom dialog, and handles actor connection recovery with loading states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme properties including animations, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata file tracking an existing feature to fix Twitter/X embed overflow in MessageBubble component by adding CSS styling to respect parent container width constraints."
}