{
  "backend/main.mo": "Motoko actor defining chatrooms, messages, users, reactions, and access control with storage integration and role management.",
  "feature_evidence.json": "Feature evidence listing React Query refresh issues, involved files, components, and test mappings.",
  "frontend-file-summaries.txt": "Text file containing prewritten one‑sentence summaries of frontend components, hooks, and pages.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, shared layout, 404 handling, and theme provider for the app.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar selection dialog supporting uploads, Giphy search, trending GIFs, and avatar removal.",
  "frontend/src/components/ChatArea.tsx": "Chat area component handling message fetching, auto‑scrolling, replies, sending messages, and pinned video display.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom card with media thumbnails, live status, and Twitter/Twitch preview fetching.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with fields, media upload, and video/Twitter URL validation.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation, username editing, and avatar selection.",
  "frontend/src/components/LoginPrompt.tsx": "Placeholder component that renders nothing, ensuring no authentication is used.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with reactions, media embedding, pinning, and Twitter widgets.",
  "frontend/src/components/MessageInput.tsx": "Input area for sending messages with support for images, video URLs, Twitter links, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video with unpin controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player component with waveform visualization, playback controls, and synchronized audio state handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Ensures chatrooms are freshly refetched once per actor lifecycle and removes legacy cache entries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login handling, and identity persistence via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines chatroom and messaging react-query hooks with caching, normalization, and local user metadata helpers.",
  "frontend/src/index.css": "Tailwind-based global styles, theme variables, layout rules, and custom UI styling including voice message range inputs.",
  "frontend/src/lib/config.ts": "Exports GIPHY API configuration constants.",
  "frontend/src/lib/formatters.ts": "Provides a compact number formatter converting large numbers into k, M, or B notation.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API and map results into a simplified GIF model with error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder file with no implementation.",
  "frontend/src/lib/imageCompression.ts": "Implements client-side image compression with resizing, quality settings, and progress callbacks, returning a smaller File when beneficial.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file with no implementation.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to build a lightweight preview object with caching and duplicate-request prevention.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed previews with versioning, validation, and expiration rules.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file with no implementation.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file with no implementation.",
  "frontend/src/lib/videoUtils.ts": "Provides utilities to extract IDs from YouTube, Twitch, and Twitter URLs and generate corresponding thumbnail or embed URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page that authenticates via password and allows deletion of chatrooms using react-query with UI feedback and session-based auth state.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a chatroom, handles loading/error states, and increments view count once the chatroom data loads.",
  "frontend/src/pages/LobbyPage.tsx": "Shows chatroom list with search and category filters, manages debounced search, and forces fresh fetches when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the project.",
  "project_state.json": "Describes project state, known issues, and feature requests related to fixing stale React Query chatroom lists."
}