{
  "backend/main.mo": "Actor implementing chatrooms, messages, reactions, profiles, and access control with storage and ordered maps.",
  "feature_evidence.json": "Feature evidence report listing feature entries, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files.",
  "frontend/index.html": "HTML entry point linking root div and main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app with TanStack Router, root layout, routes, and 404 handling.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for viewing, uploading, and removing user avatars with validation and upload handling.",
  "frontend/src/components/ChatArea.tsx": "Chat UI rendering messages, replies, pinned video, auto‑scroll, and send handling.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with dynamic thumbnails for YouTube, Twitch, and Twitter, fetching previews when needed.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with media upload, video URL validation, and optional Twitter embed preview.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Implements the top navigation bar with username editing, avatar selection, and back navigation.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component ensuring no authentication UI is rendered.",
  "frontend/src/components/MessageBubble.tsx": "Renders chat messages with reactions, video embeds, Twitter embeds, voice messages, and pin/reply interactions.",
  "frontend/src/components/MessageInput.tsx": "Handles text entry, media uploads, video/Twitter URL validation, and voice message recording for sending messages.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component with waveform, playback controls, and sync logic to pause other players.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, state, and persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for chatrooms, messages, reactions, and user data with localStorage helpers.",
  "frontend/src/index.css": "Tailwind base styles plus CSS variables for light/dark themes and mobile input adjustments.",
  "frontend/src/lib/formatters.ts": "Utility for compact number formatting into k/M/B representations.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty module placeholder for html2canvas loading logic.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty module placeholder for rendering Twitter embeds.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Utility to fetch, cache, and parse safe preview data from Twitter oEmbed responses.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements localStorage caching for reconstructed Twitter preview objects with validation, versioning, and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for future Twitter thumbnail logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for future Twitter thumbnail caching logic.",
  "frontend/src/lib/videoUtils.ts": "Provides utilities for extracting IDs from YouTube, Twitch, and Twitter URLs and generating corresponding thumbnail or embed URLs.",
  "frontend/src/main.tsx": "Application entry point that initializes React, React Query, and the Internet Identity provider.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads and displays a specific chatroom, handling actor initialization, loading states, errors, and view count incrementing.",
  "frontend/src/pages/LobbyPage.tsx": "Displays the chatroom lobby with search, filtering, and create-chatroom functionality, managing multiple query states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Describes project goals and requirements, focusing on generating reliable Twitter previews using oEmbed and caching."
}