{
  "backend/main.mo": "Main Motoko actor implementing a chatroom application with message storage, user profiles, reactions, access control, blob storage integration, and HTTP outcalls. Includes CRUD operations for chatrooms and messages, active user tracking, and password-protected deletion.",
  "feature_evidence.json": "Feature evidence report documenting three UI changes: progress bar color update in Header, border removal from MessageInput textarea, and logo redesign with rounded background and icon in Header component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing component functionality, styling details, query patterns, and recent changes including character limits, progress bars, and media handling.",
  "frontend/index.html": "HTML entry point with viewport configuration for mobile, cache-busting meta tags, and versioned script import (v=203) to force production refresh.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with lobby, chatroom, and admin routes, conditional header/footer rendering, theme provider, and 404 handling.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component for selecting user avatars via file upload, Giphy search/trending GIFs, or removal, with debounced search and request tracking to prevent stale results.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface with collapsible header, pinned video area, scrollable message list with auto-scroll on new messages, reply functionality, and filtering to hide Creator messages without media.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, message count, and formatted timestamps. Fetches Twitch thumbnails and Twitter oEmbed previews on mount.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog for creating new chatrooms with topic, description, category selection, and media upload (image/video/Twitter) via tabs. Validates YouTube/Twitch URLs, handles image uploads with progress tracking, and loads Twitter widgets for post previews.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "App header with logo, username editing (inline with character limit progress), avatar picker button, and back-to-lobby navigation when in a chatroom.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that renders nothing; authentication is intentionally not used in this anonymous app.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with avatar, timestamp, reactions, pin/unpin controls, reply functionality, and embedded media (YouTube, Twitch, Twitter, images, voice). Loads Twitter widgets for tweet embeds and handles reaction management.",
  "frontend/src/components/MessageInput.tsx": "Message input component with text area, media attachment tabs (image upload, video URL, Twitter URL), voice recording with timer, and validation for different media types. Handles file uploads with progress tracking.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned video (YouTube or Twitch) in an iframe with an unpin button at the top of the chatroom.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that renders an audio player with waveform visualization, play/pause controls, and a progress slider. Handles audio playback state, metadata loading, and ensures only one audio plays at a time across the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that returns a debounced version of a value, delaying updates until the specified delay period has passed without changes.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that ensures chatrooms are freshly fetched when the actor becomes ready by purging legacy cache entries, detecting persisted empty arrays, and forcing a refetch. Exposes a recovery-in-progress signal for loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient. Manages identity state, login status, and persists authentication across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including chatrooms, messages, reactions, user profiles, and voice messages. Handles query normalization, caching strategies, optimistic updates, and localStorage-based user identification.",
  "frontend/src/index.css": "Global CSS with Tailwind directives, CSS custom properties for theming (light/dark mode), mobile-specific input styles to prevent zoom, and custom styling for voice message player range inputs.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants for the Giphy API integration including API key and result limit.",
  "frontend/src/lib/formatters.ts": "Utility function that formats numbers into compact notation (k, M, B) for display purposes, handling both number and bigint types.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API, returning structured GIF data with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for dynamic html2canvas library loading.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses images using canvas, preserving orientation and only returning compressed version if smaller than original.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering functionality.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON data and extracts safe preview fields (author, text, image) without DOM manipulation, with caching and request deduplication.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed preview data with validation, expiration (7 days), and version control.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation functionality.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching functionality.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail URLs for YouTube, Twitch (clips/VODs/streams), and Twitter/X posts, plus URL detection helpers.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for managing chatrooms with password authentication (stored in sessionStorage), displaying chatroom list with filtering and delete functionality.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a chatroom page with loading states, error handling, and view count tracking. Renders ChatArea component once chatroom data is loaded.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page showing a list of chatrooms with search, category filtering, and create dialog. Implements client-side filtering and debounced search.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking three feature requests: changing progress bar color to blue, removing chat input border, and updating header logo with rounded background and icon."
}