{
  "backend/main.mo": "Main canister handling storage mixins, access control setup, and types plus state for chatrooms, messages, users, and reactions.",
  "backend/migration.mo": "Migration module initializing new access control state from an old actor structure.",
  "feature_evidence.json": "Empty feature evidence report JSON.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/index.html": "HTML entry file with cache‑busting meta tags and script versioning for the frontend app.",
  "frontend/src/App.tsx": "Main React app defining routes, layout, 404 handling, and theme provider using TanStack Router.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting avatars via uploads or Giphy search with debounced requests and update handling.",
  "frontend/src/components/ChatArea.tsx": "Chat UI handling message list, auto‑scroll, sending messages, replies, and pinned video display.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media thumbnails, live status, and fetched previews for Twitch and Twitter content.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with fields for topic, media uploads, video URLs, and Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with navigation, username editing, and avatar selection.",
  "frontend/src/components/LoginPrompt.tsx": "Placeholder component that returns nothing since authentication is not used.",
  "frontend/src/components/MessageBubble.tsx": "Renders chat messages with reactions, timestamps, media previews, and tweet embeds.",
  "frontend/src/components/MessageInput.tsx": "Handles message entry, file uploads, video/Twitter URLs, and optional voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with waveform visualization, playback controls, and synced state updates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Forces a fresh chatroom refetch on actor readiness by clearing stale cache and triggering recovery.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and persistent identity handling.",
  "frontend/src/hooks/useQueries.ts": "Defines chatroom and message queries/mutations using the backend actor with local storage helpers.",
  "frontend/src/index.css": "Tailwind base styles, theme variables, mobile fixes, and custom voice message slider styling.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Formats numbers using compact k/M/B notation.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API and map results into a simplified GIF structure.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file.",
  "frontend/src/lib/imageCompression.ts": "Implements client‑side image compression with resizing, quality control, and progress reporting.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to produce safe preview objects with caching and request deduping.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter preview objects with validation and expiration handling.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file.",
  "frontend/src/lib/videoUtils.ts": "Extracts video IDs and thumbnail URLs for YouTube, Twitch, and Twitter and includes URL detection utilities.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider and mounts the root component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin UI for authenticating with a password and viewing or deleting chatrooms using React Query.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, handles loading/error states, increments view count once, and renders ChatArea when data is ready.",
  "frontend/src/pages/LobbyPage.tsx": "Fetches and displays a searchable/filterable list of chatrooms with category filters and a create-dialog toggle.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, anonymization plan, backend payload issues, and pending backend fix requirements for getChatrooms."
}