{
  "backend/main.mo": "Motoko canister managing chatrooms, messages, reactions, user profiles, active users, and role-based access control with admin‑gated deletion.",
  "feature_evidence.json": "Feature evidence report mapping two frontend features to affected files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.html": "Base HTML file loading the React app with cache‑busting settings and viewport meta tags.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, layout with header/footer rules, and theme/toaster providers.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting or uploading avatars, including Giphy search, trending GIFs, and file uploads with debounced search.",
  "frontend/src/components/ChatArea.tsx": "Full chat interface handling message fetching, auto‑scrolling, replies, header collapse, sending messages, and pinned video rendering.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a clickable chatroom card with thumbnail, live badge, topic, category, and viewer/message stats.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with fields, media upload, video/Twitter URL validation, and Twitter embed loading.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with copyright text and a caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Shows the app header with navigation, username editing, and avatar picker integration.",
  "frontend/src/components/LoginPrompt.tsx": "No-op component that renders nothing as authentication is intentionally disabled.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with reactions, media embeds, pinning, replies, and optional Twitter widgets.",
  "frontend/src/components/MessageInput.tsx": "Handles composing messages with text, image upload, video/Twitter URLs, and optional voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "File is empty or incomplete with no implemented logic.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with waveform visualization, playback controls, and synced state handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Purges stale chatroom caches and forces refetch when the backend actor becomes ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching chatrooms, lobby cards, and related data with polling and error handling.",
  "frontend/src/index.css": "Tailwind setup with theme variables, global styles, mobile fixes, and custom audio slider styling.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Formats numbers into compact notation like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty or placeholder module.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression that resizes images, preserves orientation, and returns a smaller file when possible with progress callbacks.",
  "frontend/src/lib/lobbyPlaceholderThumbnails.ts": "Returns static placeholder thumbnail paths based on media type for lobby previews.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file for Twitter embed rendering.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to produce a simplified preview with caching and deduped requests.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed previews with versioning and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for Twitter thumbnail utilities.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for Twitter thumbnail caching.",
  "frontend/src/lib/videoUtils.ts": "Extracts IDs and builds thumbnail URLs for YouTube, Twitch, and Twitter, with URL helpers for type detection.",
  "frontend/src/main.tsx": "Initializes React app with query client and identity provider and mounts the root component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page with password gate allowing authenticated users to view and delete chatrooms.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, increments its view count, handles loading/error states, and renders the chat area.",
  "frontend/src/pages/LobbyPage.tsx": "React page that fetches lobby chatroom summaries, applies client‑side search and category filtering, and renders chatroom cards with create-dialog support and navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, container settings, animations, and plugins.",
  "project_state.json": "Project state metadata describing IC payload-size issues, planned lightweight chatroom summary changes, and related feature requests."
}