{
  "backend/main.mo": "Main Motoko actor implementing a chatroom application with message storage, user profiles, reactions, access control, blob storage for media, and HTTP outcalls for external integrations.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend components, pages, and configuration files describing their functionality and recent changes.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration for mobile, and versioned script tag for the React application.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for lobby, chatroom, archive, and admin pages, plus theme provider and conditional header/footer rendering.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Modal dialog component for selecting user avatars via file upload, Giphy GIF search with trending fallback, or removing current avatar.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface with collapsible header, pinned video display, scrollable message list with auto-scroll, reply functionality, message filtering to hide Creator messages without media, and message input.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, and message count. Handles thumbnail fetching and rendering for different media types with fallback images.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog component for creating new chatrooms with support for uploading images, embedding YouTube/Twitch videos, or Twitter posts. Includes form validation, category selection, media preview, and progress tracking for uploads.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/GifPickerDialog.tsx": "GIF picker interface that integrates with Giphy API to search and display trending GIFs in a scrollable grid. Uses debounced search and handles loading/error states.",
  "frontend/src/components/Header.tsx": "Main navigation header with app branding, username editing functionality, avatar picker, and navigation buttons for lobby/archive views. Includes back button when in chatroom view.",
  "frontend/src/components/LoginPrompt.tsx": "Intentional no-op placeholder component that renders nothing, as the application is designed to work anonymously without authentication.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with support for text, images, GIFs, voice messages, and embedded YouTube/Twitch/Twitter content. Includes reactions, pinning, reply functionality, and message highlighting.",
  "frontend/src/components/MessageInput.tsx": "Message input component with support for text, images, GIFs, voice recording, and automatic detection of YouTube/Twitch/Twitter URLs. Handles file uploads, media validation, and recording state management.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video with an unpin button. Renders embedded iframes for supported video platforms.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component for voice messages with play/pause controls, waveform visualization, progress slider, and playback synchronization to pause other playing audio.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that debounces a value by delaying updates until after a specified delay period has elapsed without changes.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that forces a fresh refetch of chatrooms when the actor becomes ready, purging legacy cache entries and empty arrays to ensure the lobby always loads correctly on first page load.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for chatroom and message operations, including fetching chatrooms (active/archived), messages, user profiles, reactions, and mutations for creating/updating/deleting chatrooms and messages. Manages localStorage for username, userId, and avatar, with helper functions for list conversion and query key normalization.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, mobile-specific input styles to prevent iOS zoom, and custom styling for voice message range inputs with progress indicators.",
  "frontend/src/lib/config.ts": "Frontend configuration constants for Giphy API integration, including API key and result limit.",
  "frontend/src/lib/formatters.ts": "Utility function to format numbers with compact notation (k, M, B) for display purposes.",
  "frontend/src/lib/giphy.ts": "Giphy API integration functions for searching and fetching trending GIFs, returning structured GIF data with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for html2canvas dynamic loading functionality.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and compresses images while preserving orientation, with configurable quality and dimensions, skipping GIFs and SVGs.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering functionality.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON data and extracts safe preview fields (author, text, image) with caching and request deduplication to avoid CORS issues.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "localStorage cache management for Twitter oEmbed preview data with validation, expiration (7 days), and versioning support.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation functionality.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching functionality.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail/embed URLs from YouTube, Twitch, and Twitter/X URLs using regex patterns.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page with password authentication for managing and deleting chatrooms, featuring search, filtering, and bulk deletion capabilities.",
  "frontend/src/pages/ArchivePage.tsx": "Displays archived chatrooms that have been bumped off the lobby in a grid layout with loading and error states.",
  "frontend/src/pages/ChatroomPage.tsx": "Individual chatroom page that loads chatroom data, increments view count, and renders the ChatArea component with error handling.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying all chatrooms with client-side search, category filtering, and create chatroom dialog functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme values, animations, and typography/container-queries plugins.",
  "project_state.json": "Project state tracking removal of all authentication and caller checks from backend and frontend to enable full public/guest access. Contains 5 pending feature requests focused on removing msg.caller verification, access control initialization, and authentication-related logic."
}