{
  "backend/main.mo": "Motoko actor implementing storage, access control, chatrooms, messages, users, and reactions with admin‑protected operations and various data types defined for chat features.",
  "feature_evidence.json": "Feature evidence report mapping UI layout and styling changes to MessageInput.tsx with associated components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all frontend files, including components, hooks, pages, and styles.",
  "frontend/index.html": "Base HTML file that loads the React application via main.tsx and defines viewport settings.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, theme provider, layout with header/footer rules, and 404 handling for lobby, chatroom, and admin pages.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting, uploading, searching, or removing user avatars with Giphy integration and image validation.",
  "frontend/src/components/ChatArea.tsx": "Main chat area handling message list display, auto‑scrolling, replies, pinned video, header collapsing, and sending messages via hooks.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom preview card with media thumbnails, live status, and Twitter/Twitch/YouTube preview fetching.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog for creating chatrooms with fields for metadata and media uploads or links, including Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying app credit and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing app title, username editing, avatar picker, and back navigation.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component that renders nothing and disables authentication.",
  "frontend/src/components/MessageBubble.tsx": "Displays a chat message with reactions, media embeds, Twitter loading, and pin/reply interactions.",
  "frontend/src/components/MessageInput.tsx": "Input box for sending messages with support for images, video URLs, Twitter links, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player component with play/pause, waveform visualization, time tracking, and synced playback control.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains chatroom, search, and message-related React Query hooks with localStorage helpers and image compression.",
  "frontend/src/index.css": "Tailwind base styles, theme variables, dark mode, mobile input fixes, and custom voice message slider styling.",
  "frontend/src/lib/config.ts": "Defines Giphy API key and result limit constants.",
  "frontend/src/lib/formatters.ts": "Formats numbers into compact k/M/B notation.",
  "frontend/src/lib/giphy.ts": "Provides Giphy search and trending fetch functions with error handling and GIF mapping.",
  "frontend/src/lib/html2canvasLoader.ts": "Placeholder file with no implemented logic.",
  "frontend/src/lib/imageCompression.ts": "Client-side utility that loads, resizes, and recompresses images with progress callbacks and returns the smaller of original or compressed output.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file for Twitter embed rendering logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data, extracts safe preview fields, caches results, and deduplicates simultaneous fetches.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "localStorage-backed cache for Twitter preview data with validation, versioning, and expiration support.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file for Twitter thumbnail utilities.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file for caching Twitter thumbnails.",
  "frontend/src/lib/videoUtils.ts": "Parses YouTube, Twitch, and Twitter URLs to extract IDs and generate thumbnails, plus URL-type detection helpers.",
  "frontend/src/main.tsx": "App entry file that mounts React, configures query client, and wraps the app with identity provider.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page requiring a password to view and delete chatrooms, with session-based auth and deletion UI.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, increments its view count, handles loading/error states, and renders the chat area.",
  "frontend/src/pages/LobbyPage.tsx": "Lobby page component that fetches and displays chatrooms with search, category filtering, and create-chatroom dialog logic.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, radius, animations, and plugins such as typography and container queries.",
  "project_state.json": "JSON file describing the project state, existing feature requests, and pending requirements for chatroom input UI changes."
}