{
  "backend/main.mo": "Main backend actor implementing chatroom and messaging functionality with access control, blob storage, user profiles, reactions, and active user tracking using OrderedMaps for data storage.",
  "feature_evidence.json": "Feature evidence report documenting that MessageInput.tsx was updated to pass complete GIF URLs from the Giphy picker instead of just names.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, chat UI, message handling, media support, and user profile management with detailed implementation notes.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration for mobile, and versioned script tag (v=203) to force production refresh.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with lobby, chatroom, and admin routes, conditional header/footer rendering, theme provider, and 404 handling.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component for selecting user avatars via file upload, Giphy search with debounced trending/search results, or removal, with request ID tracking to prevent race conditions.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface with collapsible header, pinned video display, scrollable message list filtering out Creator messages without media, reply functionality, and auto-scroll on new messages.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, message count, and formatted timestamps. Fetches Twitch thumbnails and Twitter oEmbed previews on mount.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog component for creating new chatrooms with topic, description, category selection, and media upload/URL input (YouTube, Twitch, Twitter). Handles image uploads with progress tracking and validates video URLs.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with logo, username editing functionality, avatar picker, and back-to-lobby navigation for chatroom views. Manages username state with character limit and validation.",
  "frontend/src/components/LoginPrompt.tsx": "Intentional no-op placeholder component that renders nothing, with comments explicitly stating authentication is not used in this anonymous application.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with avatar, timestamp, media embeds (YouTube, Twitch, Twitter), voice playback, reactions, pin/unpin functionality, and reply features. Handles emoji reactions and message highlighting.",
  "frontend/src/components/MessageInput.tsx": "Chat input component with text messaging, image upload, Giphy search, voice recording, and auto-detection of YouTube/Twitch/Twitter URLs in message text. Manages upload progress and recording state.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned video (YouTube or Twitch) in an iframe with an unpin button, rendered at the top of the chatroom.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that renders an audio player with waveform visualization, play/pause controls, and a progress slider. Handles audio playback state, metadata loading, and ensures only one audio plays at a time across the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that returns a debounced version of a value, delaying updates until the specified delay period has passed without changes.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Custom hook that ensures chatrooms are freshly fetched when the actor becomes ready by purging stale cache entries (especially empty arrays) and forcing a refetch. Exposes a recovery state flag for UI loading indicators.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flows, identity persistence, and auth client lifecycle. Exports useInternetIdentity hook and InternetIdentityProvider component.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chatroom and message operations (fetching, searching, creating, sending messages, reactions, voice messages). Manages local storage for username/userId and normalizes query keys for proper cache management.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for light/dark themes, mobile-specific input styles to prevent zoom on iOS, and custom styling for voice message player range inputs.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants for Giphy API integration (API key and result limit).",
  "frontend/src/lib/formatters.ts": "Utility function that formats numbers into compact notation with k/M/B suffixes (e.g., 1234 -> '1.2k').",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API, returning structured GIF data with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for dynamic html2canvas library loading.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses images using canvas, preserving orientation and only returning compressed version if smaller than original.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering functionality.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON data and extracts safe preview fields (author, text, image) without DOM manipulation, with request deduplication and caching.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed preview data with validation, expiration (7 days), and versioning.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation functionality.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching functionality.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail URLs for YouTube, Twitch (clips/VODs/streams), and Twitter/X posts, plus URL type detection.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentity providers wrapping the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for managing chatrooms with password authentication (stored in sessionStorage), displaying chatroom list with filtering and deletion capabilities.",
  "frontend/src/pages/ChatroomPage.tsx": "Chatroom page component that fetches chatroom data, increments view count on load, handles loading/error states, and renders the ChatArea component with chatroom details.",
  "frontend/src/pages/LobbyPage.tsx": "Lobby page component that displays a list of chatrooms with search and category filtering, handles chatroom creation dialog, and manages navigation to individual chatrooms.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project state tracking document indicating a fix request to modify GIF handling so that complete animated GIF URLs are stored and rendered as images instead of plain text names."
}