{
  "backend/main.mo": "Motoko actor managing chatrooms, messages, reactions, user profiles, and access control with storage mixins and ordered maps.",
  "feature_evidence.json": "Feature evidence report linking a cache‑busting change in frontend/index.html to its feature ID and involved components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/index.html": "HTML entry point with cache‑busting meta headers and versioned main.tsx script loader.",
  "frontend/src/App.tsx": "React app router setup defining lobby, chatroom, and admin routes with layout logic for header and footer visibility.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker dialog supporting file uploads, Giphy search, and avatar removal with debounced search and request tracking.",
  "frontend/src/components/ChatArea.tsx": "Chat area UI handling message display, auto‑scrolling, replies, pinned video, and sending messages using backend hooks.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom preview card, fetching thumbnails for YouTube, Twitch, and Twitter content and displaying media, status, and metadata.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a modal for creating chatrooms with fields for metadata and media, including upload, video URL validation, and Twitter embed preview.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution text and a link.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation, avatar selection, and inline username editing.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component intentionally rendering nothing.",
  "frontend/src/components/MessageBubble.tsx": "Displays individual chat messages with reactions, media embeds, replies, and optional Twitter widget loading.",
  "frontend/src/components/MessageInput.tsx": "Message composer supporting text, image upload, YouTube/Twitch/Twitter URLs, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Shows a pinned YouTube or Twitch video with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component providing audio playback with waveform visualization, duration tracking, and synchronized pause across multiple players.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook returning a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that forces cleanup and refetching of chatroom data when the actor becomes ready, with bounded recovery for empty caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for chatrooms, messages, and user data, including local helpers and post-create safeguards.",
  "frontend/src/index.css": "Tailwind-based global styles, theme variables, mobile input fixes, and custom voice message slider styling.",
  "frontend/src/lib/config.ts": "Exports GIPHY API configuration constants.",
  "frontend/src/lib/formatters.ts": "Provides a compact number formatting utility (k/M/B).",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy and map API responses into simplified GIF objects.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder file for html2canvas loader logic.",
  "frontend/src/lib/imageCompression.ts": "Implements client-side image compression with resizing, quality control, and progress reporting.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder for Twitter embed rendering utilities.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to extract safe preview fields with caching and request deduplication.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed previews with validation, expiration, and cache key generation.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder for Twitter thumbnail utilities.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder for Twitter thumbnail caching logic.",
  "frontend/src/lib/videoUtils.ts": "Provides utilities for extracting video or post IDs from YouTube, Twitch, and Twitter URLs and generating related thumbnail or embed URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page that authenticates via password and allows deletion and management of chatrooms with React Query data handling.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, handles loading and error states, increments view count once, and renders the ChatArea once data is available.",
  "frontend/src/pages/LobbyPage.tsx": "Displays and filters chatrooms using search and category queries, manages debounced search, handles loading/error states, and provides navigation and create-room UI.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata, issues, and feature requests focused on ensuring production cache-busting for updated lobby behavior."
}