{
  "backend/main.mo": "Motoko actor implementing chatrooms, messages, reactions, user profiles, access control, and blob storage with ordered maps and ID counters.",
  "feature_evidence.json": "Feature evidence report linking a cache-refresh fix to specific source files, components, and tests.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries for various frontend files describing their roles and recent behavior changes.",
  "frontend/index.html": "HTML entry point with cache‑busting meta tags and versioned script load.",
  "frontend/src/App.tsx": "Main React router setup defining lobby, chatroom, and admin routes with conditional header/footer layout.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog for selecting avatars via upload or Giphy search with debounced queries and mutation hooks.",
  "frontend/src/components/ChatArea.tsx": "Chat area handling message list, auto‑scroll, replies, pinned video, and message sending.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with media thumbnails, live status, and fetched Twitch/Twitter previews.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Modal for creating chatrooms with topic, media upload, video/Twitter validation, and category selection.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar providing username editing, avatar selection, and back-to-lobby navigation.",
  "frontend/src/components/LoginPrompt.tsx": "No-op placeholder component intentionally rendering nothing.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with reactions, video/Twitter embeds, replies, and pinning controls.",
  "frontend/src/components/MessageInput.tsx": "Input box for sending messages with support for images, video links, Twitter URLs, and voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video for a chatroom with option to unpin.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player with waveform visualization, play/pause control, time tracking, and synchronization across multiple players.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Ensures chatroom data is freshly refetched when the actor becomes ready, including purging stale or incorrect cache entries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities, handling login, logout, and exposing identity status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chatrooms, messages, and user data with caching rules, normalization, and post-create guards.",
  "frontend/src/index.css": "Tailwind base styles with theme variables, dark mode, mobile input fixes, and custom styles for the voice message player.",
  "frontend/src/lib/config.ts": "Defines frontend configuration constants including the GIPHY API key and result limit.",
  "frontend/src/lib/formatters.ts": "Provides a helper to format numbers using compact notation such as k, M, and B.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from Giphy and map API results into simplified GIF objects.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder file.",
  "frontend/src/lib/imageCompression.ts": "Implements client-side image compression with resizing, quality control, and progress callbacks.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty placeholder file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed data, extracts safe preview fields, and caches/deduplicates concurrent requests.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching of Twitter preview data with validation and expiration handling.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty placeholder file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty placeholder file.",
  "frontend/src/lib/videoUtils.ts": "Provides URL parsers and thumbnail generators for YouTube, Twitch, and Twitter links.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page enabling password-gated access to list and delete chatrooms with refetching and UI controls.",
  "frontend/src/pages/ChatroomPage.tsx": "Fetches and displays a chatroom, handles loading and error states, and increments the room’s view count once loaded.",
  "frontend/src/pages/LobbyPage.tsx": "Displays the chatroom lobby with search, category filtering, debouncing, and guards against empty cached results while handling multiple query states.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and included plugins.",
  "project_state.json": "Project metadata describing current production issue with stale cached chatroom lists and ongoing work to purge or ignore the persisted cache."
}