{
  "backend/main.mo": "Main actor implementing a chatroom application with message storage, user profiles, reactions, access control, blob storage for media, HTTP outcalls, and data migration support. Includes CRUD operations for chatrooms and messages, active user tracking, and admin functions.",
  "backend/migration.mo": "Data migration module that transforms old chatroom records (without lastActivity field) to new chatroom records (with lastActivity field initialized to createdAt), preserving all other actor state.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of displaying last modified timestamps on lobby cards, referencing ChatroomCard.tsx and multiple component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App.tsx (routing), hooks (React Query), Header (navigation/avatar), ChatArea (messages), MessageBubble (individual messages), MessageInput (compose), and LobbyPage (chatroom list).",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration for mobile, and versioned script tag (v=203) to force production refresh.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup for lobby, chatroom, and admin routes, conditional header/footer rendering, theme provider, and 404 handling.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Modal dialog for selecting avatars via file upload, Giphy search with debounced queries, or removal, with trending GIFs shown by default and request ID tracking to prevent race conditions.",
  "frontend/src/components/ChatArea.tsx": "Chat interface with collapsible header (centered on md+ screens), pinned video area, scrollable messages with auto-scroll on new messages, reply preview, message filtering (hides Creator messages without media), and category badge display.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, message count, and formatted timestamps. Fetches Twitch thumbnails and Twitter oEmbed previews on mount.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog component for creating chatrooms with topic, description, category selection, and media upload/URL input (YouTube, Twitch, Twitter). Handles image uploads with progress tracking, video URL validation, and Twitter embed previews.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "App header with logo, username editing (alphanumeric validation, 15 char limit), avatar picker, and back-to-lobby button for chatroom views. Manages username state and navigation.",
  "frontend/src/components/LoginPrompt.tsx": "Intentional no-op placeholder component; authentication is explicitly not used in this anonymous application.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with avatar, timestamp, reactions, pin/unpin functionality, reply support, and embedded media (YouTube, Twitch, Twitter, Giphy, voice messages). Handles reaction management and Twitter widget loading.",
  "frontend/src/components/MessageInput.tsx": "Chat input component supporting text messages (2000 char limit), image uploads with progress, Giphy GIF search, voice recording, and auto-detection of YouTube/Twitch/Twitter URLs in message text.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video in an iframe with an unpin button, positioned at the top of the chatroom.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React component that renders an audio player with waveform visualization, play/pause controls, and a progress slider for voice messages. Handles audio playback state, duration tracking, and ensures only one audio plays at a time across the app.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom React hook that debounces a value by delaying updates until a specified delay period has passed without changes. Returns the debounced value with a default delay of 300ms.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Custom React hook that ensures chatroom data is freshly fetched when the actor becomes ready by purging stale cache entries (especially empty arrays) and forcing a refetch. Exposes a recovery state flag and resets on actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and auth client lifecycle. Provides identity state, login status, and authentication methods to child components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for chatroom operations including fetching, searching, filtering by category, creating, joining, leaving, and managing messages with reactions. Handles username generation, localStorage persistence, and query key normalization.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for light/dark themes, mobile-optimized viewport handling, and custom styling for voice message player range inputs. Includes iOS-specific input font-size fixes to prevent zoom.",
  "frontend/src/lib/config.ts": "Frontend configuration file exporting Giphy API key and result limit constants for GIF integration.",
  "frontend/src/lib/formatters.ts": "Utility function that formats numbers into compact notation (k, M, B) for display, handling both number and bigint types.",
  "frontend/src/lib/giphy.ts": "Provides functions to search and fetch trending GIFs from the Giphy API, returning structured GIF data with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for dynamic html2canvas library loading.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses images using canvas, preserving orientation and only returning compressed version if smaller than original.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON data and extracts safe preview fields (author, text, image) without DOM manipulation, with caching and request deduplication.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed preview data with validation, expiration (7 days), and versioning.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching logic.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail URLs for YouTube, Twitch (clips/VODs/live), and Twitter/X posts, plus URL detection helpers.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for managing chatrooms with password authentication (stored in sessionStorage), displaying chatroom list with filtering and delete functionality.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a single chatroom with loading states, error handling, and increments view count on mount. Renders ChatArea component when chatroom data is loaded.",
  "frontend/src/pages/LobbyPage.tsx": "Displays a list of chatrooms with search, category filtering, and algorithmic sorting (live rooms first, then by view count, then by creation date). Includes create chatroom dialog and client-side filtering.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking feature requests to update lobby card timestamps to show last activity time from messages or reactions, with backend Chatroom type updates needed."
}