{
  "backend/main.mo": "Motoko backend actor handling access control, chatrooms, messages, users, and reactions with ordered maps and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing feature definitions, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all frontend files.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React app root configuring TanStack Router routes, layout, 404 handling, and theme provider.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar picker dialog supporting uploads, Giphy search, and avatar updates with debounced requests.",
  "frontend/src/components/ChatArea.tsx": "Chat area handling message display, auto-scroll, replies, pinned video, and message sending logic.",
  "frontend/src/components/ChatroomCard.tsx": "No summary available.",
  "frontend/src/components/CreateChatroomDialog.tsx": "No summary available.",
  "frontend/src/components/Footer.tsx": "No summary available.",
  "frontend/src/components/Header.tsx": "No summary available.",
  "frontend/src/components/LoginPrompt.tsx": "No summary available.",
  "frontend/src/components/MessageBubble.tsx": "No summary available.",
  "frontend/src/components/MessageInput.tsx": "No summary available.",
  "frontend/src/components/PinnedVideo.tsx": "No summary available.",
  "frontend/src/components/ProfileSetupModal.tsx": "No summary available.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio player component with waveform visualization, playback controls, and metadata handling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook that returns a debounced version of a value after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication state and login workflow.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for chatrooms, messages, and reactions with helpers for user identity and data conversion.",
  "frontend/src/index.css": "Tailwind base styles plus CSS variables, dark mode, mobile input tweaks, and custom audio slider styling.",
  "frontend/src/lib/config.ts": "Exports Giphy API configuration constants.",
  "frontend/src/lib/formatters.ts": "Provides utility to format numbers using compact notation like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Utilities for searching and fetching trending GIFs from the Giphy API with error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty placeholder file for html2canvas loading logic.",
  "frontend/src/lib/imageCompression.ts": "Provides client-side image compression with resizing, quality control, and safe fallbacks if compression fails.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to build lightweight tweet previews with caching and request deduplication.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements localStorage-based caching for Twitter oEmbed previews with validation, versioning, and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/videoUtils.ts": "Offers utilities to extract IDs from YouTube, Twitch, and Twitter URLs and generate corresponding thumbnail or embed URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider before rendering the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page requiring a password to view, delete, and reset chatrooms using query hooks and UI components.",
  "frontend/src/pages/ChatroomPage.tsx": "Loads a chatroom by ID, increments its view count, handles loading/error states, and renders the ChatArea.",
  "frontend/src/pages/LobbyPage.tsx": "React lobby page that lists chatrooms with search, category filtering, loading/error states, and navigation into individual chatrooms.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugin usage.",
  "project_state.json": "Project state file describing current features, requirements, and pending requests for adding an admin reset-all-data function."
}