{
  "backend/main.mo": "Main backend actor implementing chatroom functionality with message storage, user profiles, reactions, image storage via blob-storage, access control, and HTTP outcalls. Includes CRUD operations for chatrooms, messages, reactions, view tracking, and admin functions with password protection.",
  "feature_evidence.json": "Feature evidence report documenting the restoration of image and GIF display functionality in MessageBubble.tsx using the working approach from draft version 261.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, query hooks, UI components for chat, messages, avatars, and pages with details on image/GIF handling, reply functionality, and responsive design.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration for mobile support, and versioned script tag (v=203) to force production refresh.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with lobby, chatroom, and admin routes, conditional header/footer rendering, theme provider, and 404 handling.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Dialog component for avatar selection supporting file upload, Giphy GIF search with debounced queries, trending GIFs, and avatar removal with request ID tracking to prevent race conditions.",
  "frontend/src/components/ChatArea.tsx": "Main chat interface with collapsible header, pinned video area, scrollable message list filtering out Creator messages without media (checking mediaUrl, imageId, giphyUrl), auto-scroll on new messages, reply preview, and message input integration.",
  "frontend/src/components/ChatroomCard.tsx": "Displays a chatroom card with thumbnail previews for YouTube, Twitch, and Twitter media, showing live status, participant count, message count, and timestamp. Fetches Twitch thumbnails and Twitter oEmbed previews on mount.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Dialog component for creating new chatrooms with topic, description, category, and media options (image upload, YouTube/Twitch video URLs, or Twitter posts). Validates video URLs, handles image uploads with progress tracking, and renders Twitter embed previews.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "App header with logo, username editing functionality, avatar picker button, and back-to-lobby navigation when in a chatroom. Displays character count progress bar during username editing.",
  "frontend/src/components/LoginPrompt.tsx": "Intentional no-op placeholder component that renders nothing, as the app is designed to work anonymously without authentication.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with support for text, images, voice messages, YouTube/Twitch/Twitter embeds, reactions, pinning, and reply functionality. Handles reaction management and displays referenced messages when replying.",
  "frontend/src/components/MessageInput.tsx": "Chat input component supporting text messages, image uploads with compression, voice recording, GIF selection via Giphy API, and link preview detection. Includes character limit enforcement and upload progress tracking.",
  "frontend/src/components/MessageInputLinkPreview.tsx": "Displays preview cards for YouTube, Twitch, and Twitter links in message input, fetching Twitter oEmbed data and showing thumbnails/metadata for each platform.",
  "frontend/src/components/PinnedVideo.tsx": "Renders a pinned video player with YouTube or Twitch embeds and provides an unpin button to remove the pinned video from a chatroom.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component with waveform visualization, play/pause controls, and time slider for voice messages, ensuring only one audio plays at a time.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that debounces a value by delaying updates until a specified delay period has passed without changes.",
  "frontend/src/hooks/useDetectLinksInText.ts": "Hook that extracts and identifies the first YouTube, Twitch, or Twitter URL from text input using regex pattern matching.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Hook that purges stale chatroom cache entries and forces a fresh refetch when the actor becomes ready, preventing persisted empty arrays from blocking lobby display.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validation using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chatroom operations (fetching, creating, joining, leaving, sending messages, reactions, replies) and includes helpers for user ID/username management, image upload with compression, and localStorage-based blob storage.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, mobile-specific input styles to prevent zoom on iOS, and custom styling for voice message range inputs.",
  "frontend/src/lib/config.ts": "Exports frontend configuration constants for Giphy API integration (API key and result limit).",
  "frontend/src/lib/formatters.ts": "Provides a utility function to format numbers with compact notation (k, M, B) for display purposes.",
  "frontend/src/lib/giphy.ts": "Implements Giphy API integration with functions to search GIFs and fetch trending GIFs, returning structured results with preview and original URLs.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file, likely a placeholder for dynamic html2canvas library loading.",
  "frontend/src/lib/imageCompression.ts": "Client-side image compression utility that resizes and recompresses images using canvas while preserving orientation, with configurable quality and dimensions, and progress callback support.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file, likely a placeholder for Twitter embed rendering functionality.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches Twitter oEmbed JSON data and extracts safe preview fields (author, text, image) with caching and request deduplication to avoid CORS issues.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Manages localStorage caching for Twitter oEmbed preview data with validation, versioning, and 7-day expiration to reduce API calls.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file, likely a placeholder for Twitter thumbnail generation functionality.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file, likely a placeholder for Twitter thumbnail caching functionality.",
  "frontend/src/lib/urlExtractor.ts": "Extracts the first supported URL (YouTube, Twitch, or Twitter) from text strings and returns the URL with its type for embed handling.",
  "frontend/src/lib/videoUtils.ts": "Utility functions for extracting video IDs and generating thumbnail URLs from YouTube, Twitch, and Twitter/X URLs, including embed URL generation with proper parent parameters.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page with password authentication for viewing and deleting chatrooms, featuring category filtering and a table view of all chatrooms.",
  "frontend/src/pages/ChatroomPage.tsx": "Individual chatroom page that loads chatroom data, increments view count on mount, and renders the ChatArea component with loading and error states.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page displaying all chatrooms with client-side search and category filtering, create chatroom dialog, and navigation to individual chatrooms.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme values for UI components, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document indicating a fix request to restore image and GIF display functionality in MessageBubble.tsx using blob.getDirectURL() and giphyUrl fields."
}