{
  "backend/main.mo": "Main Motoko canister implementing chatrooms, messages, reactions, profiles, access control, and blob storage integration.",
  "feature_evidence.json": "Feature evidence report describing avatar-flow compatibility requirements and related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files used as reference for build planning.",
  "frontend/index.html": "Base HTML entry point loading the React application via /src/main.tsx.",
  "frontend/src/App.tsx": "React app root with TanStack Router routes for lobby, chatroom, and admin pages plus shared layout with header/footer rules.",
  "frontend/src/components/AvatarPickerDialog.tsx": "Avatar selection dialog supporting local uploads and Giphy search with debounced requests and update-avatar mutation.",
  "frontend/src/components/ChatArea.tsx": "Main chat area handling message lists, auto-scroll, replies, pinned video, and message sending logic.",
  "frontend/src/components/ChatroomCard.tsx": "Renders a chatroom preview card with media thumbnails, live status indicators, and optional Twitter/Twitch previews.",
  "frontend/src/components/CreateChatroomDialog.tsx": "Provides a dialog for creating chatrooms with topic, description, category, and media upload or URL input including Twitter embeds.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with navigation, username editing, and avatar selection.",
  "frontend/src/components/LoginPrompt.tsx": "Placeholder component that renders nothing because the app uses no authentication.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with reactions, media embeds, replies, and optional voice playback.",
  "frontend/src/components/MessageInput.tsx": "Handles composing messages with text, images, video URLs, Twitter links, and optional voice recording.",
  "frontend/src/components/PinnedVideo.tsx": "Displays a pinned YouTube or Twitch video in a chatroom with an option to unpin it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implemented content.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "React audio message player with waveform visualization, playback controls, timing updates, and synchronization across multiple audio elements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts": "Forces a one-time fresh chatroom refetch when the actor becomes ready and cleans legacy cache entries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading identities, handling login/logout, and exposing authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines chatroom, search, and message-related queries and mutations, including username/ID handling and transient state guards.",
  "frontend/src/index.css": "Tailwind base styling, theme variables, dark mode, mobile input tweaks, and custom styles for the voice message slider.",
  "frontend/src/lib/config.ts": "Defines frontend configuration constants for Giphy API usage.",
  "frontend/src/lib/formatters.ts": "Formats numbers into compact notation like k, M, and B.",
  "frontend/src/lib/giphy.ts": "Provides functions to search Giphy and fetch trending GIFs, mapping API responses into simplified GIF objects with error handling.",
  "frontend/src/lib/html2canvasLoader.ts": "Empty file.",
  "frontend/src/lib/imageCompression.ts": "Implements client‑side image compression with resizing, quality control, progress callbacks, and fallback to original on failure.",
  "frontend/src/lib/twitterEmbedRenderer.ts": "Empty file.",
  "frontend/src/lib/twitterOEmbedPreview.ts": "Fetches and parses Twitter oEmbed data to extract safe preview fields with caching and deduped requests.",
  "frontend/src/lib/twitterOEmbedPreviewCache.ts": "Implements localStorage caching for Twitter oEmbed previews with validation, versioning, and expiration.",
  "frontend/src/lib/twitterThumbnail.ts": "Empty file.",
  "frontend/src/lib/twitterThumbnailCache.ts": "Empty file.",
  "frontend/src/lib/videoUtils.ts": "Provides utilities for extracting IDs from YouTube, Twitch, and Twitter URLs and generating related thumbnail URLs.",
  "frontend/src/main.tsx": "Renders the React app root with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminDeleteChatroomsPage.tsx": "Admin page for authenticating with a password and managing chatrooms, including refetching and deleting via React Query.",
  "frontend/src/pages/ChatroomPage.tsx": "Displays a chatroom, handles loading and error states, and triggers view count increment when the chatroom loads.",
  "frontend/src/pages/LobbyPage.tsx": "Shows the chatroom lobby with search, category filters, and chatroom creation, selecting data from multiple queries based on user input.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, feature definitions, and pending requests related to removing authorization checks for avatar uploads."
}