{
  "kind": "build_request",
  "title": "Center collapsed chatroom header content on desktop",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "In desktop layouts (md breakpoint and up), update the collapsed state of the chatroom header in `frontend/src/components/ChatArea.tsx` so that the header’s inner content is centered horizontally when collapsed, matching the centered alignment used in the expanded state. Keep the existing mobile (small screen) collapsed layout behavior intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "in desktop mode, the content in the collapsible container needs to be centered when in a collapsed state just like it is when its now collapsed. does that make sense? --- please confirm you understand. dont code yet",
          "ok do it then"
        ]
      },
      "acceptanceCriteria": [
        "When the header is collapsed and the viewport is md or larger, the collapsed header content (topic + LIVE badge if present + counts + expand button) is visually centered horizontally within the header bar (not left-aligned with extra space to the right).",
        "When the header is collapsed on small screens (below md), the current collapsed header layout and spacing behavior remain unchanged.",
        "Expanded header layout remains unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not modify any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change backend logic or data models.",
    "Do not change what content appears in the header (only adjust alignment/centering in collapsed desktop layout)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}