{
  "kind": "build_request",
  "title": "Update LIVE tag: remove user count text and adjust lobby padding",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the numeric live user count from the LIVE tag displayed on lobby chatroom cards, so the badge text shows only \"LIVE\" while keeping the pulsing dot indicator.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove the count from the live tag (in both the lobby and chatroom page)"
        ]
      },
      "acceptanceCriteria": [
        "In the lobby (chatroom cards), when a room is live, the LIVE badge text renders as \"LIVE\" with no preceding number.",
        "The pulsing dot indicator remains visible on the LIVE badge.",
        "No other lobby card counts/metadata (e.g., the connected/users row) are removed or altered."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the lobby only, change the LIVE tag styling so its top and bottom padding is exactly 0.125rem (Tailwind: py-0.5), without changing its left/right padding.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make the padding for the top and bottom padding for the live tag .125rem (in the lobby)"
        ]
      },
      "acceptanceCriteria": [
        "Lobby LIVE badge uses top/bottom padding equivalent to 0.125rem (e.g., Tailwind class py-0.5).",
        "Left/right padding stays the same as before (e.g., px-2 remains unchanged).",
        "Visual change applies only to the lobby LIVE badge, not the chatroom page LIVE badge."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove the numeric live user count from the LIVE tag displayed in the chatroom page header, so the badge text shows only \"LIVE\" while keeping the pulsing dot indicator.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove the count from the live tag (in both the lobby and chatroom page)"
        ]
      },
      "acceptanceCriteria": [
        "In the chatroom page header, when a room is live, the LIVE badge text renders as \"LIVE\" with no preceding number.",
        "The pulsing dot indicator remains visible on the LIVE badge.",
        "The separate \"connected\" indicator and its numeric count remain unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI primitives); compose them as-is.",
    "Do not add authentication, identity gating, or login prompts; the app must remain fully anonymous."
  ],
  "nonGoals": [
    "Do not change how active/connected user counts are calculated or refreshed.",
    "Do not remove or alter the connected user count display outside of the LIVE badge text.",
    "Do not redesign the lobby or chatroom layouts beyond the specified LIVE badge text/padding changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}