{
  "kind": "build_request",
  "title": "Make chatroom media optional during room creation (single media type)",
  "projectName": "Anon Media Chat",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Update the room creation UI so a chatroom can be created with no media attached (no image upload, no video URL, and no Twitter/X URL), while keeping the media input fields/tabs visible at all times and still allowing only one media type when used.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3",
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "All media types optional",
          "1. Visible 2. One, but optional",
          "Can you just do the optional media part first",
          "Build now",
          "Don’t make any additional changes. Keep everything exactly as is"
        ]
      },
      "acceptanceCriteria": [
        "In CreateChatroomDialog, the Image/Video/Twitter tabs remain visible even if the user does not attach media.",
        "The form can be submitted successfully when topic/description/category are filled and no media is provided.",
        "No validation error is shown solely because the media URL/file is empty (errors only appear when the user provides a media value that is invalid).",
        "When media is provided, only one media type is submitted (as before) and existing validations for the chosen media type still apply."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update backend chatroom creation to allow empty media (no mediaUrl/mediaType) without trapping, while keeping the existing public function signatures unchanged.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-4"
        ],
        "quotes": [
          "All media types optional",
          "One, but optional",
          "Can you just do the optional media part first"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo createChatroom(...) no longer traps when mediaUrl is an empty string.",
        "If mediaUrl is empty, createChatroom does not call media URL validation, and the created chatroom stores empty mediaUrl/mediaType strings (or equivalent existing representation without changing types).",
        "If mediaUrl is empty, the initial message created for the room does not include mediaUrl/mediaType (they are null/absent in the Message record).",
        "All existing public method names and parameter/return types remain unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not implement the image-room thumbnail fix in this build step (optional media change only).",
    "Do not make additional product changes beyond making chatroom media optional; keep existing behavior the same wherever not required by this change.",
    "Do not edit any frontend files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Fixing thumbnails for image-created rooms not displaying.",
    "Backend anonymization work (removing AccessControl, caller/principal checks).",
    "Changing getChatrooms payload sizing behavior beyond what already exists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}