{
  "kind": "build_request",
  "title": "Force production cache-bust so the latest lobby bundle is served",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a deterministic cache-busting change in `frontend/index.html` so production clients/CDNs fetch the newest frontend bundle instead of a stale cached copy, ensuring the lobby’s corrected first-load behavior (rooms visible with no category selected) is what users receive.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "It’s still not working after that change. Why? Don’t code yet",
          "Do you want me to force a CDN‑cache‑busting change so production definitely picks up the corrected filtering logic?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/index.html` changes the module script URL in a way that forces a fresh fetch (e.g., adds a version query string to `/src/main.tsx`), without breaking the app load.",
        "`frontend/index.html` includes no-cache meta directives to discourage browser caching (e.g., Cache-Control/Pragma/Expires equivalents) while remaining valid HTML.",
        "After deployment, a hard refresh shows the lobby renders chatrooms on first load with no category selected (i.e., it does not start in category-filter mode).",
        "The cache-busting version value is easy to increment for future forced refreshes (single, obvious place to change in `frontend/index.html`)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`, or any other frontend immutable paths.",
    "Keep the architecture as a single Motoko actor; no new backend canisters/services.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not redesign the lobby category/search filtering logic (this request is only to force cache-busting so production serves the already-correct logic).",
    "Do not add new authentication mechanisms or third-party auth providers.",
    "Do not introduce new backend persistence/schema changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}