{
  "kind": "build_request",
  "title": "Fix non-functional Giphy GIF search in AvatarPickerDialog",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Giphy search trigger in `frontend/src/components/AvatarPickerDialog.tsx` so that searching runs when the debounced search term changes (replace the incorrect `useState(() => { ... })` side-effect usage with a proper `useEffect` tied to `debouncedSearchTerm`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "gifs are still not working yet. why? it only has a search bar but it doesnt work.",
          "ok fix it"
        ]
      },
      "acceptanceCriteria": [
        "Typing into the Giphy search input triggers a network request to Giphy after the existing debounce delay and updates results.",
        "Clearing the search input clears `giphyResults`, clears `giphyError`, and does not perform a Giphy request.",
        "The existing AvatarPickerDialog UI layout and styling (Tailwind classes/structure) remain unchanged aside from any minimal changes required to wire the effect correctly."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Prevent stale or out-of-order Giphy responses from overwriting newer search results in `AvatarPickerDialog` (e.g., ensure only the latest debounced search updates `giphyResults`/`giphyError`, and avoid setting state after the component unmounts).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "it only has a search bar but it doesnt work.",
          "ok fix it"
        ]
      },
      "acceptanceCriteria": [
        "If the user types quickly and multiple searches are in-flight, the UI ends up showing results for the most recent debounced term (no older request overwrites newer results).",
        "No React warnings occur for state updates on an unmounted component when closing the dialog during/after a search."
      ]
    }
  ],
  "constraints": [
    "Do not modify backend canister code for this fix; Giphy requests must remain frontend-only.",
    "Do not introduce any unintended style/layout changes to the existing avatar picker UI (functional fix only).",
    "Do not edit files under `frontend/src/components/ui` or any other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Changing or redesigning the AvatarPickerDialog UI/UX beyond what is required to make search functional.",
    "Adding new authentication mechanisms or backend proxying for the Giphy API.",
    "Adding new avatar-related features beyond fixing the existing search behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}