{
  "kind": "build_request",
  "title": "Fix lobby/admin chatrooms list not appearing until category filter click (React Query inactive base query)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update all React Query `refetchQueries` calls that target the base chatrooms query `['chatrooms']` to refetch even when the query is not currently observed by changing `type: 'active'` to `type: 'all'` (or equivalent behavior that refetches inactive queries), so the unfiltered lobby list loads on initial page entry without requiring any category filter interaction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Old rooms in the live site, including new rooms that are freshly created, are still not showing up unless you click on a category filter.",
          "I can fix this by changing the base lobby query so it is always considered active... That means switching from: type: 'active' to: type: 'all'",
          "Ok do it"
        ]
      },
      "acceptanceCriteria": [
        "On the live site, navigating to the Lobby page shows the unfiltered rooms list on initial load without clicking any category filter.",
        "Clearing filters in the Lobby page triggers a refetch of `['chatrooms']` even if that query was not currently active/observed.",
        "After creating a new chatroom, the Lobby page’s unfiltered list updates promptly without requiring filter clicks or other user interaction.",
        "After deleting a chatroom (admin flow), the unfiltered list updates promptly without requiring filter clicks or other user interaction."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply the same `['chatrooms']` refetch fix to the admin delete-chatrooms flow so the chatroom list is populated immediately after authentication and on mount even if the base chatrooms query is currently inactive (update any `refetchQueries({ queryKey: ['chatrooms'], exact: true, type: 'active' })` usage accordingly).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "rooms aren't showing up on the live site unless I click on a category filter. The last fix we tried did not work.",
          "Ok do it"
        ]
      },
      "acceptanceCriteria": [
        "After entering the correct admin password on `/admin/delete-chatrooms`, the page displays the full chatroom list immediately (no category click required).",
        "If the admin page detects an empty cached `['chatrooms']` result on mount, it forces a refetch that succeeds even when the query is inactive/unobserved."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the one-time actor-ready refetch logic to ensure it refetches the canonical `['chatrooms']` query even when it is inactive/unobserved, so the initial lobby/admin experience is not dependent on user interaction to activate the query.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Your base query ['chatrooms'] is NEVER being marked as “active” on the live site.",
          "Ok do it"
        ]
      },
      "acceptanceCriteria": [
        "When the actor becomes ready, the app triggers a guaranteed refresh of `['chatrooms']` even if the query is not currently observed.",
        "No regression: filtered chatroom queries (search/category) continue to work as before."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Keep the backend (Motoko) unchanged unless it is proven necessary for this React Query refetch issue."
  ],
  "nonGoals": [
    "Do not add functionality to delete or purge old rooms as a workaround.",
    "Do not introduce new authentication providers or non-Internet-Computer backend services.",
    "Do not redesign the lobby UI beyond what is required to fix the loading/refetch behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}