{
  "kind": "build_request",
  "title": "Fix lobby initial rooms list by purging persisted ['chatrooms'] React Query cache",
  "projectName": "Caffeine Chats",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the lobby shows rooms on initial load in production even when React Query hydrates a persisted cached empty array for the canonical query key ['chatrooms'] by purging/ignoring that hydrated empty result and forcing a fresh refetch before rendering an empty-state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The live site is still not displaying rooms unless searched or a category is selected.",
          "What does the code look like"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh page load in production (with an existing persisted React Query cache entry where ['chatrooms'] data is []), the lobby renders the rooms list without requiring the user to search or select a category.",
        "The lobby does not render the \"No chats found yet\" empty-state solely due to a hydrated persisted empty array for ['chatrooms']; it shows a loading state until a network refetch completes or a real empty result is confirmed.",
        "The fix targets only the canonical rooms list query key ['chatrooms'] (and any known legacy empty-filter variants) and does not break search or category filtering behavior.",
        "A fresh refetch of ['chatrooms'] is triggered on initial load/actor-ready even if the query is inactive at the moment of refetch."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Provide the exact code change (diff-style or full file content) that will be applied to implement the persisted-cache purge/ignore behavior, so the user can review what it looks like before deployment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "What does the code look like"
        ]
      },
      "acceptanceCriteria": [
        "The response includes the concrete code snippet(s) that will be added/modified (not just a description).",
        "Any user-facing strings shown in the snippet(s) are in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutablePaths, including frontend/src/main.tsx; implement the startup/purge behavior via non-immutable files (e.g., App.tsx, LobbyPage.tsx, or new modules/hooks/components).",
    "Backend must remain single-actor; no backend changes are required for this cache-purge fix."
  ],
  "nonGoals": [
    "Implementing new authentication methods beyond Internet Identity.",
    "Adding new product features unrelated to fixing the initial lobby rooms list display.",
    "Introducing external databases or third-party persistence services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}