{
  "kind": "build_request",
  "title": "Refactor lobby to use a single canonical chatrooms query with client-side filtering",
  "projectName": "Caffeine Chats",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Refactor the Lobby page to fetch chatrooms only from the canonical base React Query key ['chatrooms'] (useGetChatrooms) and remove usage of separate search/category React Query queries for the lobby view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ok let’s try it"
        ]
      },
      "acceptanceCriteria": [
        "LobbyPage no longer imports or calls useSearchChatrooms or useFilterChatroomsByCategory.",
        "Only the ['chatrooms'] query is responsible for network fetching of the chatroom list shown in the lobby.",
        "On a fresh load of the live site, chatrooms render without requiring the user to click any category filter first."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement category and search filtering purely client-side in the Lobby page by filtering the base chatroom array in-memory using (a) the debounced search term and (b) the selected category state, without creating new React Query cache keys.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ok let’s try it"
        ]
      },
      "acceptanceCriteria": [
        "Typing in the search box filters the visible chatrooms list based on the base data set (e.g., topic/description/category text matching), without triggering any additional React Query chatroom queries.",
        "Clicking a category badge filters the visible chatrooms list based on the base data set, without triggering any additional React Query chatroom queries.",
        "Clearing filters returns the visible list to the full base chatroom list immediately, without relying on reading cached filtered query results."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Preserve the existing recovery/loading behavior that uses useForceFreshChatroomsOnActorReady (isRecovering) and ensure the lobby renders based only on the post-recovery canonical ['chatrooms'] query result (no fallback to cached filtered arrays).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ok let’s try it"
        ]
      },
      "acceptanceCriteria": [
        "LobbyPage still uses isRecovering to gate initial render while the recovery sequence is in progress.",
        "After recovery completes, the lobby uses only the current ['chatrooms'] query data as the source of truth for rendering and for client-side filtering.",
        "If the base query returns an empty array, the lobby shows the existing empty-state UI (and does not replace it with any other cached chatroom arrays)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only and must be composed).",
    "Do not modify frontend immutable hook paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Do not add new backend canisters or services; backend remains a single Motoko actor.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not change or remove backend endpoints like searchChatrooms or filterChatroomsByCategory; they may remain for future use even if the lobby no longer uses them.",
    "Do not implement server-side filtering changes or new backend data models.",
    "Do not add new authentication providers (Internet Identity only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}