{
  "kind": "build_request",
  "title": "Tighten chatroom header stat gaps and reposition LIVE badge",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Update the chatroom header stats row in `frontend/src/components/ChatArea.tsx` so the horizontal gap between the message/reply count, view count, and category badge is 0.5rem (instead of 1rem).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "can you make the gap for the replies views and category tag .5 rem instead of 1 rem."
        ]
      },
      "acceptanceCriteria": [
        "In `ChatArea.tsx`, the container that lays out message/reply count, view count, and category badge uses a 0.5rem horizontal gap (e.g., Tailwind `gap-2`).",
        "Visual verification: the spacing between the message/reply count group and view count group is 0.5rem.",
        "Visual verification: the spacing between the view count group and the category badge (when present) is 0.5rem."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Move the LIVE indicator in `frontend/src/components/ChatArea.tsx` so it appears to the right of the category badge in the same stats row, and ensure the horizontal gap between the category badge and the LIVE indicator is 0.5rem.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "can you also move live tag to be to the right of the category tag. make the gap for that also .5rem"
        ]
      },
      "acceptanceCriteria": [
        "When `chatroom.isLive` is true and `chatroom.category` is present, the LIVE indicator renders immediately to the right of the category badge in the stats row.",
        "The horizontal gap between the category badge and the LIVE indicator is 0.5rem.",
        "When `chatroom.category` is not present and `chatroom.isLive` is true, the LIVE indicator still renders in the stats row to the right of the existing stats items with consistent 0.5rem spacing."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (compose existing Shadcn components only).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`).",
    "Backend canister code and data model must remain unchanged for this layout-only update."
  ],
  "nonGoals": [
    "Do not change chatroom view-count/message-count logic or polling behavior.",
    "Do not redesign the header beyond the requested spacing and LIVE badge placement."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}