{
  "kind": "build_request",
  "title": "Automatically delete chatrooms older than 5 minutes (including existing rooms)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement automatic backend cleanup so that any chatroom with createdAt older than 5 minutes is deleted, including all existing rooms present at rollout.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "lets make it so rooms older than 5 minutes are automatically deleted. including all existing rooms"
        ]
      },
      "acceptanceCriteria": [
        "A room is considered expired when Time.now() - chatroom.createdAt > 5 minutes (300 seconds).",
        "Expired rooms are removed from backend state (chatrooms, messages, activeUsers, and any reactions associated with messages in that room).",
        "Existing rooms that are already older than 5 minutes are deleted automatically without requiring an admin action.",
        "After cleanup, getChatrooms() and getLobbyChatroomCards() do not return expired rooms.",
        "After cleanup, getChatroom(roomId) returns null for an expired/deleted roomId."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure room expiration is enforced even if a scheduled cleanup has not run yet by filtering out expired chatrooms from read APIs (e.g., lobby/chatroom list and single chatroom fetch) and triggering cleanup during normal canister activity.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "rooms older than 5 minutes are automatically deleted"
        ]
      },
      "acceptanceCriteria": [
        "Read APIs never return a chatroom older than 5 minutes, even if it still exists in memory prior to the next cleanup pass.",
        "Creating a room does not delete it before 5 minutes have elapsed.",
        "Expired rooms are eventually physically removed from all related maps as part of a cleanup pass triggered by normal canister activity (e.g., on calls/heartbeat)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend to handle rooms disappearing due to expiry gracefully (no crashes; show existing not-found/removed state when a user is viewing a room that gets deleted).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "automatically deleted"
        ]
      },
      "acceptanceCriteria": [
        "If a user is on a chatroom page and the backend returns null (room expired/removed), the UI shows the existing “Chat Not Found” state with a way back to the Lobby.",
        "The Lobby list updates normally as rooms expire (rooms disappear on the next refresh interval) without requiring a manual page reload."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if a state/schema upgrade is required.",
    "Do not modify files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add new authentication or admin workflows for deletion beyond the existing admin delete page.",
    "Do not introduce external cron services, WebSockets, or third-party infrastructure for scheduling cleanup."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}