{
  "kind": "build_request",
  "title": "Add Admin \"Reset All Data\" button wired to unauthenticated backend resetAll()",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a backend `resetAll()` function that resets all application data and does not require any caller/principal authorization.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-3",
          "recent-5",
          "recent-7"
        ],
        "quotes": [
          "add a “Reset All Data” button to the admin page that calls a backend resetAll() function. do not require caller or principal for it.",
          "DO ONLY THE FOLLOWING: add a “Reset All Data” button to the admin page that calls a backend resetAll() function. do not require caller or principal for it.",
          "ok do it"
        ]
      },
      "acceptanceCriteria": [
        "`backend/main.mo` exposes a public update method named `resetAll` callable without `shared ({ caller })` auth checks.",
        "Calling `resetAll()` clears all persisted in-canister application state (including chatrooms, messages, reactions, active users, and user profiles) and resets ID counters so newly created chatrooms/messages start from a clean state.",
        "`resetAll()` returns successfully (no trap) when called on an already-empty state.",
        "No authorization/role/password checks are performed in `resetAll()` (no dependency on caller/principal)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a \"Reset All Data\" button to the existing admin page (`frontend/src/pages/AdminDeleteChatroomsPage.tsx`) that triggers the backend `resetAll()` call, with a destructive confirmation dialog and clear success/error feedback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-3",
          "recent-5",
          "recent-7"
        ],
        "quotes": [
          "add a “Reset All Data” button to the admin page that calls a backend resetAll() function.",
          "DO ONLY THE FOLLOWING: add a “Reset All Data” button to the admin page that calls a backend resetAll() function.",
          "ok do it"
        ]
      },
      "acceptanceCriteria": [
        "When authenticated on the admin page, the UI shows a \"Reset All Data\" destructive action in addition to the existing chatroom delete controls.",
        "Clicking \"Reset All Data\" opens a confirmation dialog that clearly states the action is destructive and irreversible.",
        "Confirming the dialog calls the backend `resetAll()` and shows a loading/disabled state while the request is in progress.",
        "On success, the UI shows a success toast/message and refreshes relevant React Query caches so the chatroom list updates to empty (without requiring a manual page refresh).",
        "On error, the UI shows an error toast/message and does not break existing admin functionality."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a React Query mutation hook to call backend `resetAll()` and integrate it into the admin page without changing unrelated pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-3",
          "recent-5"
        ],
        "quotes": [
          "dont make any changes except the following. strictly follow my instructions, dont make any changes to unrelated pages.",
          "DO ONLY THE FOLLOWING: add a “Reset All Data” button to the admin page that calls a backend resetAll() function."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/hooks/useQueries.ts` exports a new hook (e.g., `useResetAllData`) whose mutationFn calls `actor.resetAll()`.",
        "On successful reset, the hook invalidates chatroom/message-related query keys (at minimum `['chatrooms']`) so the UI reflects the cleared state.",
        "Only files necessary to wire this feature are changed; no unrelated pages/routes/components are modified."
      ]
    }
  ],
  "constraints": [
    "Strictly limit changes to implementing the backend `resetAll()` function and adding the \"Reset All Data\" button + wiring on the existing admin page; do not change unrelated pages.",
    "The backend reset function must not require any caller/principal checks (no auth gating).",
    "Respect single-actor Motoko architecture: keep all backend logic in `backend/main.mo` (use `backend/migration.mo` only if an upgrade-safe state migration is required).",
    "Do not edit any frontend files under `frontend/src/components/ui` or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add new admin routes or redesign the admin authentication flow.",
    "Do not add Internet Identity restrictions for resetAll().",
    "Do not implement partial resets, exports/backups, or undo functionality.",
    "Do not address deployment failures or environment reset automation as part of this change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}