{
  "kind": "build_request",
  "title": "Fix oversized getChatrooms query by returning lightweight chatroom summaries",
  "projectName": "Caffeine Chat",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Modify the backend query used to power the Lobby chat list so it cannot exceed the Internet Computer 3MB query reply limit by returning only lightweight chatroom summary fields (exclude any potentially large text/blob-like fields such as full media URLs/data URLs and long descriptions).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-User-Ok-do-it",
          "recent-Assistant-error-explanation"
        ],
        "quotes": [
          "Ok do it",
          "The IC hard‑limits all query responses to 3 MB max. Your canister is trying to send 8.8 MB ... Method name: getChatrooms"
        ]
      },
      "acceptanceCriteria": [
        "Calling the Lobby chatrooms query no longer triggers IC0504 / reject code 5 payload-too-large errors even with many chatrooms present.",
        "The backend response data for the Lobby chat list includes only summary fields (e.g., id, topic, category, createdAt, counts, live status, pinnedVideoId) and excludes large fields (e.g., mediaUrl/data URL payloads, large descriptions).",
        "Existing chatroom state data remains intact; no data loss occurs."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend Lobby data fetching and rendering to use the new lightweight chatroom summary response for the chat list while preserving current UX (loading/recovery states, client-side search and category filtering, grid layout, and navigation into a chatroom). If thumbnails/media are not available in the lightweight response, render a deterministic placeholder thumbnail based on mediaType instead of requiring mediaUrl in the Lobby list payload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-User-Ok-do-it",
          "recent-User-error-report"
        ],
        "quotes": [
          "Ok do it",
          "Failed to Load Chats\nThere was a problem loading the chat list. Please try again."
        ]
      },
      "acceptanceCriteria": [
        "The Lobby page loads successfully in production without showing the 'Failed to Load Chats' error caused by oversized responses.",
        "Search and category filtering continue to work client-side on the Lobby list.",
        "Chatroom cards still render a sensible thumbnail area (real thumbnail when possible, otherwise a placeholder) and clicking a card still navigates to the chatroom page."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the chatroom detail view continues to fetch full chatroom data only when needed (e.g., on the chatroom page), so the Lobby list remains lightweight and the overall app behavior is unchanged aside from fixing the payload size issue.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-Assistant-safest-fix",
          "recent-User-Ok-do-it"
        ],
        "quotes": [
          "Safest fix: make the getChatrooms query return only small, lightweight summary data (no messages, no blobs, no media).",
          "Ok do it"
        ]
      },
      "acceptanceCriteria": [
        "The Lobby list request remains lightweight, and full chatroom details/media are not fetched as part of the Lobby list query.",
        "Entering a chatroom still shows the correct chatroom content (topic/media/description/messages) as before.",
        "No console errors or unhandled promise rejections are introduced during navigation from Lobby to a chatroom."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implement pagination/infinite scroll for the Lobby chat list.",
    "Add new authentication methods beyond existing Internet Identity support.",
    "Introduce external databases or off-chain storage/services to bypass the IC query response limit."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}