{
  "kind": "build_request",
  "title": "Update username display to 8-character alphanumeric format",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the username generation function in backend/main.mo to produce 8-character alphanumeric usernames using both uppercase and lowercase letters mixed with numbers (e.g., 'A3x7K9m2', 'B5n2M8k1'). Keep all existing username generation logic and behavior intact - only change the format/presentation of the output.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "usernames should continue to work as they do now. all that changes is the presentation. 8 characters alphanumeric both upper and lower"
        ]
      },
      "acceptanceCriteria": [
        "Usernames are exactly 8 characters long",
        "Usernames contain a mix of uppercase letters (A-Z), lowercase letters (a-z), and numbers (0-9)",
        "All existing username generation logic and behavior remains unchanged",
        "No 'Anon' prefix is added to usernames"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update all frontend components that display usernames (MessageBubble, Header, etc.) to render the new 8-character alphanumeric format. Ensure the display matches the backend format without modification.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "8 characters alphanumeric both upper and lower"
        ]
      },
      "acceptanceCriteria": [
        "All username displays across the application show the 8-character format",
        "Usernames are rendered exactly as received from the backend without client-side transformation",
        "Username display is consistent across all UI components"
      ]
    }
  ],
  "constraints": [
    "Do not add any caller checks or authentication - the site must remain fully anonymous",
    "Do not change the existing username generation logic or behavior - only update the presentation format",
    "Do not add any user identity verification or tracking mechanisms"
  ],
  "nonGoals": [
    "Adding user authentication or login systems",
    "Implementing caller checks or identity verification",
    "Changing how usernames are generated or stored beyond the format",
    "Adding username persistence or user accounts"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}