{
  "kind": "build_request",
  "title": "Overlay chatroom category tags inside lobby thumbnails (bottom-right)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Update the lobby chatroom cards so that each chatroom’s category tag is rendered as an overlay inside the thumbnail, positioned at the bottom-right corner of the thumbnail image area (instead of next to the title under the thumbnail).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-7"
        ],
        "quotes": [
          "can you place the category tags inside the actual thumbnails in the bottom right of them. do you know what i mean?",
          "yes go ahead"
        ]
      },
      "acceptanceCriteria": [
        "In the lobby grid, for any chatroom with a non-empty category, the category tag appears inside the thumbnail area as a bottom-right overlay.",
        "The category tag no longer renders next to the chatroom title under the thumbnail.",
        "The overlay tag remains legible over bright/dark thumbnails (e.g., via background scrim/opacity and appropriate text styling).",
        "The overlay tag does not overlap the existing LIVE badge (LIVE stays top-left; category stays bottom-right).",
        "Chatroom cards without a category render no category tag overlay and the layout does not shift unexpectedly."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths (frontend/src/components/ui/* and specified hooks/main entry points) must not be edited; compose existing UI components instead.",
    "Do not introduce any backend changes or schema/state migrations for this UI-only change."
  ],
  "nonGoals": [
    "Changing how categories are created, stored, filtered, or searched.",
    "Changing the LIVE indicator design/placement beyond avoiding overlap with the category overlay.",
    "Adding new categories or modifying the existing category list."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}