{
  "kind": "build_request",
  "title": "Add admin-page \"Reset/Wipe All Data\" action (frontend-password gated, no caller/principal checks)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend function that wipes/resets all application data and can be called without any `caller`/`Principal` checks.\n\nThe reset must clear all persisted in-canister state used by the app, including:\n- all chatrooms\n- all messages\n- all active-user presence tracking\n- all reactions\n- all user profiles\n- all ID counters (e.g., next chatroom/message IDs)\n\nThe function must not require authentication/authorization in Motoko (no AccessControl checks and no use of `caller` for gating).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Go ahead and do it"
        ]
      },
      "acceptanceCriteria": [
        "A new public backend method exists to reset all stored app state and is callable by any user/caller.",
        "After calling the reset method, `getChatrooms()` returns an empty list and chatroom/message IDs start over from the initial state (as defined by the app’s counters).",
        "User profiles/reactions/presence data are cleared (subsequent reads behave as if the app is freshly deployed).",
        "The implementation does not introduce or require `caller`/`Principal` checks for this reset action."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose the reset capability in the admin UI at `frontend/src/pages/AdminDeleteChatroomsPage.tsx` as a clearly labeled destructive action (e.g., \"Reset/Wipe All Data\") that is protected only by the existing admin password/session gating already used on that page.\n\nThe UI must:\n- Require admin authentication (the existing password flow) before the reset control is visible/usable\n- Show a strong confirmation dialog explaining the action is irreversible\n- Show loading/disabled state while the reset is executing\n- Surface success/failure via the app’s existing toast/alert patterns",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Go ahead and do it"
        ]
      },
      "acceptanceCriteria": [
        "When not authenticated on the admin page, the reset control is not accessible.",
        "When authenticated, clicking the reset control opens a confirmation dialog and does not reset without confirmation.",
        "While the reset call is in-flight, the reset control is disabled and indicates progress.",
        "On success, the UI shows a success toast/message; on failure, it shows an error toast/message with a useful message."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add frontend data plumbing for the reset action by introducing a dedicated React Query mutation hook in `frontend/src/hooks/useQueries.ts` that calls the new backend reset method.\n\nAfter a successful reset, the app must invalidate relevant cached queries so the lobby/admin views immediately reflect an empty/fresh state (at minimum: chatrooms, messages, and any per-chatroom queries).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Go ahead and do it"
        ]
      },
      "acceptanceCriteria": [
        "A new React Query mutation hook exists for the reset action and is used by the admin page.",
        "After a successful reset, navigating to the lobby shows no chatrooms without requiring a manual refresh.",
        "React Query caches for chatrooms/messages are invalidated (or cleared) after reset so stale data is not displayed."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor architecture with all Motoko logic in `backend/main.mo`.",
    "Do not edit frontend files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (compose instead).",
    "User-facing text must be English."
  ],
  "nonGoals": [
    "Do not add Internet Identity or any other authentication/authorization requirement for the reset action (frontend password gating only).",
    "Do not implement multi-canister or external database storage/backup/restore workflows.",
    "Do not redesign existing admin authentication flow beyond what is needed to add the reset control."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}