{
  "kind": "build_request",
  "title": "Fix chatroom list not showing in unfiltered lobby/admin until category click (React Query stale cache)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the unfiltered chatroom list (React Query key ['chatrooms']) reliably refetches fresh data on page entry and is not stuck showing a previously-cached empty array in the Lobby page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Okay, go ahead and do it."
        ]
      },
      "acceptanceCriteria": [
        "When visiting the lobby with existing chatrooms, the list renders without requiring the user to click any category filter.",
        "If a stale cached empty array exists for ['chatrooms'], the lobby triggers a refetch and replaces the empty list with the fetched results automatically (no manual reload).",
        "Clearing category/search filters returns to an up-to-date unfiltered list without requiring an additional user action."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the /admin/delete-chatrooms page displays the full chatroom list immediately after authentication and does not remain empty due to stale cached results for the base ['chatrooms'] query.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Okay, go ahead and do it."
        ]
      },
      "acceptanceCriteria": [
        "After successful admin authentication, existing chatrooms are visible in the admin table without needing to select a category first.",
        "If the base chatrooms query previously resolved to an empty array due to a transient issue, the admin page automatically refetches and updates to show existing chatrooms.",
        "The admin page still shows the existing empty-state message only when the backend fetch completes successfully and returns zero chatrooms."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update React Query invalidation/refetch behavior so that creating a new chatroom guarantees the base ['chatrooms'] query updates promptly in the lobby and admin pages (in addition to any filtered query variants).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Okay, go ahead and do it."
        ]
      },
      "acceptanceCriteria": [
        "After creating a chatroom, the new chatroom appears in the unfiltered lobby list without requiring a category click or manual reload.",
        "After creating a chatroom, the new chatroom appears in /admin/delete-chatrooms without requiring a category selection change.",
        "All chatroom list variants (base, category-filtered, search) remain consistent after create/delete actions."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Do not add any new caller/principal-based access checks (use the existing admin password flow as-is).",
    "Keep scope limited to fixing the chatroom list visibility/refetch issue; do not change unrelated features."
  ],
  "nonGoals": [
    "Do not change backend Motoko data model or persistence logic.",
    "Do not redesign the UI or change routing/navigation.",
    "Do not add new admin features beyond making the existing list reliably load."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}