{
  "kind": "build_request",
  "title": "Normalize chatroom React Query keys for empty search/category filters",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Normalize chatroom React Query caching so that when the search term is empty/whitespace or the category is empty/whitespace, the corresponding hooks use the base chatroom query key ['chatrooms'] (and not ['chatrooms','search',''] or ['chatrooms','category','']). This ensures the Lobby cannot display a stale empty list due to alternate empty-filter cache keys.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "ok do it"
        ]
      },
      "acceptanceCriteria": [
        "When useSearchChatrooms is called with an empty or whitespace-only string, it uses queryKey ['chatrooms'] and fetches the same data as the base chatroom list.",
        "When useFilterChatroomsByCategory is called with an empty or whitespace-only string, it uses queryKey ['chatrooms'] and fetches the same data as the base chatroom list.",
        "With no active filters (empty search and no selected category), the Lobby displays the same chatroom list regardless of whether the user previously typed and cleared a search or toggled category filters.",
        "The transient empty-result guard (post-create window) reads previousData from the same queryKey that the hook is currently using (i.e., ['chatrooms'] in the empty-filter case)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update all chatroom list cache invalidations to refresh every chatroom-related query (base, search, and category variants) by invalidating the full ['chatrooms'] query key namespace (i.e., not only the exact ['chatrooms'] key).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "ok do it"
        ]
      },
      "acceptanceCriteria": [
        "After creating or deleting a chatroom, both the base chatroom list and any active search/category results refetch to reflect the latest backend state.",
        "After sending a message (which currently invalidates ['chatrooms']), any active chatroom list views (including search/category variants) refresh consistently."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them only).",
    "Do not edit immutable hook entry files listed in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "No backend (Motoko) changes.",
    "No UI redesign or new Lobby features beyond fixing the React Query caching behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}