{
  "kind": "build_request",
  "title": "Add admin function to reset all live/published site data",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend admin-only reset function that clears all published/live site data (chatrooms, messages, active users, reactions, and user profiles) and resets ID counters so the site returns to an empty/initial state.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Is it possible to make a function in the admin page that resets the entire live/published site that works similarly to the draft version?"
        ]
      },
      "acceptanceCriteria": [
        "A new Motoko update method exists in backend/main.mo that, when invoked successfully, empties: chatrooms, messages, activeUsers, reactions, and userProfiles, and resets nextChatroomId and nextMessageId back to 0.",
        "The reset method is protected so that non-admin callers cannot invoke it (must fail with a clear trap/error).",
        "On success, subsequent calls to getChatrooms() return an empty array and previously existing chatroom IDs are no longer resolvable via getChatroom()."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Extend the existing admin UI to include a \"Reset Published Site\" action that triggers the backend reset function, using the same admin authentication gating already used on the admin page, and requiring an explicit confirmation dialog before executing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Is it possible to make a function in the admin page that resets the entire live/published site that works similarly to the draft version?"
        ]
      },
      "acceptanceCriteria": [
        "The admin page at /admin/delete-chatrooms displays an additional destructive action (e.g., button) labeled \"Reset Published Site\" only after the admin password gate is passed.",
        "Clicking the reset action opens a confirmation dialog that clearly states that all chatrooms and messages will be permanently deleted and the action cannot be undone.",
        "Confirming calls the backend reset method and shows success/failure feedback in English (toast and/or inline alert)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "After a successful reset, ensure the UI and client cache are fully refreshed so the lobby/admin lists reflect the empty state without requiring a manual browser refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "resets the entire live/published site"
        ]
      },
      "acceptanceCriteria": [
        "On reset success, all chatroom-related React Query caches are invalidated (including the entire ['chatrooms'] namespace) and the base ['chatrooms'] query is refetched even if inactive (type: 'all'), matching the existing refetch strategy used by create/delete flows.",
        "After reset, the admin table shows \"No chatrooms found\" and the lobby page shows no rooms when navigated to or already open."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with logic implemented in backend/main.mo.",
    "Do not edit any files under frontend immutablePaths (compose existing UI components instead).",
    "All user-facing text introduced/changed must be in English."
  ],
  "nonGoals": [
    "Do not add new third-party authentication providers; use existing authentication/access patterns.",
    "Do not implement partial resets (e.g., deleting only messages) unless explicitly requested.",
    "Do not add new backend services or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}