{
  "kind": "build_request",
  "title": "Add DELETE ALL ROOMS admin action (frontend button + backend delete-all function)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Backend: Add a new publicly callable backend function that deletes all chatrooms and all associated data (messages, active user tracking, reactions) in one operation, with no caller/principal checks and no password checks.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add a “DELETE ALL ROOMS” button to the admin page that calls a backend function to delete all chatrooms. do not require caller or principal for it."
        ]
      },
      "acceptanceCriteria": [
        "A new backend method exists (exported in the canister interface) that removes all chatrooms and associated per-chatroom data.",
        "The method does not enforce any authorization (no admin role checks, no principal/caller gating) and does not require a password argument.",
        "After calling the method, subsequent calls to getChatrooms() return an empty list."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Frontend: Add a “DELETE ALL ROOMS” button to the existing admin page (frontend/src/pages/AdminDeleteChatroomsPage.tsx) that calls the new backend delete-all-chatrooms function and refreshes the chatroom list afterward.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the admin page already exists",
          "add a “DELETE ALL ROOMS” button to the admin page that calls a backend function to delete all chatrooms."
        ]
      },
      "acceptanceCriteria": [
        "The admin page UI includes a clearly labeled button: \"DELETE ALL ROOMS\".",
        "Clicking the button triggers a confirmation dialog before executing the delete-all action.",
        "On confirm, the frontend calls the backend delete-all-chatrooms method, then invalidates/refetches the chatroom list query so the table updates to show no chatrooms.",
        "A success toast/message is shown when the operation completes; an error toast/message is shown if the operation fails."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Frontend: Add a React Query mutation hook for the delete-all-chatrooms operation alongside existing admin mutations (e.g., in frontend/src/hooks/useQueries.ts), and use it from the admin page button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add a “DELETE ALL ROOMS” button to the admin page that calls a backend function to delete all chatrooms."
        ]
      },
      "acceptanceCriteria": [
        "A new hook exists that calls the backend delete-all-chatrooms method via the existing actor.",
        "On success, the hook invalidates the ['chatrooms'] query key (and any other directly related chatroom list query keys used by the app, if applicable).",
        "The admin page uses this hook for the \"DELETE ALL ROOMS\" button action (no direct actor calls inside the page other than via the hook)."
      ]
    }
  ],
  "constraints": [
    "Make no changes other than what is required to implement the \"DELETE ALL ROOMS\" button on the existing admin page and the backend function it calls.",
    "Do not add any caller/principal authorization checks or password checks to the delete-all-chatrooms backend function.",
    "Use English for any user-facing text added or modified."
  ],
  "nonGoals": [
    "Do not create a new admin page or change routing/navigation.",
    "Do not add authentication/authorization, role checks, or Internet Identity requirements for the delete-all operation.",
    "Do not redesign the admin page beyond inserting the new button and its confirmation flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}