{
  "kind": "build_request",
  "title": "Fix lobby initial load: prevent empty category filter from overwriting chatroom list",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the lobby initial-load bug where chatrooms do not display until a category is selected by ensuring the category-filter React Query never shares the base chatroom query key when no category is selected (so it cannot overwrite the base ['chatrooms'] cache).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Rooms are still not showing up in the live site unless you select a category.",
          "Ok fix it without touching anything else"
        ]
      },
      "acceptanceCriteria": [
        "On first load of the Lobby page (with no selected category and empty search), the UI shows the same rooms returned by the base getChatrooms query without requiring any user interaction.",
        "No request is made to the backend category filter endpoint with an empty string category (e.g., filterChatroomsByCategory('')).",
        "The base chatroom list query cache (queryKey ['chatrooms']) is not replaced by an empty array from any disabled/empty category query.",
        "Selecting a category still filters the list as before; clearing the category still restores the base list as before.",
        "Search behavior remains unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not change any backend Motoko code.",
    "Do not change any user-facing text.",
    "Make the smallest possible frontend change to resolve the initial-load lobby issue (i.e., avoid unrelated refactors).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new categories or changing category names.",
    "Changing polling/refetch intervals or adding new background refresh behaviors.",
    "Redesigning the Lobby page layout or styling.",
    "Adding new filtering modes (e.g., querying all categories at once)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}