{
  "kind": "build_request",
  "title": "Purge persisted empty React Query cache for lobby chatrooms on initial load",
  "projectName": "Caffeine Chats",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the lobby does not boot with a persisted cached empty array for the canonical React Query key ['chatrooms'] in production by purging/ignoring that cached value on initial app load (actor-ready) and forcing a fresh network refetch so rooms display immediately without requiring search/category interaction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ok apply that fix then"
        ]
      },
      "acceptanceCriteria": [
        "On a production session where the browser has an existing cached value of [] for the ['chatrooms'] query, the lobby shows real rooms (if any exist in the backend) on initial load without requiring a search or category click.",
        "The fix only targets the canonical lobby query key ['chatrooms'] cache behavior on initial load; search/category filtering continues to work as before.",
        "The implementation is applied in the existing actor-ready recovery flow (used by LobbyPage via useForceFreshChatroomsOnActorReady) and does not require backend changes."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only components must be composed, not edited).",
    "Do not edit immutable frontend hook entrypoints listed by the platform (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts/x, frontend/src/main.tsx).",
    "Follow the project architectural note: do not make unrelated changes or style changes beyond what is necessary to implement this fix.",
    "Backend remains single-actor; no backend schema/state changes are required for this fix."
  ],
  "nonGoals": [
    "Adding new features beyond the cache purge/ignore behavior for ['chatrooms'].",
    "Changing backend chatroom fetching, sorting, or storage behavior.",
    "Redesigning the lobby UI or changing styling unrelated to the cache fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}