{
  "kind": "build_request",
  "title": "Remove caller principal and authorization checks from profile avatar upload flow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In `backend/main.mo`, remove all caller principal checks and any authorization/role checks that restrict the profile avatar upload/update flow, so avatar uploads and avatar URL updates cannot fail due to `caller`-based authorization logic.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Remove all caller principal checks, any authorization checks from profile avatar uploads."
        ]
      },
      "acceptanceCriteria": [
        "Avatar-related backend methods no longer compare `caller` to any stored principal / owner principal as a condition for uploading or setting an avatar.",
        "Avatar-related backend methods no longer call `AccessControl.*` (or perform role checks) as a condition for uploading or setting an avatar.",
        "Avatar upload/update requests succeed regardless of the caller principal, assuming the request data itself is valid (e.g., required fields, valid URL/format constraints if any).",
        "Non-avatar backend authorization behavior (e.g., admin-only operations unrelated to avatar uploads) remains unchanged."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the frontend avatar flow (`frontend/src/components/AvatarPickerDialog.tsx` using `uploadImage(...)` and `useUpdateAvatar()`) continues to work end-to-end after backend changes, with no new login/auth requirements introduced and with user-facing error messages remaining in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Remove all caller principal checks, any authorization checks from profile avatar uploads."
        ]
      },
      "acceptanceCriteria": [
        "Uploading a custom avatar via the file picker successfully results in the avatar being updated without any authorization-related failure.",
        "Setting an avatar via selecting a Giphy GIF successfully updates the avatar without any authorization-related failure.",
        "Removing the avatar (setting it to null) succeeds without any authorization-related failure.",
        "No new authentication UI or login requirement is added (the app remains usable anonymously)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with logic in `backend/main.mo`.",
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (immutable paths).",
    "Do not introduce authentication requirements; the app is designed to work anonymously (see `frontend/src/components/LoginPrompt.tsx`)."
  ],
  "nonGoals": [
    "Do not add new admin/role features or redesign access control globally beyond removing avatar-upload-related checks.",
    "Do not change the image upload mechanism in the frontend (`uploadImage` local blob-storage URL generation) except as needed to keep the avatar flow functional.",
    "Do not add new storage providers, external databases, or third-party auth integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}