{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Use lightweight lobby chatroom summaries and placeholder thumbnails to avoid oversized Lobby payloads",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Switch Lobby list fetching/rendering to lightweight chatroom summaries and show deterministic placeholder thumbnails when media URLs are absent",
      "acceptanceCriteria": [
        "The Lobby page loads successfully in production without showing the 'Failed to Load Chats' error caused by oversized responses.",
        "Search and category filtering continue to work client-side on the Lobby list.",
        "Chatroom cards still render a sensible thumbnail area (real thumbnail when possible, otherwise a placeholder) and clicking a card still navigates to the chatroom page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a dedicated React Query hook for the Lobby list that calls the lightweight backend capability (getLobbyChatroomCards) and returns LobbyChatroomCard[]; keep existing full-chatroom hooks intact for non-Lobby views. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LobbyPage.tsx",
          "operation": "modify",
          "description": "Update Lobby to use the new Lobby summaries hook instead of fetching full chatrooms; preserve current loading/recovery behavior, grid layout, and navigation. Adjust client-side search/category filtering to operate on available summary fields (topic/category, plus optional safe fallbacks) without requiring full descriptions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ChatroomCard.tsx",
          "operation": "modify",
          "description": "Refactor ChatroomCard to accept LobbyChatroomCard for the Lobby list, remove any thumbnail fetching that depends on mediaUrl, and render a deterministic placeholder thumbnail based on mediaType when media URLs are not provided in the lightweight response (e.g., use existing generated placeholder images for twitch/twitter and a default thumbnail for others). Ensure card click behavior and metadata display remain sensible with summary fields only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/lobbyPlaceholderThumbnails.ts",
          "operation": "create",
          "description": "Create a small helper that maps mediaType to a stable placeholder thumbnail asset selection (using existing generated assets) so Lobby cards do not need mediaUrl for a thumbnail area. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts",
          "operation": "modify",
          "description": "Extend the recovery/purge logic to also cover the new Lobby list query key (e.g., clear persisted empty arrays and force refetch for the Lobby summaries query) so the Lobby loading/recovery UX remains unchanged after switching away from full chatroom fetching. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Keep full chatroom fetches confined to the chatroom detail view while the Lobby remains lightweight",
      "acceptanceCriteria": [
        "The Lobby list request remains lightweight, and full chatroom details/media are not fetched as part of the Lobby list query.",
        "Entering a chatroom still shows the correct chatroom content (topic/media/description/messages) as before.",
        "No console errors or unhandled promise rejections are introduced during navigation from Lobby to a chatroom."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ChatroomPage.tsx",
          "operation": "modify",
          "description": "Confirm/adjust the chatroom detail view to continue fetching full chatroom data via the dedicated full-chatroom query (e.g., useGetChatroom) and not rely on Lobby list data for media/description/messages; ensure navigation from Lobby still works without console errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the Lobby summaries hook and the full chatroom detail hook remain separate (no shared automatic refetch that would pull full chatroom data during Lobby rendering), and that any shared invalidation logic does not cause the Lobby to request full details. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}