{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix debounced Giphy search + stale response handling in AvatarPickerDialog",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace incorrect useState side-effect with a useEffect that runs Giphy search when debouncedSearchTerm changes, and clear results/errors when input is empty without making a request.",
      "acceptanceCriteria": [
        "Typing into the Giphy search input triggers a network request to Giphy after the existing debounce delay and updates results.",
        "Clearing the search input clears `giphyResults`, clears `giphyError`, and does not perform a Giphy request.",
        "The existing AvatarPickerDialog UI layout and styling (Tailwind classes/structure) remain unchanged aside from any minimal changes required to wire the effect correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AvatarPickerDialog.tsx",
          "operation": "modify",
          "description": "Update imports to use React useEffect (and any needed hooks), then replace the current `useState(() => { ... })` side-effect block with a `useEffect` that depends on `debouncedSearchTerm`. Ensure the effect: (1) early-returns after clearing `giphyResults`, `giphyError`, and `isSearchingGiphy` when `debouncedSearchTerm.trim()` is empty, and (2) otherwise starts the search, sets loading state, and updates `giphyResults`/`giphyError` from `searchGiphy`. Keep all existing JSX/Tailwind class structure unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure only the latest debounced Giphy search updates state, and prevent state updates after dialog close/unmount.",
      "acceptanceCriteria": [
        "If the user types quickly and multiple searches are in-flight, the UI ends up showing results for the most recent debounced term (no older request overwrites newer results).",
        "No React warnings occur for state updates on an unmounted component when closing the dialog during/after a search."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AvatarPickerDialog.tsx",
          "operation": "modify",
          "description": "Augment the debounced-search `useEffect` to guard against stale/out-of-order responses and unmount updates. Use a request sequencing mechanism (e.g., incrementing request id via useRef) and/or effect cleanup to ignore older results, and ensure cleanup prevents calling setState after unmount or after a newer search starts. Optionally cancel fetch using AbortController if wiring through `searchGiphy` is introduced, but do not change UI layout/styling."
        },
        {
          "path": "frontend/src/lib/giphy.ts",
          "operation": "modify",
          "description": "(If needed to support REQ-2) Extend `searchGiphy` to optionally accept a cancellation mechanism (e.g., AbortSignal) and pass it through to `fetch`, while preserving current return shape and error behavior. Keep this as a purely-frontend request (no backend changes)."
        }
      ]
    }
  ]
}