{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix stale empty React Query cache preventing unfiltered chatroom lists from rendering in Lobby/Admin",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the Lobby unfiltered ['chatrooms'] query refetch on page entry and recover automatically from a stale cached empty array, including when clearing filters.",
      "acceptanceCriteria": [
        "When visiting the lobby with existing chatrooms, the list renders without requiring the user to click any category filter.",
        "If a stale cached empty array exists for ['chatrooms'], the lobby triggers a refetch and replaces the empty list with the fetched results automatically (no manual reload).",
        "Clearing category/search filters returns to an up-to-date unfiltered list without requiring an additional user action."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LobbyPage.tsx",
          "operation": "modify",
          "description": "Add a lobby-entry refetch guard for the base ['chatrooms'] query (e.g., trigger a one-time refetch when the page is entered with no active filters and cached data is empty), and ensure handleClearFilters also triggers an immediate refetch of the base query after resetting filters (so returning to the unfiltered view always shows fresh data)."
        },
        {
          "path": "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts",
          "operation": "modify",
          "description": "Strengthen the actor-ready “force fresh” logic to explicitly handle the stale-empty-base-query case: if ['chatrooms'] currently has cached data that is an empty array, force a refetch (not just an invalidate) so the UI can recover without user interaction."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust the base useGetChatrooms React Query options to be more aggressive about freshness on view re-entry (e.g., refetch on focus/reconnect as needed) and ensure stale cached empty data does not persist without an automatic refetch."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the admin delete chatrooms page loads the full list immediately after password auth, even if ['chatrooms'] was previously cached as empty.",
      "acceptanceCriteria": [
        "After successful admin authentication, existing chatrooms are visible in the admin table without needing to select a category first.",
        "If the base chatrooms query previously resolved to an empty array due to a transient issue, the admin page automatically refetches and updates to show existing chatrooms.",
        "The admin page still shows the existing empty-state message only when the backend fetch completes successfully and returns zero chatrooms."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDeleteChatroomsPage.tsx",
          "operation": "modify",
          "description": "After successful password authentication, proactively invalidate/trigger a refetch for the base ['chatrooms'] query so the AdminChatroomList mounts with fresh data even if a stale empty array exists; also add a one-time refetch guard in AdminChatroomList similar to Lobby (only when cached list is empty)."
        },
        {
          "path": "frontend/src/hooks/useForceFreshChatroomsOnActorReady.ts",
          "operation": "modify",
          "description": "Ensure the actor-ready “force fresh” behavior reliably refetches the base ['chatrooms'] query when it is observed by the admin list (including when the admin list becomes active after auth), so stale cached empty results do not survive into the admin table."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make create/delete chatroom actions promptly refresh the base ['chatrooms'] list (and all variants) in both Lobby and Admin views.",
      "acceptanceCriteria": [
        "After creating a chatroom, the new chatroom appears in the unfiltered lobby list without requiring a category click or manual reload.",
        "After creating a chatroom, the new chatroom appears in /admin/delete-chatrooms without requiring a category selection change.",
        "All chatroom list variants (base, category-filtered, search) remain consistent after create/delete actions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update chatroom create/delete mutation success handlers to guarantee the base ['chatrooms'] query updates promptly (not only via broad invalidation): explicitly refetch the canonical ['chatrooms'] query after invalidating the chatrooms namespace, and keep variant keys consistent so base/category/search caches converge after mutations."
        },
        {
          "path": "frontend/src/pages/LobbyPage.tsx",
          "operation": "modify",
          "description": "Ensure the Lobby view reacts immediately to post-create/post-delete updates by relying on the refreshed base ['chatrooms'] query when no filters are active, avoiding any dependency on a category click to re-trigger rendering."
        },
        {
          "path": "frontend/src/pages/AdminDeleteChatroomsPage.tsx",
          "operation": "modify",
          "description": "Ensure the admin list view reacts immediately to post-create/post-delete updates by observing the refreshed base ['chatrooms'] query and not requiring a category selection change to trigger an update."
        }
      ]
    }
  ]
}