{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin UI: Reset Published Site action with confirmation and full client refresh",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a destructive 'Reset Published Site' admin action on /admin/delete-chatrooms with confirmation and success/failure feedback, gated by existing admin password flow.",
      "acceptanceCriteria": [
        "The admin page at /admin/delete-chatrooms displays an additional destructive action (e.g., button) labeled \"Reset Published Site\" only after the admin password gate is passed.",
        "Clicking the reset action opens a confirmation dialog that clearly states that all chatrooms and messages will be permanently deleted and the action cannot be undone.",
        "Confirming calls the backend reset method and shows success/failure feedback in English (toast and/or inline alert)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a dedicated React Query mutation hook (e.g., useResetPublishedSite) that calls the backend capability resetPublishedSite() and surfaces English success/failure feedback using the existing toast system. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminDeleteChatroomsPage.tsx",
          "operation": "modify",
          "description": "Extend the authenticated admin UI to render a new destructive button labeled \"Reset Published Site\" and wire it to a confirmation dialog (using existing shadcn-ui dialog/button/alert patterns already imported in this page). On confirm, invoke the reset mutation and show English success/failure feedback; ensure this action is only visible after the existing sessionStorage password gate is passed. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "After reset success, invalidate and refetch chatroom-related caches so admin and lobby reflect the empty state without manual refresh.",
      "acceptanceCriteria": [
        "On reset success, all chatroom-related React Query caches are invalidated (including the entire ['chatrooms'] namespace) and the base ['chatrooms'] query is refetched even if inactive (type: 'all'), matching the existing refetch strategy used by create/delete flows.",
        "After reset, the admin table shows \"No chatrooms found\" and the lobby page shows no rooms when navigated to or already open."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "In the reset mutation success handler, invalidate the entire ['chatrooms'] namespace (exact: false) and force a refetch of the base ['chatrooms'] query with type: 'all'. Also clear any related per-room caches (e.g., chatroom details and messages queries) so navigating back to lobby/admin immediately reflects an empty state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminDeleteChatroomsPage.tsx",
          "operation": "modify",
          "description": "After a successful reset, ensure the admin list UI updates immediately to the empty state (e.g., clear category filter to 'all' if applicable and rely on the invalidated/refetched ['chatrooms'] query so the table renders \"No chatrooms found\" without a manual refresh). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}