{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Client-side compression for all File-based image uploads",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add client-side image compression and apply it to all File-based image uploads before data-URL serialization/localStorage, with graceful fallback and correct orientation.",
      "acceptanceCriteria": [
        "Uploading an image as an avatar, chatroom media image, or message image results in a visibly correct image and a smaller serialized payload than the original for typical large photos (e.g., multi-megapixel JPEGs).",
        "All image upload flows still work end-to-end: the returned `data:...;blob-storage-id=...;base64,...` URL continues to render correctly wherever images are displayed.",
        "If an image cannot be compressed (unsupported type, runtime error), the app still attempts to upload the original image; users are not blocked solely due to compression failure.",
        "No compression is applied to non-file media inputs (YouTube/Twitch/Twitter URLs) or to Giphy avatar selection (remote URL)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/imageCompression.ts",
          "operation": "create",
          "description": "Create a shared client-side image compression helper that (1) preserves correct orientation (prefer browser decoding that respects EXIF orientation), (2) downscales large images to a reasonable max dimension, (3) encodes to a lossy format/quality (prefer modern format when supported), and (4) throws or returns a structured failure so callers can fall back to the original File without blocking users."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the exported uploadImage(file, onProgress?) pipeline to attempt compression via the new frontend/src/lib/imageCompression.ts helper before reading/serializing to a data URL and storing in localStorage; if compression fails, silently fall back to the original file and only surface an error if the original serialization/upload path also fails; keep the returned `data:${mime};blob-storage-id=...;base64,...` contract intact and preserve existing onProgress behavior."
        },
        {
          "path": "frontend/src/components/AvatarPickerDialog.tsx",
          "operation": "modify",
          "description": "Ensure avatar File uploads continue to call the shared uploadImage from frontend/src/hooks/useQueries.ts (now compressing internally) without changing the Giphy remote-URL selection path; keep current validation and error handling intact."
        },
        {
          "path": "frontend/src/components/CreateChatroomDialog.tsx",
          "operation": "modify",
          "description": "Ensure chatroom media File uploads continue to call the shared uploadImage from frontend/src/hooks/useQueries.ts (now compressing internally) and that non-file media tabs (YouTube/Twitch/Twitter URLs) bypass compression; maintain existing progress UI wiring through the onProgress callback."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Refactor to a single canonical image upload/compress pipeline and update MessageInput to use it while preserving progress UX.",
      "acceptanceCriteria": [
        "There is only one canonical image-upload function used by AvatarPickerDialog, CreateChatroomDialog, and MessageInput for File-based image uploads.",
        "`CreateChatroomDialog` progress UI continues to update (0–100%) during upload/serialization.",
        "`MessageInput` still shows its uploading progress UI and sends the message with `mediaType: 'image'` and a working `mediaUrl`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageInput.tsx",
          "operation": "modify",
          "description": "Remove/retire the local uploadImage(File) implementation and switch image uploads to import and use the shared uploadImage from frontend/src/hooks/useQueries.ts; wire MessageInput’s existing isUploading/uploadProgress state to the shared function via its onProgress callback so the current progress UI remains functional; ensure non-file media inputs (YouTube/Twitch/Twitter URLs) remain unchanged and audio upload is unaffected."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Finalize uploadImage as the single canonical File-based image upload function used across the app (AvatarPickerDialog, CreateChatroomDialog, MessageInput), including optional onProgress callback support; ensure any prior duplicated logic is consolidated into this shared pipeline and that progress semantics remain compatible with existing UIs."
        }
      ]
    }
  ]
}