{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix image and GIF display in chat message bubbles",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore image and GIF display functionality in MessageBubble.tsx using the working approach from draft version 261",
      "acceptanceCriteria": [
        "Images with imageId load and display correctly in message bubbles using the useGetImage hook",
        "Images with imageUrl load and display correctly in message bubbles using direct blob URLs",
        "Animated GIFs display and animate properly in chat messages",
        "All existing MessageBubble functionality (reactions, replies, media embeds, pinning) continues to work",
        "Image loading errors are handled gracefully"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Restore image rendering logic to handle both imageId (using useGetImage hook to fetch from backend) and imageUrl (using direct blob URLs from getDirectURL()). Add proper image loading states and error handling. Ensure animated GIFs display correctly. Reference the blob-storage component's ExternalBlob.getDirectURL() method for imageUrl rendering. Preserve all existing functionality including reactions, replies, media embeds (YouTube/Twitch/Twitter), voice messages, pinning, and Twitter widget loading. Verify the blob-storage component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update frontend query hooks to ensure proper image fetching support for MessageBubble.tsx",
      "acceptanceCriteria": [
        "useGetImage hook (if it exists) properly fetches images from the backend using imageId",
        "Image query hooks handle loading states and errors appropriately",
        "Query hooks integrate correctly with MessageBubble.tsx image rendering logic"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and update image-related query hooks to ensure proper integration with MessageBubble.tsx. If useGetImage hook exists, verify it correctly calls actor.getImage(imageId) and returns ExternalBlob instances. If the hook is missing, add it with proper React Query configuration including queryKey, enabled state based on imageId presence, error handling, and loading states. Ensure the hook integrates with the blob-storage component's ExternalBlob type from the backend interface. Reference the blob-storage component's usage instructions for proper ExternalBlob handling."
        }
      ]
    }
  ]
}