{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Keep avatar upload/update flow working anonymously after backend authorization removal",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Maintain end-to-end avatar upload/Giphy/removal flow with anonymous usage and English errors after backend authorization changes.",
      "acceptanceCriteria": [
        "Uploading a custom avatar via the file picker successfully results in the avatar being updated without any authorization-related failure.",
        "Setting an avatar via selecting a Giphy GIF successfully updates the avatar without any authorization-related failure.",
        "Removing the avatar (setting it to null) succeeds without any authorization-related failure.",
        "No new authentication UI or login requirement is added (the app remains usable anonymously)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden the avatar-related hooks to remain fully anonymous-compatible: ensure the avatar update mutation can always run with the anonymous actor from useActor(), updates localStorage consistently (chatAvatarUrl), and triggers any needed cache invalidations so UI reflects changes immediately. Also normalize backend failures into stable English user-facing messages (avoid surfacing raw authorization/role wording). Where applicable, align the avatar upload URL handling with the selected blob-storage component’s expectations for blob-backed URLs (without changing the existing uploadImage mechanism), and Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AvatarPickerDialog.tsx",
          "operation": "modify",
          "description": "Ensure the dialog’s upload/Giphy/removal actions surface clear English error messages while remaining anonymous (no login prompts). Add any small UX safeguards needed to prevent stale UI after mutation (e.g., disabling actions during pending states and relying on the updated query invalidations). This dialog is the main consumer of uploadImage(...) and useUpdateAvatar(). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}