{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix image rendering in chatrooms",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix image display functionality in chatroom messages so that images with imageId are properly rendered and visible to users",
      "acceptanceCriteria": [
        "Images uploaded via MessageInput are displayed correctly in MessageBubble components",
        "Image rendering works for all message types that include imageId",
        "No visual style changes are introduced to existing components"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Add image rendering logic for messages with imageId property. When a message contains imageId, fetch the image using the getImage backend method and render it using ExternalBlob's getDirectURL() method. Ensure the image is displayed within the existing message bubble structure without modifying any CSS classes or layout. The image should be rendered alongside other message content (text, embeds) as appropriate."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook useGetImage(imageId: bigint | null) that calls actor.getImage(imageId) when imageId is provided. This hook should return the ExternalBlob and handle loading/error states. Enable the query only when imageId is not null and actor is available. This will be used by MessageBubble to fetch images for display."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Preserve all existing visual styles and layout in the chatroom interface during the fix",
      "acceptanceCriteria": [
        "No changes to CSS classes or inline styles",
        "No modifications to component layout or structure beyond what's necessary for image rendering",
        "Existing theme and design system remain unchanged"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Ensure image rendering implementation uses only existing CSS classes and styling patterns already present in MessageBubble. Do not add new CSS classes, modify existing classes, or introduce inline styles. The image element should integrate seamlessly with the current message bubble layout without altering spacing, padding, or positioning of other elements."
        }
      ]
    }
  ]
}