{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore character count progress bar and remove extra border in chatroom chat input",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add character count progress bar to chat input matching the CreateChatroomDialog implementation",
      "acceptanceCriteria": [
        "Character count progress bar appears below the textarea in MessageInput component",
        "Progress bar style matches the CharacterLimitProgress component used in CreateChatroomDialog",
        "Progress bar shows visual feedback with color transitions based on character count percentage",
        "Progress bar updates in real-time as user types"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageInput.tsx",
          "operation": "modify",
          "description": "Add CharacterLimitProgress component below the textarea to display character count progress. Extract the percentage-based width calculation and color transition logic from CreateChatroomDialog's character limit implementation. Wire the progress bar to update in real-time as the user types in the message textarea. Use the same 500-character limit and visual styling (gray → yellow → red transitions) as used in the create room modal inputs."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove extra top border from chat input area",
      "acceptanceCriteria": [
        "No visible border appears at the top of the chat input area",
        "All other styling remains unchanged",
        "The fix applies specifically to the MessageInput component in the chatroom context"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageInput.tsx",
          "operation": "modify",
          "description": "Remove the extra border-t class or border-top style from the container element wrapping the MessageInput component. Identify the outermost div in the component that currently has a top border and remove only that border property without changing any other styles."
        }
      ]
    }
  ]
}