{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Improve microphone animation, reduce input padding, restore button labels",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Change the microphone button's rotating ring animation color to theme blue (--color-primary)",
      "acceptanceCriteria": [
        "The rotating border animation on the microphone button uses the theme's blue color",
        "The animation color matches the primary theme color used throughout the app"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageInput.tsx",
          "operation": "modify",
          "description": "Update the microphone button's rotating ring animation to use the theme's primary blue color (--color-primary). Locate the recording state UI where the rotating border animation is rendered (likely using CSS classes or inline styles with animation properties) and change the border or animation color to reference the CSS custom property var(--color-primary) from the theme system defined in frontend/src/index.css."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Reduce vertical padding in the MessageInput component to make it more compact",
      "acceptanceCriteria": [
        "The chat input area has less vertical padding than before",
        "The input area appears more compact while remaining usable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageInput.tsx",
          "operation": "modify",
          "description": "Reduce the vertical padding (py-* classes or padding styles) on the MessageInput component's container or wrapper elements. Look for padding applied to the main input area container and decrease the values to make the component more compact while preserving usability and touch targets for mobile users."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Restore text labels for the react and reply buttons on message bubbles",
      "acceptanceCriteria": [
        "React button displays a visible text label",
        "Reply button displays a visible text label",
        "Labels are visible and readable on message bubbles"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Add text labels to the react and reply buttons that appear on message bubbles. Locate the button elements for reactions and replies (likely icon-only buttons currently) and add visible text labels such as 'React' and 'Reply' alongside or near the icons. Ensure the labels are styled appropriately for readability and don't disrupt the existing layout."
        }
      ]
    }
  ]
}