{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Adjust chatroom header stat spacing and LIVE badge placement",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Reduce the horizontal gap in the ChatArea header stats row to 0.5rem between message/reply count, view count, and category badge.",
      "acceptanceCriteria": [
        "In `ChatArea.tsx`, the container that lays out message/reply count, view count, and category badge uses a 0.5rem horizontal gap (e.g., Tailwind `gap-2`).",
        "Visual verification: the spacing between the message/reply count group and view count group is 0.5rem.",
        "Visual verification: the spacing between the view count group and the category badge (when present) is 0.5rem."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatArea.tsx",
          "operation": "modify",
          "description": "Update the header stats-row container spacing from 1rem to 0.5rem by changing the horizontal gap utility (e.g., `gap-4` to `gap-2`) for the row containing message count, view count, and category badge."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Move the LIVE indicator into the ChatArea header stats row to the right of the category badge (or after other stats when category is absent) with 0.5rem spacing.",
      "acceptanceCriteria": [
        "When `chatroom.isLive` is true and `chatroom.category` is present, the LIVE indicator renders immediately to the right of the category badge in the stats row.",
        "The horizontal gap between the category badge and the LIVE indicator is 0.5rem.",
        "When `chatroom.category` is not present and `chatroom.isLive` is true, the LIVE indicator still renders in the stats row to the right of the existing stats items with consistent 0.5rem spacing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatArea.tsx",
          "operation": "modify",
          "description": "Reposition the LIVE indicator so it renders within the header stats row after the category badge when present (otherwise after the view-count group), ensuring the stats-row container uses 0.5rem spacing (e.g., `gap-2`) so the category↔LIVE separation is also 0.5rem. Remove the existing LIVE indicator rendering next to the chatroom title so it appears only in the stats row."
        }
      ]
    }
  ]
}