{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Normalize chatroom React Query keys and invalidate full chatrooms namespace",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Normalize chatroom list React Query keys so empty/whitespace search/category reuse the base ['chatrooms'] cache key and the transient empty-result guard reads previousData from the active key.",
      "acceptanceCriteria": [
        "When useSearchChatrooms is called with an empty or whitespace-only string, it uses queryKey ['chatrooms'] and fetches the same data as the base chatroom list.",
        "When useFilterChatroomsByCategory is called with an empty or whitespace-only string, it uses queryKey ['chatrooms'] and fetches the same data as the base chatroom list.",
        "With no active filters (empty search and no selected category), the Lobby displays the same chatroom list regardless of whether the user previously typed and cleared a search or toggled category filters.",
        "The transient empty-result guard (post-create window) reads previousData from the same queryKey that the hook is currently using (i.e., ['chatrooms'] in the empty-filter case)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Introduce a small query-key normalization helper for chatroom list queries (base/search/category) that trims inputs and returns the base key ['chatrooms'] when the search term or category is empty/whitespace. Update useSearchChatrooms and useFilterChatroomsByCategory to use the normalized key (and trimmed values for non-empty variants), and update the post-create transient-empty guard to read previousData using the exact same normalized queryKey used by the hook."
        },
        {
          "path": "frontend/src/pages/LobbyPage.tsx",
          "operation": "modify",
          "description": "Ensure the Lobby's filter-selection logic treats whitespace-only values as empty (use .trim() checks) so it consistently selects the base list when filters are effectively cleared, aligning view selection behavior with the normalized React Query keys."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Refresh all chatroom-related caches by invalidating the full ['chatrooms'] query key namespace after mutations (create/delete/message/etc.).",
      "acceptanceCriteria": [
        "After creating or deleting a chatroom, both the base chatroom list and any active search/category results refetch to reflect the latest backend state.",
        "After sending a message (which currently invalidates ['chatrooms']), any active chatroom list views (including search/category variants) refresh consistently."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update all chatroom-list invalidations (e.g., after createChatroom, deleteChatroom, sendMessage, incrementViewCount) to invalidate the entire ['chatrooms'] namespace (non-exact match) so base/search/category variants refetch together. Keep invalidations for other non-chatrooms keys unchanged."
        }
      ]
    }
  ]
}