{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Use tweet-result attached photo as X/Twitter chatroom card thumbnail background",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "On chatroom cards for X/Twitter status URLs, use the first attached tweet photo (if present) as the thumbnail background image, otherwise preserve existing Twitter thumbnail behavior.",
      "acceptanceCriteria": [
        "Given a chatroom with mediaType='twitter' and a valid X/Twitter status URL that includes photo media, the chatroom thumbnail renders with the first photo as the background (object-cover).",
        "If the tweet-result JSON has no photos (or the fetch fails), the thumbnail falls back to the current existing Twitter thumbnail behavior (no regressions).",
        "This change only affects X/Twitter post thumbnails on chatroom cards and does not modify Twitter embeds in messages or any other media thumbnails."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatroomCard.tsx",
          "operation": "modify",
          "description": "Add a dedicated fetch for the tweet’s first attached photo URL for chatroom cards when mediaType is 'twitter' and mediaUrl is a status URL; if a photo is found, render it as the thumbnail background image (object-cover) while preserving existing fallback rendering when no photo is available."
        },
        {
          "path": "frontend/src/lib/twitterThumbnail.ts",
          "operation": "modify",
          "description": "Implement a small utility to fetch/derive the first attached photo URL for a tweet (returning null when unavailable) and expose it for ChatroomCard usage."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Fetch tweet-result JSON via the specified cdn.syndication.twimg.com format, parse photo media safely, and cache per tweet to avoid repeated refetching during browsing.",
      "acceptanceCriteria": [
        "Network requests for X/Twitter thumbnails use the tweet-result endpoint and are keyed per tweet URL/ID to avoid repeated refetching during normal browsing.",
        "The code safely handles unexpected response shapes (missing fields, empty arrays) without throwing and without breaking chatroom card rendering."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/twitterThumbnail.ts",
          "operation": "modify",
          "description": "Implement tweet ID extraction usage (via existing getTwitterPostId) and fetch tweet-result JSON using https://cdn.syndication.twimg.com/tweet-result?id=TWEET_ID&token=123; parse the response defensively to locate the first attached photo URL (e.g., photos[] and/or media_url_https variants) and return a stable result (string or null) without throwing."
        },
        {
          "path": "frontend/src/lib/twitterThumbnailCache.ts",
          "operation": "modify",
          "description": "Implement caching/deduplication for tweet-result photo lookups keyed by tweet ID/URL (in-memory in-flight dedupe + localStorage persistence) so ChatroomCard does not refetch repeatedly during normal browsing, and ensure corrupted/expired entries fail safely."
        },
        {
          "path": "frontend/src/components/ChatroomCard.tsx",
          "operation": "modify",
          "description": "Wire ChatroomCard’s Twitter thumbnail flow to call the new tweet-result photo fetch utility and use the cache keying behavior (per tweet URL/ID) so repeated renders do not trigger unnecessary refetching."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Keep scope strictly limited to using the extracted tweet photo as the X/Twitter chatroom card thumbnail background, with no other UI/styling/behavior changes.",
      "acceptanceCriteria": [
        "Git diff is limited to the minimal set of files required to implement the X/Twitter thumbnail background change; no unrelated refactors, formatting-only changes, or UI tweaks elsewhere."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatroomCard.tsx",
          "operation": "modify",
          "description": "Constrain changes to the Twitter thumbnail branch only (chatroom cards), avoiding unrelated refactors, formatting-only edits, or changes to other media types and message embeds."
        },
        {
          "path": "frontend/src/lib/twitterThumbnail.ts",
          "operation": "modify",
          "description": "Keep the new logic narrowly focused on tweet-result photo extraction for chatroom card thumbnails, without altering other Twitter embed/preview logic."
        },
        {
          "path": "frontend/src/lib/twitterThumbnailCache.ts",
          "operation": "modify",
          "description": "Add only the minimal caching needed for tweet-result thumbnail photo lookups, without introducing broader cache changes or unrelated behavior modifications."
        }
      ]
    }
  ]
}