{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Reset All Data UI wired to resetAll() React Query mutation",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a destructive \"Reset All Data\" action to the existing admin page with confirmation, loading state, and success/error feedback.",
      "acceptanceCriteria": [
        "When authenticated on the admin page, the UI shows a \"Reset All Data\" destructive action in addition to the existing chatroom delete controls.",
        "Clicking \"Reset All Data\" opens a confirmation dialog that clearly states the action is destructive and irreversible.",
        "Confirming the dialog calls the backend `resetAll()` and shows a loading/disabled state while the request is in progress.",
        "On success, the UI shows a success toast/message and refreshes relevant React Query caches so the chatroom list updates to empty (without requiring a manual page refresh).",
        "On error, the UI shows an error toast/message and does not break existing admin functionality."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDeleteChatroomsPage.tsx",
          "operation": "modify",
          "description": "Import and use the new React Query mutation hook (e.g., `useResetAllData`) and add a \"Reset All Data\" destructive control within the existing authenticated admin UI. Use the existing shadcn-ui AlertDialog + Button components to present an irreversible confirmation dialog; disable/replace button content while the reset mutation is pending, and surface success/error via toast/message without impacting existing delete-chatroom behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a React Query mutation hook in useQueries.ts that calls `actor.resetAll()` and invalidates relevant caches on success.",
      "acceptanceCriteria": [
        "`frontend/src/hooks/useQueries.ts` exports a new hook (e.g., `useResetAllData`) whose mutationFn calls `actor.resetAll()`.",
        "On successful reset, the hook invalidates chatroom/message-related query keys (at minimum `['chatrooms']`) so the UI reflects the cleared state.",
        "Only files necessary to wire this feature are changed; no unrelated pages/routes/components are modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add and export a new React Query mutation hook (e.g., `useResetAllData`) that calls `actor.resetAll()` (using `useActor()` for actor availability). On success, invalidate `['chatrooms']` and other chatroom/message-related keys used by the app (e.g., `['messages']`, `['chatroom']`) so the admin page list refreshes to empty; on error, surface a clear toast error. Keep changes strictly scoped to this hook and its cache invalidation behavior."
        }
      ]
    }
  ]
}