{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin UI reset/wipe-all-data action with React Query mutation + cache invalidation",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a password-gated destructive \"Reset/Wipe All Data\" action to the existing admin page with confirmation, loading state, and toast feedback.",
      "acceptanceCriteria": [
        "When not authenticated on the admin page, the reset control is not accessible.",
        "When authenticated, clicking the reset control opens a confirmation dialog and does not reset without confirmation.",
        "While the reset call is in-flight, the reset control is disabled and indicates progress.",
        "On success, the UI shows a success toast/message; on failure, it shows an error toast/message with a useful message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDeleteChatroomsPage.tsx",
          "operation": "modify",
          "description": "Within the authenticated AdminChatroomList view, add a clearly labeled destructive \"Reset/Wipe All Data\" control that calls the new React Query reset mutation. Use the existing shadcn/ui AlertDialog + Button components already used on this page for a strong irreversible confirmation message, ensure the reset UI is only rendered when authenticated, show disabled/loading state while the mutation is in-flight, and surface success/failure using the app’s existing toast pattern (sonner) via the mutation’s onSuccess/onError behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Introduce a dedicated React Query mutation hook that calls the backend reset method and invalidates relevant caches so UI reflects a fresh state immediately.",
      "acceptanceCriteria": [
        "A new React Query mutation hook exists for the reset action and is used by the admin page.",
        "After a successful reset, navigating to the lobby shows no chatrooms without requiring a manual refresh.",
        "React Query caches for chatrooms/messages are invalidated (or cleared) after reset so stale data is not displayed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook (e.g., useResetAllData) that calls actor.resetAllData(). On success: invalidate/remove cached queries for chatrooms, messages, and per-chatroom keys (at minimum query keys starting with ['chatrooms'], ['chatroom', ...], and ['messages', ...]) so Lobby/Admin/Chatroom views immediately reflect the empty state; also reset any local transient guards that could interfere with empty results (e.g., the post-create empty-result guard window). On error: surface a useful sonner toast message consistent with existing mutation hooks. Ensure AdminDeleteChatroomsPage consumes this hook. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}