{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update category tag styling to match live tags",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Convert all category text labels to lowercase display throughout the UI",
      "acceptanceCriteria": [
        "All category labels display in lowercase",
        "Category text transformation is consistent across lobby and chatroom views"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LobbyPage.tsx",
          "operation": "modify",
          "description": "Apply lowercase transformation to category badge text in the lobby chatroom cards. Modify the category badge rendering to use .toLowerCase() or CSS text-transform: lowercase on the category string displayed in the badge."
        },
        {
          "path": "frontend/src/components/ChatroomCard.tsx",
          "operation": "modify",
          "description": "Apply lowercase transformation to category badge text in individual chatroom cards. Ensure the category display uses .toLowerCase() or CSS text-transform: lowercase to match the lobby implementation."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Match the padding, font size, and visual styling of category tags to the existing LIVE indicator badges",
      "acceptanceCriteria": [
        "Category tags have identical padding to LIVE tags",
        "Category tags have identical font size to LIVE tags",
        "Category tags maintain visual consistency with LIVE tags in terms of height and border radius"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LobbyPage.tsx",
          "operation": "modify",
          "description": "Update category badge styling in the lobby to match LIVE tag dimensions. Apply the same Tailwind classes or inline styles used by the LIVE badge (padding, text size, border radius, height) to the category badge element."
        },
        {
          "path": "frontend/src/components/ChatroomCard.tsx",
          "operation": "modify",
          "description": "Update category badge styling in ChatroomCard to match LIVE tag dimensions. Ensure padding, font-size, border-radius, and height match the LIVE badge styling. Use consistent Tailwind utility classes or inline styles to maintain visual parity."
        }
      ]
    }
  ]
}