{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix GIF rendering in chat messages",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Update MessageBubble.tsx to render GIF data from Giphy as animated images inline in chat messages",
      "acceptanceCriteria": [
        "GIFs selected from the Giphy picker display as animated images in chat messages",
        "GIF rendering matches the visual style and behavior of existing image rendering",
        "GIF URLs from Giphy are properly passed through from selection to display",
        "No plain text GIF names appear in the chat - only rendered animated images"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageBubble.tsx",
          "operation": "modify",
          "description": "Add GIF rendering logic to detect when message.gifData is present and render it as an animated image element. The gifData object contains url, title, and other metadata from Giphy. Render the GIF using message.gifData.url in an img element, styled consistently with existing image rendering (rounded corners, max width constraints). Place the GIF rendering check before the plain text content rendering to ensure GIFs display as images rather than text. Preserve all existing media rendering logic for YouTube, Twitch, Twitter, voice messages, and images."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Verify GIF data structure includes URL information and is properly transmitted with messages",
      "acceptanceCriteria": [
        "GIF selection from Giphy picker captures the GIF URL (not just the name)",
        "Message payload includes the complete GIF URL when sending messages with GIFs",
        "Backend stores and returns the GIF URL data correctly",
        "Frontend receives the GIF URL data and can access it for rendering"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MessageInput.tsx",
          "operation": "modify",
          "description": "Review and verify that when a GIF is selected from the Giphy picker, the complete gifData object (including url, title, id, and other Giphy metadata) is captured and passed to the sendMessage mutation. Ensure the gifData parameter in the sendMessage call contains the full GIF URL from the selected Giphy result, not just the GIF title or name. The backend interface shows sendMessage accepts gifData as GifData | null, which includes url: string as a required field. Confirm this data flow is working correctly from Giphy selection through message submission."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify the sendMessage mutation in useSendMessage hook correctly passes the gifData parameter to the backend actor.sendMessage call. Ensure the gifData object structure matches the backend GifData type definition (id, url, title, username, bitly_url, source, embed_url, rating). Confirm no data transformation is stripping the url field before transmission to the backend."
        }
      ]
    }
  ]
}