{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 13,
  "summary": "Project now also includes product/UI fixes: make room creation media (image/video/X post) optional (fields remain visible; only one media type allowed), and address missing thumbnails for image-created rooms, alongside ongoing backend anonymization and IC payload-size fixes.",
  "architectural_notes": [
    "Internet Computer query replies have a hard ~3MB payload limit; backend query methods must return compact/paginated data.",
    "User requires a surgical change: edit only backend/main.mo within getChatrooms(); no other files/pages; no refactors/style changes; no added authorization checks (no caller/principal).",
    "Backend must remain anonymous: do not use caller/principal-based authorization checks (AccessControl) anywhere in backend/main.mo or helper modules (including backend/authorization/access-control.mo).",
    "Large multi-file/multi-function authorization removals must be applied in small incremental chunks due to platform patch-size/stream timeout limits.",
    "Incremental anonymization plan includes removing `accessControlState` from `backend/main.mo` as a discrete next chunk before neutralizing individual authorization checks.",
    "Room creation UX requirement: media inputs remain visible, but attaching media is optional; user may attach at most one media type (image OR video OR X post)."
  ],
  "known_issues": [
    "Live site error 'Failed to Load Chats' due to IC rejection: getChatrooms query reply payload ~8.8MB exceeds 3MB limit (IC0504 / reject code 5).",
    "Build/automation repeatedly fails when attempting to remove all AccessControl logic in one pass due to patch-size/stream timeout limits; requires smaller incremental edits (e.g., remove import first, then state, then checks).",
    "Incremental patch attempts may be rejected by the platform due to diff application/transform limitations (e.g., patch too small or not applying cleanly), requiring retries or slightly larger chunks.",
    "Image-created room thumbnails are not displaying (thumbnail rendering/fallback issue)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-the-room-creation-ui-so-a-chatroom-can-be-created-with-no-media-attached-no-image-upload-no-video-url-and-no-twitter-x-url-while-keeping-the-media-input-fields-tabs-visible-at-all-times-and-still-allowing-only-one-media-type-when-used",
      "title": "Update the room creation UI so a chatroom can be created with no media attached (no image upload, no video URL, and no Twitter/X URL), while keeping the media input fields/tabs visible at all times and still allowing only one media type when used.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Surgical backend fix: modify backend/main.mo getChatrooms() to return only lightweight chatroom summary fields to stay under IC 3MB query limit; do not touch any other files or add any authorization/caller/principal checks.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Apply a surgical backend-only fix in backend/main.mo by modifying ONLY the body of the public query function getChatrooms() so that it returns lightweight chatroom summaries (no large payload fields) and no longer triggers the Internet Computer 3MB query response limit rejection (IC0504). The response must retain the existing return type ([ChatroomWithLiveStatus]) to avoid any frontend changes, but must minimize payload by not returning any large text/blob-like content (e.g., ensure description and pinnedVideoId are not populated with large data; and if mediaUrl contains an inline base64 payload, do not include the base64 payload in the returned mediaUrl string). Do not add any authorization checks or caller/principal logic.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Remove all caller/principal/authorization checks to make the site fully anonymous: strip AccessControl usage and related permission checks while keeping all functions intact. Apply changes across backend/main.mo and helper modules including backend/authorization/access-control.mo; perform edits in small incremental chunks to avoid build/patch timeouts.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "In backend/main.mo, remove the `import AccessControl \"authorization/access-control\";` line, and replace it with an equivalent in-file, minimal `module AccessControl { ... }` stub that preserves successful compilation while making authorization permissive (anonymous) for this incremental step.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "In `backend/main.mo`, continue the incremental anonymization work by removing (or neutralizing) the remaining runtime authorization gates that trap with \"Unauthorized\" based on `AccessControl.hasPermission(...)`, so that anonymous callers can use the app without being blocked. Keep all existing public functions and signatures intact; do not introduce any new caller/principal/authorization logic.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Next incremental anonymization chunk: remove the `accessControlState` variable from `backend/main.mo` as the smallest safe step before stripping individual `AccessControl.hasPermission(...)` gates; keep public functions/signatures intact and do not introduce any caller/principal logic.",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-7",
      "summary": "In `backend/main.mo`, remove the `accessControlState` variable (`let accessControlState = AccessControl.initState();`) and update all references so the canister still compiles and all existing public methods and signatures remain unchanged.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "In backend/main.mo, remove or neutralize the next remaining runtime authorization gate by eliminating the `AccessControl.hasPermission(accessControlState, caller, #admin)` check (and its `Debug.trap(\"Unauthorized: Only admins can delete chatrooms\")`) inside `public shared ({ caller }) func deleteChatroomWithPassword(...)`, so anonymous callers are not blocked from deleting chatrooms by this gate.",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Room creation: make all media types (image, video, X post) optional so a room can be created with no media; keep media input fields visible; allow selecting only one media type when used.",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-10",
      "summary": "Fix bug where thumbnails for image-created rooms are not displaying.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "Update backend chatroom creation to allow empty media (no mediaUrl/mediaType) without trapping, while keeping the existing public function signatures unchanged.",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Caffeine Chats",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}