{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Internet Computer chat app experiencing production error where getChatrooms query response exceeds the 3MB IC query payload limit; plan is to fix by returning lightweight chatroom summaries to keep responses under the limit.",
  "architectural_notes": [
    "IC query responses are hard-limited to 3MB; getChatrooms must return lightweight summary fields only (no messages/blobs/large metadata) or be paginated/split."
  ],
  "known_issues": [
    "Production error: getChatrooms query rejected (IC0504) due to reply payload too large (~8.8MB > 3MB), causing 'Failed to Load Chats'."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-the-frontend-lobby-data-fetching-and-rendering-to-use-the-new-lightweight-chatroom-summary-response-for-the-chat-list-while-preserving-current-ux-loading-recovery-states-client-side-search-and-category-filtering-grid-layout-and-navigation-into-a-chatroom-if-thumbnails-media-are-not-available-in-the-lightweight-response-render-a-deterministic-placeholder-thumbnail-based-on-mediatype-instead-of-requiring-mediaurl-in-the-lobby-list-payload",
      "title": "Update the frontend Lobby data fetching and rendering to use the new lightweight chatroom summary response for the chat list while preserving current UX (loading/recovery states, client-side search and category filtering, grid layout, and navigation into a chatroom). If thumbnails/media are not available in the lightweight response, render a deterministic placeholder thumbnail based on mediaType instead of requiring mediaUrl in the Lobby list payload.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-chatroom-detail-view-continues-to-fetch-full-chatroom-data-only-when-needed-e-g-on-the-chatroom-page-so-the-lobby-list-remains-lightweight-and-the-overall-app-behavior-is-unchanged-aside-from-fixing-the-payload-size-issue",
      "title": "Ensure the chatroom detail view continues to fetch full chatroom data only when needed (e.g., on the chatroom page), so the Lobby list remains lightweight and the overall app behavior is unchanged aside from fixing the payload size issue.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix 'Failed to Load Chats' by reducing getChatrooms query response size (return lightweight chatroom summaries only; exclude large fields) to stay under IC 3MB query limit",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Modify the backend query used to power the Lobby chat list so it cannot exceed the Internet Computer 3MB query reply limit by returning only lightweight chatroom summary fields (exclude any potentially large text/blob-like fields such as full media URLs/data URLs and long descriptions).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Caffeine Chat",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}