{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 17,
  "summary": "Chattr is an anonymous, media-centric chatroom web app with a React + TanStack Router/React Query frontend and an Internet Computer (ICP) Motoko canister backend. Users browse a lobby of chatrooms (with live/active-user indicators), search or filter by category, create new chatrooms that require a media item (image upload, YouTube/Twitch URL, or Twitter/X post URL), and chat inside rooms with polling-based near-realtime updates. Messages support replies, emoji reactions (per-user), optional media (images, YouTube/Twitch embeds, Twitter embeds), and voice messages recorded in-browser. Rooms track view counts, compute “live” status from recent activity, and support pinning/unpinning a video message to a persistent pinned-player area. Users have a lightweight anonymous identity (local userId) plus editable username and avatar that are persisted to a backend profile and retroactively applied to past messages.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication context",
      "synonyms": [
        "II login",
        "AuthClient integration",
        "InternetIdentityProvider"
      ],
      "description": "Provides a React context/provider that initializes @dfinity/auth-client, loads any persisted delegation identity, exposes login/logout methods, and publishes login state and Identity for the app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Dynamic ICP actor creation (authenticated or anonymous)",
      "synonyms": [
        "useActor",
        "actor factory"
      ],
      "description": "Creates the backend canister actor using the current Internet Identity when available, otherwise an anonymous actor. On identity change, invalidates and refetches all non-actor React Query caches.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Backend access control initialization and role APIs",
      "synonyms": [
        "initializeAccessControl",
        "admin/user/guest roles"
      ],
      "description": "Motoko access-control module assigns the first non-anonymous initializer as admin and later principals as users. Exposes role queries and an admin-only role assignment method.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "SPA routing with deep links and 404 handling",
      "synonyms": [
        "TanStack Router",
        "ChatroomPage deep link"
      ],
      "description": "Defines lobby and chatroom routes with a shared layout, custom notFound UI, and direct navigation to /chatroom/:id with robust loading and not-found error states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Global app layout with header and conditional footer",
      "synonyms": [
        "RootLayout",
        "chatroom footer hidden"
      ],
      "description": "Renders a consistent Header and conditionally hides the Footer on chatroom routes to maximize vertical space for chat.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Lobby chatroom listing with periodic refresh",
      "synonyms": [
        "chatroom feed",
        "getChatrooms polling"
      ],
      "description": "Fetches chatrooms and displays them in a responsive grid with thumbnails, category badge, counts, and live indicator. Refreshes periodically via React Query polling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Chatroom search and category filtering",
      "synonyms": [
        "searchChatrooms",
        "filterChatroomsByCategory"
      ],
      "description": "Implements debounced text search and category badge filtering. Includes clear-filters behavior and focus restoration for improved UX.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Create chatroom with required media (image/video/twitter)",
      "synonyms": [
        "CreateChatroomDialog",
        "media-first rooms"
      ],
      "description": "Modal dialog to create a chatroom requiring topic, description, category, and one media item. Supports image upload (progress UI), YouTube/Twitch URL detection/validation, and Twitter/X URL validation with live embed preview.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Client-side media upload via data URLs and localStorage caching",
      "synonyms": [
        "blob-storage-id URLs",
        "data URL storage"
      ],
      "description": "Reads image/audio files as base64 data URLs, optionally caches them in localStorage under synthetic keys, and returns a tagged data URL including a blob-storage-id marker.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Chatroom page load + view count increment",
      "synonyms": [
        "incrementViewCount",
        "views tracking"
      ],
      "description": "When a chatroom is opened, increments its view count once per page load using a stable locally stored userId, and refreshes room/lobby query caches.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Live/active user status for chatrooms",
      "synonyms": [
        "isLive",
        "activeUserCount"
      ],
      "description": "Backend computes a room’s live status and active user count from recent user activity timestamps updated on view increments and message sends; frontend displays a LIVE badge.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Message timeline with polling and chronological ordering",
      "synonyms": [
        "ChatArea",
        "getMessageWithReactionsAndReplies"
      ],
      "description": "Fetches messages enriched with reactions and reply metadata, sorts chronologically, and polls to approximate realtime updates. Includes auto-scroll-to-bottom for new messages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Send messages with optional media and replyTo support",
      "synonyms": [
        "sendMessage mutation",
        "media messages",
        "replyToMessageId"
      ],
      "description": "Sends text messages including local username, stable senderId, optional avatarUrl, optional mediaUrl/mediaType (image/youtube/twitch/twitter/audio), and optional replyToMessageId.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Telegram-style reply UX (preview + quoted blocks + jump-to)",
      "synonyms": [
        "reply preview",
        "quoted replies",
        "scroll-to-message"
      ],
      "description": "Allows replying to a message with a composer preview (including thumbnail). Messages render a quoted parent block; clicking it scrolls to and temporarily highlights the parent message.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Emoji reactions with optimistic UI updates",
      "synonyms": [
        "addReaction/removeReaction",
        "reaction picker"
      ],
      "description": "Adds/removes emoji reactions per message using a stable local userId. Frontend performs optimistic cache updates and converts between Motoko List encoding and JS arrays with rollback on failure.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Pin/unpin video messages and pinned header player",
      "synonyms": [
        "PinnedVideo",
        "pinVideo",
        "unpinVideo"
      ],
      "description": "Supports pinning a YouTube or Twitch message as the room’s pinnedVideoId and shows an embedded pinned video at the top of the room with an unpin action.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Voice message recording, sending, and playback",
      "synonyms": [
        "audio messages",
        "MediaRecorder",
        "VoiceMessagePlayer"
      ],
      "description": "Records audio in-browser via MediaRecorder, encodes to data URL, sends as mediaType=audio, and renders a custom player UI with progress, duration, seeking, and playback synchronization to pause other audio.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Anonymous identity persistence for participation tracking",
      "synonyms": [
        "Anon#### username",
        "stable userId"
      ],
      "description": "Generates and persists an anonymous username (Anon####) plus a stable userId in localStorage to associate views/reactions/profile updates across sessions and username changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Username editing with backend profile persistence and retroactive updates",
      "synonyms": [
        "updateUsernameRetroactively",
        "profile name"
      ],
      "description": "Allows editing username in the header; updates localStorage, saves a backend UserProfile for the caller, and retroactively updates all past messages matching senderId.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Avatar selection (presets + upload + remove) with retroactive updates",
      "synonyms": [
        "AvatarPickerDialog",
        "updateAvatarRetroactively"
      ],
      "description": "Lets users select preset avatars, upload a custom avatar image, or remove the avatar. Persists to backend profile and retroactively updates avatarUrl across prior messages by senderId.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Media parsing utilities for YouTube/Twitch/Twitter",
      "synonyms": [
        "videoUtils",
        "thumbnails",
        "Twitch parent embed URL"
      ],
      "description": "Utility functions extract YouTube video IDs, Twitch clip/video/channel identifiers, generate thumbnail URLs, and build Twitch embed URLs with the required parent hostname parameter.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Rich chatroom card thumbnails and compact count formatting",
      "synonyms": [
        "ChatroomCard previews",
        "formatCompactNumber"
      ],
      "description": "Chatroom cards render YouTube thumbnails, attempt Twitch clip/VOD/stream thumbnails with fallback UI, and attempt Twitter oEmbed-derived thumbnails with fallback icons; counts can be formatted compactly (k/M/B).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Chatroom header layout with compact stats row",
      "synonyms": [
        "ChatArea header layout",
        "message/view counts under description",
        "category badge placement"
      ],
      "description": "Chatroom page header shows topic, description, and a compact stats row placed under the description showing message count and view count as numeric-only values, with the category badge aligned in the same row.",
      "reqIds": [
        "REQ-1",
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Backend HTTP outcalls utilities and Twitter oEmbed proxy endpoint",
      "synonyms": [
        "IC http_request",
        "transform function",
        "fetchTwitterOEmbed"
      ],
      "description": "Backend includes reusable HTTP GET/POST helpers with a transform function and exposes a fetchTwitterOEmbed endpoint for external metadata retrieval.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Caffeine blob-storage mixin endpoints (authorization/GC helpers)",
      "synonyms": [
        "blob-storage mixin",
        "gateway principals",
        "dead-blob pruning"
      ],
      "description": "Includes blob-storage Storage and Mixin modules providing gateway principal authorization, dead blob listing/confirmation, cashier refill flow, and a create-certificate stub.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-chatroom-header-stats-row-in-frontend-src-components-chatarea-tsx-so-the-horizontal-gap-between-the-message-reply-count-view-count-and-category-badge-is-0-5rem-instead-of-1rem",
      "title": "Update the chatroom header stats row in `frontend/src/components/ChatArea.tsx` so the horizontal gap between the message/reply count, view count, and category badge is 0.5rem (instead of 1rem).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-move-the-live-indicator-in-frontend-src-components-chatarea-tsx-so-it-appears-to-the-right-of-the-category-badge-in-the-same-stats-row-and-ensure-the-horizontal-gap-between-the-category-badge-and-the-live-indicator-is-0-5rem",
      "title": "Move the LIVE indicator in `frontend/src/components/ChatArea.tsx` so it appears to the right of the category badge in the same stats row, and ensure the horizontal gap between the category badge and the LIVE indicator is 0.5rem.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Adjust chatroom header layout spacing: set gaps between replies/views/category tag to 0.5rem (from 1rem) and move LIVE tag to the right of the category tag with 0.5rem gap.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a SPA built with TanStack Router (route tree, deep linking, notFound UI) and TailwindCSS + shadcn/ui component primitives.",
    "Data fetching/mutations are centralized in TanStack React Query hooks, using polling for chatrooms/messages and cache invalidation after mutations.",
    "ICP canister access is encapsulated in a useActor hook that creates an authenticated or anonymous actor and invalidates/refetches queries when identity changes.",
    "Internet Identity (AuthClient) integration is provided via a React context provider; authenticated identities trigger backend access-control initialization.",
    "Backend is a single Motoko canister using OrderedMap for chatroom/message/profile storage and List encoding for reactions/active users, returning enriched DTOs like ChatroomWithLiveStatus and MessageWithReactions.",
    "“Live” chatrooms are computed server-side from per-room active user records updated by sendMessage and incrementViewCount, with a server method for cleanup.",
    "Media handling on the client uses data URLs tagged with a synthetic blob-storage-id and optional localStorage caching; backend also includes a Caffeine blob-storage mixin (authorization + GC-related endpoints).",
    "Twitter embeds are rendered client-side via widgets.js; thumbnails/previews come from a mix of client-side heuristics and oEmbed fetching.",
    "UI layout uses a fixed chat header + optional pinned-video area + scrollable message list + fixed composer, with safe-area padding for mobile and iOS input zoom mitigation.",
    "Utility modules (videoUtils/formatters) encapsulate ID parsing, embed URL construction (including Twitch parent param), thumbnail URL generation, and compact number formatting."
  ],
  "known_issues": [
    "Client “uploads” store base64 data URLs in localStorage/inline strings; this can exceed browser limits and produces large payloads (no true remote blob store in the main flow).",
    "Duplicate media-upload implementations exist (shared uploadImage in hooks vs separate uploadImage/uploadAudio in MessageInput), increasing drift risk and inconsistent limits (e.g., avatar 5MB vs room/image 10MB).",
    "Backend viewCount increments on every open and does not deduplicate by userId; userId is only used for active-user tracking.",
    "Active user/live status depends on clients calling sendMessage/incrementViewCount; cleanupInactiveUsers is not scheduled automatically and may require an external trigger to keep lists fresh.",
    "Backend HTTP outcall helper decodes response bodies as UTF-8 text; it is unsuitable for binary thumbnail fetching and may trap/return invalid data for non-text responses.",
    "Reaction removal in backend decrements count regardless of whether the user previously reacted, and does not prune zero-count reactions; frontend compensates in optimistic UI but server state can accumulate/underflow logically.",
    "Pin/unpin endpoints do not validate that the pinned message is a video message (any messageId can be pinned).",
    "Access-control roles (admin/user/guest) are implemented but do not gate chatroom/message/reaction operations; roles currently have limited product impact.",
    "Twitter widgets.js is loaded/used in multiple places; rendering many tweet embeds can be heavy and is sensitive to theme switching/rehydration quirks.",
    "Some components are placeholders/empty (e.g., LoginPrompt.tsx, ProfileSetupModal.tsx), suggesting incomplete or unused onboarding/auth UX."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "Chattr",
  "clarification_mode": "pro",
  "clarification_rounds": 0
}